///////////////////////////////////////////////////////////////////////////////////////////////////////

// Copyright (c) 2021, ООО 1С-Софт

// Все права защищены. Эта программа и сопроводительные материалы предоставляются 

// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)

// Текст лицензии доступен по ссылке:

// https://creativecommons.org/licenses/by/4.0/legalcode

///////////////////////////////////////////////////////////////////////////////////////////////////////



Перем ИнформационнаяБазаФайловая Экспорт;



Перем ВерсияПлатформы Экспорт;

Перем ВерсияВнешнейОбработки Экспорт;



Перем мЗаписьXML;

Перем мСоответствиеИменТиповОбъектовУИ;

Перем мКонфигурацияВладелец;

Перем мОбъектВладелец;

Перем мОбъектРодитель;

Перем мКоличествоОбъектов, мКоличествоСвойств, мКоличествоЗначений;



Перем мЗначенийСвойстваИндексирование;

Перем мЗначенийСвойстваИндексированиеСДопУпорядочиванием;



Перем мСоответствиеРегистровИРегистраторов;

Перем мСоответствиеРегистраторовЗаполнено;



Перем мТипСтрока;

Перем мТипЧисло;

Перем мТипДата;

Перем мТипБулево;

Перем мТипХранилищеЗначения;

Перем мТипУникальныйИдентификатор;



Перем мПоследнееЗначениеТипа;

Перем мИсторияБадди; // кэш Buddy

Перем мПоследнийТипДанных;



Перем ТаблицаОбщихРеквизитов;

Перем ЕстьОбщиеРеквизиты;



// Функция, стартующая выгрузку структуры метаданных

Функция ВыполнитьВыгрузку(UUIDКонфигурации = "") Экспорт

	

	мСоответствиеРегистровИРегистраторов = Новый Соответствие;

	мСоответствиеРегистраторовЗаполнено = Ложь; 

	

	мПоследнееЗначениеТипа = Неопределено;

	мПоследнийТипДанных = Неопределено;

	

	мКоличествоОбъектов = 0;

	мКоличествоСвойств = 0;

	мКоличествоЗначений = 0;

	

	мСоответствиеИменТиповОбъектовУИ = Новый Соответствие();

	

	мЗаписьXML = Новый ЗаписьXML;

	

	мЗаписьXML.ОткрытьФайл(ИмяФайлаВыгрузки, "UTF-8");

	

	мЗаписьXML.ЗаписатьОбъявлениеXML();

	

	мЗаписьXML.ЗаписатьНачалоЭлемента("Конфигурация");

	

		мЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");

			

		мЗаписьXML.ЗаписатьАтрибут("Имя", XMLСтрока(Метаданные.Имя));

		

		ВыгрузитьКонфигурацию(UUIDКонфигурации);

		

		ВыгрузитьПримитивныеОбъекты();

		

		ЗаполнитьТаблицуОбщихРеквизитов();

		

		

		ВыгрузитьОбъекты("Справочники",             "СправочникСсылка.",             "Справочники");

		ВыгрузитьОбъекты("Документы",               "ДокументСсылка.",               "Документы");

		ВыгрузитьОбъекты("Перечисления",            "ПеречислениеСсылка.",           "Перечисления");

		ВыгрузитьОбъекты("ПланыВидовХарактеристик", "ПланВидовХарактеристикСсылка.", "Планы видов характеристик");

		//ВыгрузитьОбъекты("ПланыСчетов",             "ПланСчетовСсылка.",             "Планы счетов");

		//ВыгрузитьОбъекты("ПланыВидовРасчета",       "ПланВидовРасчетаСсылка.",       "Планы видов расчета");

		

		Если НеВыгружатьРегистрыСведений = Ложь Тогда

			

			ВыгрузитьОбъекты("РегистрыСведений", "РегистрСведенийЗапись.", "Регистры сведений");

			

		КонецЕсли;

		

		Если НеВыгружатьРегистрыНакопления = Ложь Тогда

		

			ВыгрузитьОбъекты("РегистрыНакопления", "РегистрНакопленияЗапись.", "Регистры накопления");

			

		КонецЕсли;

		

		Если НеВыгружатьРегистрыБухгалтерии = Ложь Тогда

		

			ВыгрузитьОбъекты("РегистрыБухгалтерии", "РегистрБухгалтерииЗапись.", "Регистры бухгалтерии");

			

		КонецЕсли;

		

		Если НеВыгружатьРегистрыРасчета = Ложь Тогда

		

			ВыгрузитьОбъекты("РегистрыРасчета", "РегистрРасчетаЗапись.", "Регистры расчета");

			

		КонецЕсли;

		

		ВыгрузитьОбъекты("БизнесПроцессы",          "БизнесПроцессСсылка.",          "Бизнес-процессы");

		ВыгрузитьОбъекты("Задачи",                  "ЗадачаСсылка.",                 "Задачи");

		ВыгрузитьОтчеты();

		

	мЗаписьXML.ЗаписатьКонецЭлемента(); // "Конфигурация"

	

	мЗаписьXML.Закрыть();

	Попытка
		СостояниеИндикатораПрогресса.Заголовок = "Выгрузка завершена";
		Индикатор.Значение = 0;
	Исключение КонецПопытки;

	

	Возврат Истина;

	

КонецФункции // ВыполнитьВыгрузку()



Процедура ВыгрузитьКонфигурацию(UUIDКонфигурации = "")

	

	мЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Конфигурации");

		Если ЗначениеЗаполнено(UUIDКонфигурации) Тогда

			Если ТипЗнч(UUIDКонфигурации) = Тип("УникальныйИдентификатор") Тогда

				мКонфигурацияВладелец = UUIDКонфигурации;

			Иначе

				мКонфигурацияВладелец = Новый УникальныйИдентификатор(Строка(UUIDКонфигурации));

			КонецЕсли;

		Иначе

			мКонфигурацияВладелец = Новый УникальныйИдентификатор();

		КонецЕсли;

		ЗаписатьXML(мЗаписьXML, мКонфигурацияВладелец, "Ref");

		ЗаписатьXML(мЗаписьXML, Ложь, "IsFolder");

		ЗаписатьXML(мЗаписьXML, Ложь, "DeletionMark");

		ЗаписатьXML(мЗаписьXML, "00000000-0000-0000-0000-000000000000", "Parent");

		//ЗаписатьXML(мЗаписьXML, Метаданные.Имя, "Description");

		ЗаписатьXML(мЗаписьXML, Метаданные.Имя, "Имя");

		ЗаписатьXML(мЗаписьXML, Метаданные.Синоним, "Синоним");

		ЗаписатьXML(мЗаписьXML, Метаданные.Комментарий, "Комментарий");

		ЗаписатьXML(мЗаписьXML, Метаданные.Версия, "Версия");

		ЗаписатьXML(мЗаписьXML, ТекущаяДата(), "ДатаОбновления");

		ЗаписатьXML(мЗаписьXML, "УправляемоеПриложение", "Приложение");

	мЗаписьXML.ЗаписатьКонецЭлемента(); // "CatalogObject.Конфигурации"

	

КонецПроцедуры // ВыгрузитьКонфигурацию()



Процедура ВыгрузитьПримитивныеОбъекты()

	

	ВыгрузитьПримитивныйОбъект("Число", "Число", "Число", "Число");

	ВыгрузитьПримитивныйОбъект("Строка", "Строка", "Строка", "Строка");

	ВыгрузитьПримитивныйОбъект("Дата", "Дата", "Дата", "Дата");

	ВыгрузитьПримитивныйОбъект("Булево", "Булево", "Булево", "Булево");

	ВыгрузитьПримитивныйОбъект("ХранилищеЗначения", "ХранилищеЗначения", "Хранилище значения", "Хранилище значения");

	ВыгрузитьПримитивныйОбъект("УникальныйИдентификатор", "УникальныйИдентификатор", "Уникальный идентификатор", "Уникальный идентификатор");

	ВыгрузитьПримитивныйОбъект("КонстантыНабор", "НаборКонстант", "Набор констант", "Набор констант");

	

КонецПроцедуры // ВыгрузитьПримитивныеОбъекты()



Процедура ВыгрузитьПримитивныйОбъект(Имя, ОбъектИмя, ОбъектСиноним, ОбъектКомментарий)

	

	мКоличествоОбъектов = мКоличествоОбъектов + 1;

	

	мЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Объекты");

	

	    УИОбъекта = ПолучитьУИИмениТипа(ОбъектИмя);

		

		ЗаписатьXML(мЗаписьXML, УИОбъекта, "Ref");

		ЗаписатьXML(мЗаписьXML, Ложь, "IsFolder");

		ЗаписатьXML(мЗаписьXML, Ложь, "DeletionMark");

		мЗаписьXML.ЗаписатьНачалоЭлемента("Owner");

			мЗаписьXML.ЗаписатьАтрибут("xsi:type", "CatalogRef.Конфигурации");

			мЗаписьXML.ЗаписатьТекст(Строка(мКонфигурацияВладелец));

		мЗаписьXML.ЗаписатьКонецЭлемента(); // "Owner"

		ЗаписатьXML(мЗаписьXML, "00000000-0000-0000-0000-000000000000", "Parent");

		ЗаписатьXML(мЗаписьXML, Имя, "Имя");

		ЗаписатьXML(мЗаписьXML, ОбъектСиноним, "Синоним");

		ЗаписатьXML(мЗаписьXML, ОбъектКомментарий, "Комментарий");

		ЗаписатьXML(мЗаписьXML, ОбъектИмя, "Тип");

		ЗаписатьXML(мЗаписьXML, Ложь, "Иерархический");

		ЗаписатьXML(мЗаписьXML, "", "ВидИерархии");

		ЗаписатьXML(мЗаписьXML, Ложь, "ОграничиватьКоличествоУровней");

		ЗаписатьXML(мЗаписьXML, 0, "КоличествоУровней");

		ЗаписатьXML(мЗаписьXML, "", "Периодичность");

		ЗаписатьXML(мЗаписьXML, Ложь, "Подчиненный");

		

	мЗаписьXML.ЗаписатьКонецЭлемента();

	

	Если ОбъектИмя = "НаборКонстант" Тогда

		

		мОбъектВладелец = УИОбъекта;

		

		Для каждого Свойство из Метаданные.Константы Цикл

			

			ВыгрузитьСвойство(Свойство, "Реквизит");

			

		КонецЦикла;

		

	КонецЕсли;

	

КонецПроцедуры // ВыгрузитьПримитивныйОбъект()



Процедура ВыгрузитьОбъекты(ИмяОбъекта, ПрефиксИмени, Представление)

	

	КоличествоОбъектов = Метаданные[ИмяОбъекта].Количество();

	

	Если КоличествоОбъектов = 0 Тогда

		

		Возврат;

		

	Иначе

		

		мКоличествоОбъектов = мКоличествоОбъектов + КоличествоОбъектов + 1;

		

	КонецЕсли;

	

	мЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Объекты");

	    мОбъектРодитель = Новый УникальныйИдентификатор();

		ЗаписатьXML(мЗаписьXML, мОбъектРодитель, "Ref");

		ЗаписатьXML(мЗаписьXML, Истина, "IsFolder");

		ЗаписатьXML(мЗаписьXML, Ложь, "DeletionMark");

		мЗаписьXML.ЗаписатьНачалоЭлемента("Owner");

			мЗаписьXML.ЗаписатьАтрибут("xsi:type", "CatalogRef.Конфигурации");

			мЗаписьXML.ЗаписатьТекст(Строка(мКонфигурацияВладелец));

		мЗаписьXML.ЗаписатьКонецЭлемента(); // "Owner"

		ЗаписатьXML(мЗаписьXML, "00000000-0000-0000-0000-000000000000", "Parent");

		ЗаписатьXML(мЗаписьXML, Представление, "Имя");

		ЗаписатьXML(мЗаписьXML, ИмяОбъекта, "Синоним");

		ЗаписатьXML(мЗаписьXML, "", "Тип");

	мЗаписьXML.ЗаписатьКонецЭлемента(); // "CatalogObject.Объекты"

	

	ИнициализацияИндикатора(ИмяОбъекта);

	

	Для каждого Объект из Метаданные[ИмяОбъекта] Цикл

		

		ВыгрузитьОбъект(Объект, ПрефиксИмени);

		ВыгрузитьОсновныеСвойства(Объект);

		ВыгрузитьСвойства(Объект);

		ВыгрузитьТабличныеЧасти(Объект);

		ВыгрузитьЗначенияПеречисления(Объект);

		ВыгрузитьПредопределенныеЗначения(Объект, ИмяОбъекта);

		

			

		//Для Планов видов расчета необходимо выгрузить предопределенные табличные части

		Если ИмяОбъекта = "ПланыВидовРасчета" Тогда

			

			ВыгрузитьПредопределенныеТабличныеЧастиПВР(Объект);

			

					

		КонецЕсли;

		

		ИнкрементацияИндикатора();

		

	КонецЦикла;

	

КонецПроцедуры // ВыгрузитьОбъекты()



Процедура ВыгрузитьОтчеты()

	

	СтрокиОтчетов = ПолучитьСтрокиОтчетовДляВыгрузки();

	

	Для Каждого СтрокаОтчета Из СтрокиОтчетов Цикл

		мЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Отчеты");

			ЗаписатьXML(мЗаписьXML, СтрокаОтчета.Отчет, "Имя");

			ЗаписатьXML(мЗаписьXML, СтрокаОтчета.Синоним, "Синоним");

			ЗаписатьXML(мЗаписьXML, СтрокаОтчета.Комментарий, "Комментарий");

			ЗаписатьXML(мЗаписьXML, СтрокаОтчета.Схема, "ИмяСхемыКомпоновкиДанных");

			ЗаписатьXML(мЗаписьXML, СтрокаОтчета.НаборДанных, "НаборДанных");

		мЗаписьXML.ЗаписатьКонецЭлемента(); // "CatalogObject.Отчеты"

	КонецЦикла;

	

КонецПроцедуры // ВыгрузитьОтчеты()



Функция ПолучитьСтрокиОтчетовДляВыгрузки() Экспорт

	

	Результат = Новый ТаблицаЗначений;

	Результат.Колонки.Добавить("Отчет");

	Результат.Колонки.Добавить("Синоним");

	Результат.Колонки.Добавить("Комментарий");

	Результат.Колонки.Добавить("Схема");

	Результат.Колонки.Добавить("НаборДанных");

	Результат.Колонки.Добавить("Запрос");

	Результат.Колонки.Добавить("ЭтоЗапросныйНабор");

	

	Если Метаданные.Отчеты.Количество() = 0 Тогда

		Возврат Результат;

	КонецЕсли;

	

	Для Каждого ОтчетМД Из Метаданные.Отчеты Цикл

		

		ИмяОтчета = Строка(ОтчетМД.Имя);

		СинонимОтчета = Строка(ОтчетМД.Синоним);

		КомментарийОтчета = Строка(ОтчетМД.Комментарий);

		ОтчетОбъект = Отчеты[ИмяОтчета].Создать();

		

		ДобавленоСтрокПоОтчету = Ложь;

		

		Для Каждого Макет Из ОтчетМД.Макеты Цикл

			Если Строка(Макет.ТипМакета) <> "СхемаКомпоновкиДанных" Тогда

				Продолжить;

			КонецЕсли;

			

			ДобавленоСтрокПоСхеме = Ложь;

			СКД = ОтчетОбъект.ПолучитьМакет(Макет.Имя);

			

			Для Каждого НаборДанных Из СКД.НаборыДанных Цикл

				Если ТипЗнч(НаборДанных) <> Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда

					Продолжить;

				КонецЕсли;

				

				СтрокаТаблицы = Результат.Добавить();

				СтрокаТаблицы.Отчет = ИмяОтчета;

				СтрокаТаблицы.Синоним = СинонимОтчета;

				СтрокаТаблицы.Комментарий = КомментарийОтчета;

				СтрокаТаблицы.Схема = Строка(Макет.Имя);

				СтрокаТаблицы.НаборДанных = Строка(НаборДанных.Имя);

				СтрокаТаблицы.Запрос = Строка(НаборДанных.Запрос);

				СтрокаТаблицы.ЭтоЗапросныйНабор = Истина;

				ДобавленоСтрокПоСхеме = Истина;

				ДобавленоСтрокПоОтчету = Истина;

			КонецЦикла;

			

			Если Не ДобавленоСтрокПоСхеме Тогда

				СтрокаТаблицы = Результат.Добавить();

				СтрокаТаблицы.Отчет = ИмяОтчета;

				СтрокаТаблицы.Синоним = СинонимОтчета;

				СтрокаТаблицы.Комментарий = КомментарийОтчета;

				СтрокаТаблицы.Схема = Строка(Макет.Имя);

				СтрокаТаблицы.НаборДанных = "";

				СтрокаТаблицы.Запрос = "";

				СтрокаТаблицы.ЭтоЗапросныйНабор = Ложь;

				ДобавленоСтрокПоОтчету = Истина;

			КонецЕсли;

		КонецЦикла;

		

		Если Не ДобавленоСтрокПоОтчету Тогда

			СтрокаТаблицы = Результат.Добавить();

			СтрокаТаблицы.Отчет = ИмяОтчета;

			СтрокаТаблицы.Синоним = СинонимОтчета;

			СтрокаТаблицы.Комментарий = КомментарийОтчета;

			СтрокаТаблицы.Схема = "";

			СтрокаТаблицы.НаборДанных = "";

			СтрокаТаблицы.Запрос = "";

			СтрокаТаблицы.ЭтоЗапросныйНабор = Ложь;

		КонецЕсли;

		

	КонецЦикла;

	

	Возврат Результат;

	

КонецФункции



Процедура ВыгрузитьОбъект(Объект, ПрефиксИмени)

	

	мЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Объекты");

	

		ИмяТипаОбъекта = ПрефиксИмени + Объект.Имя;

		

		УИОбъекта = ПолучитьУИИмениТипа(ИмяТипаОбъекта);

		мОбъектВладелец = УИОбъекта;

		

		ЗаписатьXML(мЗаписьXML, УИОбъекта, "Ref");

		ЗаписатьXML(мЗаписьXML, Ложь, "IsFolder");

		ЗаписатьXML(мЗаписьXML, Ложь, "DeletionMark");

		мЗаписьXML.ЗаписатьНачалоЭлемента("Owner");

			мЗаписьXML.ЗаписатьАтрибут("xsi:type", "CatalogRef.Конфигурации");

			мЗаписьXML.ЗаписатьТекст(Строка(мКонфигурацияВладелец));

		мЗаписьXML.ЗаписатьКонецЭлемента(); // "Owner"

		ЗаписатьXML(мЗаписьXML, мОбъектРодитель, "Parent");

		ЗаписатьXML(мЗаписьXML, Объект.Имя, "Имя");

		ЗаписатьXML(мЗаписьXML, Объект.Синоним, "Синоним");

		ЗаписатьXML(мЗаписьXML, Объект.Комментарий, "Комментарий");

		ЗаписатьXML(мЗаписьXML, Лев(Объект.ПолноеИмя(), Найти(Объект.ПолноеИмя(), ".") - 1), "Тип");

		

		ВыгрузитьНастраиваемыеСвойстваОбъекта(Объект);

		

	мЗаписьXML.ЗаписатьКонецЭлемента();

	

КонецПроцедуры // ВыгрузитьОбъект()



Процедура ВыгрузитьНастраиваемыеСвойстваОбъекта(Объект)

	

	Попытка

		

		Иерархический = Объект.Иерархический;

		

	Исключение

		

		Иерархический = Ложь;

		

	КонецПопытки;

	

	ЗаписатьXML(мЗаписьXML, Иерархический, "Иерархический");

	

	Попытка

		

		ВидИерархии = Объект.ВидИерархии;

		

	Исключение

		

		ВидИерархии = "";

		

	КонецПопытки;

	

	ЗаписатьXML(мЗаписьXML, Строка(ВидИерархии), "ВидИерархии");

	

	Попытка

		

		ОграничиватьКоличествоУровней = Объект.ОграничиватьКоличествоУровней;

		

	Исключение

		

		ОграничиватьКоличествоУровней = Ложь;

		

	КонецПопытки;

	

	ЗаписатьXML(мЗаписьXML, ОграничиватьКоличествоУровней, "ОграничиватьКоличествоУровней");

	

	Попытка

		

		КоличествоУровней = Объект.КоличествоУровней;

		

	Исключение

		

		КоличествоУровней = 0;

		

	КонецПопытки;

	

	ЗаписатьXML(мЗаписьXML, КоличествоУровней, "КоличествоУровней");

	

		

	Периодичность = "";

	

	Попытка

		

		Периодичность = Объект.ПериодичностьНомера;

		

	Исключение

	КонецПопытки;

	

	Попытка

		

		Периодичность = Объект.ПериодичностьРегистраСведений;

		

	Исключение

	КонецПопытки;

	

	Попытка

		

		Периодичность = Объект.Периодичность;

		

	Исключение

	КонецПопытки;

	

	ЗаписатьXML(мЗаписьXML, Строка(Периодичность), "Периодичность");

	

	Попытка

		

		Если Объект.Владельцы.Количество() Тогда

			

			Подчиненный = Истина;

			

		Иначе

			

			Подчиненный = Ложь;

			

		КонецЕсли;

		

	Исключение

		

		Подчиненный = Ложь;

		

	КонецПопытки;

	

	ЗаписатьXML(мЗаписьXML, Подчиненный, "Подчиненный");

	

КонецПроцедуры // ВыгрузитьНастраиваемыеСвойстваОбъекта()



Процедура ВыгрузитьОсновныеСвойства(Объект, Родитель = "00000000-0000-0000-0000-000000000000")

	

	// ВводитсяНаОсновании, значит может быть помечен на удаление

	~ВводитсяНаОсновании:

	Попытка

		

		ВводитсяНаОсновании = Объект.ВводитсяНаОсновании;

		

	Исключение

		

		Перейти ~ДлинаКода;

		

	КонецПопытки;

	

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

	

	Свойство.Имя = "ПометкаУдаления";

	Свойство.Синоним = "Пометка удаления";

	Свойство.Комментарий = "Пометка удаления";

	Свойство.Тип = Новый ОписаниеТипов("Булево");

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	

	// ДлинаКода, значит может быть код

	~ДлинаКода:

	Попытка

		

		ДлинаКода = Объект.ДлинаКода;

		

	Исключение

		

		Перейти ~ДлинаНаименования;

		

	КонецПопытки;

	

	Если ДлинаКода > 0 Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "Код";

		Свойство.Синоним = "Код";

		Свойство.Комментарий = "Код";

		

		Попытка

			

			ТипКода = Объект.ТипКода;

			

		Исключение

			

			ТипКода = Неопределено;

			

		КонецПопытки;

		

		Если ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Строка ИЛИ

			ТипКода = Метаданные.СвойстваОбъектов.ТипКодаПланаВидовРасчета.Строка ИЛИ

			ТипКода = Неопределено Тогда

			

			Свойство.Тип = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(Объект.ДлинаКода, ДопустимаяДлина.Фиксированная));

			

		ИначеЕсли ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Число ИЛИ

			ТипКода = Метаданные.СвойстваОбъектов.ТипКодаПланаВидовРасчета.Число Тогда

			

			Свойство.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(Объект.ДлинаКода, 0, ДопустимыйЗнак.Неотрицательный));

			

		КонецЕсли;

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);



	КонецЕсли;

	

	

	// ДлинаНаименования, значит может быть наименование

	~ДлинаНаименования:

	Попытка

		

		ДлинаНаименования = Объект.ДлинаНаименования;

		

	Исключение

		

		Перейти ~Иерархический;

		

	КонецПопытки;

	

	Если ДлинаНаименования > 0 Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "Наименование";

		Свойство.Синоним = "Наименование";

		Свойство.Комментарий = "Наименование";

		Свойство.Тип = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(Объект.ДлинаНаименования, ДопустимаяДлина.Переменная));

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	

	// Иерархический, значит есть родитель

	~Иерархический:

	Попытка

		

		Иерархический = Объект.Иерархический;

		

	Исключение

		

		Перейти ~ДлинаНомера;

		

	КонецПопытки;

	

	Если Иерархический Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "Родитель";

		Свойство.Синоним = "Родитель";

		Свойство.Комментарий = "Родитель";

		Свойство.Тип = Новый ОписаниеТипов(СтрЗаменить(Объект.ПолноеИмя(), ".", "Ссылка."));

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	

	// ВидИерархии, значит может быть группой

	~ВидИерархии:

	Попытка

		

		ВидИерархии = Объект.ВидИерархии;

		

	Исключение

		

		Перейти ~ДополнительныеЗначенияХарактеристик;

		

	КонецПопытки;

	

	Если Иерархический И ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "ЭтоГруппа";

		Свойство.Синоним = "Это группа";

		Свойство.Комментарий = "Это группа";

		Свойство.Тип = Новый ОписаниеТипов("Булево");

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	// ДополнительныеЗначенияХарактеристик, значит может быть группой

	~ДополнительныеЗначенияХарактеристик:

	Попытка

		

		ДополнительныеЗначенияХарактеристик = Объект.ДополнительныеЗначенияХарактеристик;

		

	Исключение

		

		Перейти ~ДлинаНомера;

		

	КонецПопытки;

	

	Если Иерархический Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "ЭтоГруппа";

		Свойство.Синоним = "Это группа";

		Свойство.Комментарий = "Это группа";

		Свойство.Тип = Новый ОписаниеТипов("Булево");

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	// ДлинаНомера, значит может быть номер

	~ДлинаНомера:

	Попытка

		

		ДлинаНомера = Объект.ДлинаНомера;

		

	Исключение

		

		Перейти ~Проведение;

		

	КонецПопытки;

	

	Если ДлинаНомера > 0 Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "Номер";

		Свойство.Синоним = "Номер";

		Свойство.Комментарий = "Номер";

		Свойство.Тип = Новый ОписаниеТипов();

		

		Попытка

			

			ТипНомера = Объект.ТипНомера;

			

		Исключение

			

			ТипНомера = Неопределено;

			

		КонецПопытки;

		

		Если ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераДокумента.Строка ИЛИ

			ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераБизнесПроцесса.Строка ИЛИ

			ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераЗадачи.Строка ИЛИ

			ТипНомера = Неопределено Тогда

			

			Свойство.Тип = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(Объект.ДлинаНомера, ДопустимаяДлина.Переменная));

			

		ИначеЕсли ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераДокумента.Число ИЛИ

			ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераБизнесПроцесса.Число ИЛИ

			ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераЗадачи.Число Тогда

			

			Свойство.Тип = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(Объект.ДлинаНомера, 0, ДопустимыйЗнак.Неотрицательный));

			

		КонецЕсли;

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	

	//Проведение, значит есть дата и может быть признак проведенности

	~Проведение:

	Попытка

		

		Проведение = Объект.Проведение;

		

	Исключение

		

		Проведение = Ложь;

		

		Попытка

		

			ТипНомераЗадачи = Объект.ТипНомера;

			

		Исключение

			

			Перейти ~Владельцы;

			

		КонецПопытки;

		

	КонецПопытки;

	

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

	

	Свойство.Имя = "Дата";

	Свойство.Синоним = "Дата";

	Свойство.Комментарий = "Дата";

	Свойство.Тип = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	Если Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "Проведен";

		Свойство.Синоним = "Проведен";

		Свойство.Комментарий = "Проведен";

		Свойство.Тип = Новый ОписаниеТипов("Булево");

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

		

	//Владельцы, значит могут быть владельцы

	~Владельцы:

	Попытка

		

		Владельцы = Объект.Владельцы;

		

	Исключение

		

		Перейти ~МодульНабораЗаписей;

		

	КонецПопытки;

	

	Если Владельцы.Количество() > 0 Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "Владелец";

		Свойство.Синоним = "Владелец";

		Свойство.Комментарий = "Владелец";

		

		МассивТиповВладельцев = Новый Массив;

		

		Для каждого Владелец из Владельцы Цикл

			

			МассивТиповВладельцев.Добавить(Тип(СтрЗаменить(Владелец.ПолноеИмя(), ".", "Ссылка.")));

			

		КонецЦикла;

		

		Свойство.Тип = Новый ОписаниеТипов(МассивТиповВладельцев);

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	

	//МодульНабораЗаписей, значит это регистр

	~МодульНабораЗаписей:

	Попытка

		

		МодульНабораЗаписей = Объект.МодульНабораЗаписей;

		

	Исключение

		

		Перейти ~ПериодичностьРегистраСведений;

		

	КонецПопытки;

	

	// Для всех регистров надо выгрузить "Активность" и "Регистратор"

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

	

	Свойство.Имя = "Активность";

	Свойство.Синоним = "Активность";

	Свойство.Комментарий = "Активность";

	Свойство.Тип = Новый ОписаниеТипов("Булево");

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	ВыгрузитьРегистраторы(Объект, Родитель);

	

	

	// ПериодичностьРегистраСведений, значит регистр сведений

	~ПериодичностьРегистраСведений:

	Попытка

		

		ПериодичностьРегистраСведений = Объект.ПериодичностьРегистраСведений;

		

	Исключение

		

		Перейти ~ВидРегистра;

		

	КонецПопытки;

	

	// Период (только для периодических)

	Если ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "Период";

		Свойство.Синоним = "Период";

		Свойство.Комментарий = "Период";

		Свойство.Тип = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	

	// ВидРегистра, значит регистр накопления

	~ВидРегистра:

	Попытка

		

		ВидРегистра = Объект.ВидРегистра;

		

	Исключение

		

		Перейти ~Корреспонденция;

		

	КонецПопытки;

	

	// Период

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

	

	Свойство.Имя = "Период";

	Свойство.Синоним = "Период";

	Свойство.Комментарий = "Период";

	Свойство.Тип = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	// ВидДвижения (только для остатков)

	Если ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда

		

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "ВидДвижения";

		Свойство.Синоним = "Вид движения";

		Свойство.Комментарий = "Вид движения";

		Свойство.Тип = Новый ОписаниеТипов();

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	

	//Корреспонденция, значит регистр бухгалтерии

	~Корреспонденция:

	Попытка

		

		Корреспонденция = Объект.Корреспонденция;

		

	Исключение

		

		Перейти ~РегистрРасчета;

		

	КонецПопытки;

	

	// Период

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

	

	Свойство.Имя = "Период";

	Свойство.Синоним = "Период";

	Свойство.Комментарий = "Период";

	Свойство.Тип = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	Если Корреспонденция Тогда

		

		Если Объект.ПланСчетов <> Неопределено Тогда

			

			// СчетДт (только с корреспонденцией)

			Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

			

			Свойство.Имя = "СчетДт";

			Свойство.Синоним = "Счет Дт";

			Свойство.Комментарий = "Счет Дт";

			Свойство.Тип = Новый ОписаниеТипов(СтрЗаменить(Объект.ПланСчетов.ПолноеИмя(), ".", "Ссылка."));

			

			ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

			

			// СчетКт (только с корреспонденцией)

			Свойство.Имя = "СчетКт";

			Свойство.Синоним = "Счет Кт";

			Свойство.Комментарий = "Счет Кт";

			Свойство.Тип = Новый ОписаниеТипов(СтрЗаменить(Объект.ПланСчетов.ПолноеИмя(), ".", "Ссылка."));

			

			ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

			

			Если Объект.ПланСчетов.ВидыСубконто <> Неопределено Тогда

				

				// СубконтоДт (только с корреспонденцией)

				Свойство.Имя = "СубконтоДт";

				Свойство.Синоним = "Субконто Дт";

				Свойство.Комментарий = "Субконто Дт";

				Свойство.Тип = Объект.ПланСчетов.ВидыСубконто.Тип;

				

				ВыгрузитьСвойство(Свойство, "ВидыСубконтоСчета", Родитель);

				

				// СубконтоКт (только с корреспонденцией)

				Свойство.Имя = "СубконтоКт";

				Свойство.Синоним = "Субконто Кт";

				Свойство.Комментарий = "Субконто Кт";

				Свойство.Тип = Объект.ПланСчетов.ВидыСубконто.Тип;

				

				ВыгрузитьСвойство(Свойство, "ВидыСубконтоСчета", Родитель);

				

			КонецЕсли;

			

		КонецЕсли;

		

	Иначе

		

		// ВидДвижения (только без корреспонденции)

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "ВидДвижения";

		Свойство.Синоним = "Вид движения";

		Свойство.Комментарий = "Вид движения";

		Свойство.Тип = Новый ОписаниеТипов();

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

		Если Объект.ПланСчетов <> Неопределено Тогда

			

			// Счет (только без корреспонденции)

			Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

			

			Свойство.Имя = "Счет";

			Свойство.Синоним = "Счет";

			Свойство.Комментарий = "Счет";

			Свойство.Тип = Новый ОписаниеТипов(СтрЗаменить(Объект.ПланСчетов.ПолноеИмя(), ".", "Ссылка."));

			

			ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

			

			// Субконто (только без корреспонденции)

			Свойство.Имя = "Субконто";

			Свойство.Синоним = "Субконто";

			Свойство.Комментарий = "Субконто";

			Свойство.Тип = Объект.ПланСчетов.ВидыСубконто.Тип;

			

			ВыгрузитьСвойство(Свойство, "ВидыСубконтоСчета", Родитель);

			

		КонецЕсли;

		

	КонецЕсли;

	

	

	// РегистрРасчета, значит регистр расчета

	~РегистрРасчета: //ПланВидовРасчета

	Попытка

		

		ПланВидовРасчета = Объект.ПланВидовРасчета;

		

	Исключение

		

		Перейти ~ПланВидовРасчета;

		

	КонецПопытки;

	

	// ВидРасчета

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

	

	Свойство.Имя = "ВидРасчета";

	Свойство.Синоним = "Вид расчета";

	Свойство.Комментарий = "Вид расчета";

	Свойство.Тип = Новый ОписаниеТипов(СтрЗаменить(Объект.ПланВидовРасчета.ПолноеИмя(), ".", "Ссылка."));

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	// ПериодРегистрации

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

	

	Свойство.Имя = "ПериодРегистрации";

	Свойство.Синоним = "Период регистрации";

	Свойство.Комментарий = "Период регистрации";

	Свойство.Тип = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	Если Объект.БазовыйПериод Тогда

		

		// БазовыйПериодНачало (только для имеющих признак "Базовый период")

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "БазовыйПериодНачало";

		Свойство.Синоним = "Базовый период начало";

		Свойство.Комментарий = "Базовый период начало";

		Свойство.Тип = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

		// БазовыйПериодКонец (только для имеющих признак "Базовый период")

		Свойство.Имя = "БазовыйПериодКонец";

		Свойство.Синоним = "Базовый период конец";

		Свойство.Комментарий = "Базовый период конец";

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	Если Объект.ПериодДействия Тогда

		

		// ПериодДействияНачало (только для имеющих признак "Период действия")

		Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

		Свойство.Имя = "ПериодДействияНачало";

		Свойство.Синоним = "Период действия начало";

		Свойство.Комментарий = "Период действия начало";

		Свойство.Тип = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

		// ПериодДействияКонец (только для имеющих признак "Период действия")

		Свойство.Имя = "ПериодДействияКонец";

		Свойство.Синоним = "Период действия конец";

		Свойство.Комментарий = "Период действия конец";

		

		ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

		

	КонецЕсли;

	

	// Сторно

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

	

	Свойство.Имя = "Сторно";

	Свойство.Синоним = "Сторно";

	Свойство.Комментарий = "Сторно";

	Свойство.Тип = Новый ОписаниеТипов("Булево");

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);



	

	// ПланВидовРасчета, значит план видов расчета

	~ПланВидовРасчета: //ПланВидовРасчета

	Попытка

		

		ИспользованиеПериодаДействия = Объект.ИспользованиеПериодаДействия;

		

		Если Не ИспользованиеПериодаДействия Тогда 

			

			Перейти ~КартаМаршрута;

			

		КонецЕсли;

		

	Исключение

		

		Перейти ~КартаМаршрута;

		

	КонецПопытки;

	

	// ПериодДействияБазовый

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

	

	Свойство.Имя = "ПериодДействияБазовый";

	Свойство.Синоним = "Период действия базовый";

	Свойство.Комментарий = "Период действия базовый";

	Свойство.Тип = Новый ОписаниеТипов("Булево",,,);

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	

	// бизнес-процессы

	~КартаМаршрута: 

	Попытка

		

		Карта = Объект.КартаМаршрута;

		

	Исключение

		

		Перейти ~РеквизитыАдресации;

		

	КонецПопытки;

	

	// стартован и завершен

	

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

	Свойство.Имя = "Стартован";

	Свойство.Синоним = "Стартован";

	Свойство.Комментарий = "Стартован";

	Свойство.Тип = Новый ОписаниеТипов("Булево");

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	Свойство.Имя = "Завершен";

	Свойство.Синоним = "Завершен";

	Свойство.Комментарий = "Завершен";

	Свойство.Тип = Новый ОписаниеТипов("Булево");

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	// ведущая задача

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

	Свойство.Имя = "ВедущаяЗадача";

	Свойство.Синоним = "ВедущаяЗадача";

	Свойство.Комментарий = "ВедущаяЗадача";

	

	МассивТиповЗадач = Новый Массив;

	

	Для каждого Задача из Метаданные.Задачи Цикл

		

		МассивТиповЗадач.Добавить(Тип("ЗадачаСсылка." + Задача.Имя));

		

	КонецЦикла;

	

	Свойство.Тип = Новый ОписаниеТипов(МассивТиповЗадач);

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	

	~РеквизитыАдресации: 

	Попытка

		

		РеквизитыАдресации = Объект.РеквизитыАдресации;

		

		Для Каждого РеквизитАдресации Из РеквизитыАдресации Цикл

			

			Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

			Свойство.Имя = РеквизитАдресации.Имя;

			Свойство.Синоним = РеквизитАдресации.Синоним;

			Свойство.Комментарий = РеквизитАдресации.Комментарий;

			

			МассивТипов = Новый Массив;

			

			Для каждого ТипЭл из РеквизитАдресации.Тип.Типы() Цикл

				

				МассивТипов.Добавить(ТипЭл);

				

			КонецЦикла;

			

			Свойство.Тип = Новый ОписаниеТипов(МассивТипов);

			

			ВыгрузитьСвойство(Свойство, "Свойство", Родитель);	

			

		КонецЦикла;		

				

	Исключение

		

		Перейти ~КонецПроцедуры;

		

	КонецПопытки;

	

	// бизнес-процесс

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

	Свойство.Имя = "БизнесПроцесс";

	Свойство.Синоним = "БизнесПроцесс";

	Свойство.Комментарий = "БизнесПроцесс";

	

	МассивТиповБизнесПроцессов = Новый Массив;

	

	Для каждого БизнесПроцесс из Метаданные.БизнесПроцессы Цикл

		

		МассивТиповБизнесПроцессов.Добавить(Тип("БизнесПроцессСсылка." + БизнесПроцесс.Имя));

		

	КонецЦикла;

	

	Свойство.Тип = Новый ОписаниеТипов(МассивТиповБизнесПроцессов);

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	

	// выполнена

	Свойство.Имя = "Выполнена";

	Свойство.Синоним = "Выполнена";

	Свойство.Комментарий = "Выполнена";

	Свойство.Тип = Новый ОписаниеТипов("Булево");

	

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	// точка маршрута

	Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

		

	Свойство.Имя = "ТочкаМаршрута";

	Свойство.Синоним = "ТочкаМаршрута";

	Свойство.Комментарий = "ТочкаМаршрута";

	

	МассивТиповТочекБизнесПроцессов = Новый Массив;

	

	Для каждого БизнесПроцесс из Метаданные.БизнесПроцессы Цикл

		

		МассивТиповТочекБизнесПроцессов.Добавить(Тип("ТочкаМаршрутаБизнесПроцессаСсылка." + БизнесПроцесс.Имя));

		

	КонецЦикла;

	

	Свойство.Тип = Новый ОписаниеТипов(МассивТиповТочекБизнесПроцессов);

		

	ВыгрузитьСвойство(Свойство, "Свойство", Родитель);

	

	~КонецПроцедуры:

	

КонецПроцедуры // ВыгрузитьОсновныеСвойства()



Процедура ВыгрузитьСвойства(Объект, Родитель = "00000000-0000-0000-0000-000000000000")

	

	~Измерения:

	Попытка

		

		Свойства = Объект.Измерения;

		

	Исключение

		

		Перейти ~Ресурсы;

		

	КонецПопытки;

	

	Для каждого Свойство из Свойства Цикл

		

		ВыгрузитьСвойство(Свойство, "Измерение", Родитель);

		

	КонецЦикла;

	

	~Ресурсы:

	Попытка

		

		Свойства = Объект.Ресурсы;

		

	Исключение

		

		Перейти ~Реквизиты;

		

	КонецПопытки;

	

	Для каждого Свойство из Свойства Цикл

		

		ВыгрузитьСвойство(Свойство, "Ресурс", Родитель);

		

	КонецЦикла;

	

	~Реквизиты:

	

	Попытка

		

		Свойства = Объект.Реквизиты;

		

	Исключение

		

		Перейти ~КонецПроцедуры;

		

	КонецПопытки;

	

	Для каждого Свойство из Свойства Цикл

		

		ВыгрузитьСвойство(Свойство, "Реквизит", Родитель);

		

	КонецЦикла;

	

	~КонецПроцедуры:

	

	Если ЕстьОбщиеРеквизиты Тогда

		

		ОбщиеРеквизиты = ТаблицаОбщихРеквизитов.Найти(Объект.ПолноеИмя(),"Метаданные");

		

		Если ОбщиеРеквизиты <> Неопределено Тогда

			

			Для Каждого Свойство Из ОбщиеРеквизиты.МассивОбщихРеквизитов Цикл

				

				ВыгрузитьСвойство(Свойство, "Реквизит", Родитель);

				

			КонецЦикла;

			

		КонецЕсли;

		

	КонецЕсли;

	

КонецПроцедуры // ВыгрузитьСвойства()



Процедура ВыгрузитьСвойство(Свойство, ВидСвойства, Родитель = "00000000-0000-0000-0000-000000000000", ВременныйXML = Неопределено)

	

	XMLДляЗаписи = ?(ВременныйXML = Неопределено, мЗаписьXML, ВременныйXML);

	

	Попытка

		

		Балансовый = Свойство.Балансовый;

		

	Исключение

		

		Балансовый = Истина;

		

	КонецПопытки;

	

	Если НЕ Балансовый Тогда

		

		_Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип, Индексирование");

		

		_Свойство.Имя = Свойство.Имя + "Дт";

		_Свойство.Синоним = Свойство.Синоним;

		_Свойство.Комментарий = Свойство.Комментарий;

		_Свойство.Тип = Свойство.Тип;

		

		Попытка

			

			_Свойство.Индексирование = Свойство.Индексирование;

			

		Исключение

			

			_Свойство.Индексирование = Метаданные.СвойстваОбъектов.Индексирование.НеИндексировать;

			

		КонецПопытки;

		

		ВыгрузитьСвойство(_Свойство, ВидСвойства, Родитель, ВременныйXML);

		

		_Свойство.Имя = Свойство.Имя + "Кт";

		ВыгрузитьСвойство(_Свойство, ВидСвойства, Родитель, ВременныйXML);

		

		Возврат;

		

	КонецЕсли;

	

	мКоличествоСвойств = мКоличествоСвойств + 1;

	

	XMLДляЗаписи.ЗаписатьНачалоЭлемента("CatalogObject.Свойства");

	

		УИСвойства = Новый УникальныйИдентификатор();

		

		ЗаписатьXML(XMLДляЗаписи, УИСвойства, "Ref");

		ЗаписатьXML(XMLДляЗаписи, Ложь, "IsFolder");

		ЗаписатьXML(XMLДляЗаписи, Ложь, "DeletionMark");

		XMLДляЗаписи.ЗаписатьНачалоЭлемента("Owner");

			XMLДляЗаписи.ЗаписатьАтрибут("xsi:type", "CatalogRef.Объекты");

			XMLДляЗаписи.ЗаписатьТекст(Строка(мОбъектВладелец));

		XMLДляЗаписи.ЗаписатьКонецЭлемента(); // "Owner"

		ЗаписатьXML(XMLДляЗаписи, Родитель, "Parent");

		ЗаписатьXML(XMLДляЗаписи, Свойство.Синоним, "Синоним");

		ЗаписатьXML(XMLДляЗаписи, Свойство.Комментарий, "Комментарий");

		

		Попытка

			

			Использование = Строка(Свойство.Использование);

			

		Исключение

			

			Использование = "";

			

		КонецПопытки;

		

		ЗаписатьXML(XMLДляЗаписи, Использование, "Использование");

		

		Попытка

			

			Индексирование = (Свойство.Индексирование = мЗначенийСвойстваИндексирование 

				ИЛИ Свойство.Индексирование = мЗначенийСвойстваИндексированиеСДопУпорядочиванием);

			

		Исключение

			

			Индексирование = Ложь;

			

		КонецПопытки;

		

		ЗаписатьXML(XMLДляЗаписи, Индексирование, "Индексирование");

				

		ЗаписатьXML(XMLДляЗаписи, ВидСвойства, "Вид");

		ЗаписатьXML(XMLДляЗаписи, "", "ТипыСтрокой");

		

		ВыгрузитьТипы(Свойство, ВременныйXML);

	

	XMLДляЗаписи.ЗаписатьКонецЭлемента(); // "CatalogObject.Свойства"

		

КонецПроцедуры // ВыгрузитьСвойство()



Процедура ВыгрузитьТипы(Объект, ВременныйXML = Неопределено)

	

	XMLДляЗаписи = ?(ВременныйXML = Неопределено, мЗаписьXML, ВременныйXML);

	

	XMLДляЗаписи.ЗаписатьНачалоЭлемента("Типы");

	

		КоличествоТипов = Объект.Тип.Типы().Количество();

		Для каждого Тип из Объект.Тип.Типы() Цикл

		

			XMLДляЗаписи.ЗаписатьНачалоЭлемента("Row");

			

			Если КоличествоТипов = 1 Тогда

				

				Если мПоследнийТипДанных <> Тип Тогда

			

					мПоследнееЗначениеТипа = ПолучитьУИИмениТипа(ПолучитьТип(Тип));

					мПоследнийТипДанных = Тип;

				

				КонецЕсли;

				

			Иначе

				

				мПоследнееЗначениеТипа = ПолучитьУИИмениТипа(ПолучитьТип(Тип));

				мПоследнийТипДанных = Тип;

			

			КонецЕсли;

			

			ЗаписатьXML(XMLДляЗаписи, мПоследнееЗначениеТипа, "Тип");

				

			XMLДляЗаписи.ЗаписатьКонецЭлемента(); // "Row"

			

		КонецЦикла;

		

	XMLДляЗаписи.ЗаписатьКонецЭлемента(); // "Типы"

	

КонецПроцедуры // ВыгрузитьТипы()



Процедура ВыгрузитьТабличныеЧасти(Объект)

	

	Попытка

		

		ТабличныеЧасти = Объект.ТабличныеЧасти;

		

	Исключение

		

		Возврат;

		

	КонецПопытки;

	

	Для каждого ТабличнаяЧасть из ТабличныеЧасти Цикл

		

		мКоличествоСвойств = мКоличествоСвойств + 1;

		

		мЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Свойства");

		

			УИСвойства = Новый УникальныйИдентификатор();

			

			ЗаписатьXML(мЗаписьXML, УИСвойства, "Ref");

			ЗаписатьXML(мЗаписьXML, Истина, "IsFolder");

			ЗаписатьXML(мЗаписьXML, Ложь, "DeletionMark");

			мЗаписьXML.ЗаписатьНачалоЭлемента("Owner");

				мЗаписьXML.ЗаписатьАтрибут("xsi:type", "CatalogRef.Объекты");

				мЗаписьXML.ЗаписатьТекст(Строка(мОбъектВладелец));

			мЗаписьXML.ЗаписатьКонецЭлемента(); // "Owner"

			ЗаписатьXML(мЗаписьXML, "00000000-0000-0000-0000-000000000000", "Parent");

			//ЗаписатьXML(мЗаписьXML, 0, "Code");

			ЗаписатьXML(мЗаписьXML, ТабличнаяЧасть.Имя, "Description");

			ЗаписатьXML(мЗаписьXML, ТабличнаяЧасть.Синоним, "Синоним");

			//ЗаписатьXML(мЗаписьXML, ТабличнаяЧасть.Комментарий, "Комментарий");

			ЗаписатьXML(мЗаписьXML, "ТабличнаяЧасть", "Вид");

			ЗаписатьXML(мЗаписьXML, "", "ТипыСтрокой");

			ЗаписатьXML(мЗаписьXML, "", "Типы");

		

		мЗаписьXML.ЗаписатьКонецЭлемента(); // "CatalogObject.Свойства"

		

		Для каждого Свойство из ТабличнаяЧасть.Реквизиты Цикл

			

			ВыгрузитьСвойство(Свойство, "Реквизит", УИСвойства);

			

		КонецЦикла;

		

	КонецЦикла;

	

КонецПроцедуры // ВыгрузитьТабличныеЧасти()



Процедура ВыгрузитьПредопределенныеТабличныеЧастиПВР(Объект)

	

	ТабличныеЧасти = ПолучитьПредопределенныеТабличныеЧастиПВР(Объект);

		

	Для каждого ТабличнаяЧасть из ТабличныеЧасти Цикл

		

		мКоличествоСвойств = мКоличествоСвойств + 1;

		

		мЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Свойства");

		

			УИСвойства = Новый УникальныйИдентификатор();

			

			ЗаписатьXML(мЗаписьXML, УИСвойства, "Ref");

			ЗаписатьXML(мЗаписьXML, Истина, "IsFolder");

			ЗаписатьXML(мЗаписьXML, Ложь, "DeletionMark");

			мЗаписьXML.ЗаписатьНачалоЭлемента("Owner");

				мЗаписьXML.ЗаписатьАтрибут("xsi:type", "CatalogRef.Объекты");

				мЗаписьXML.ЗаписатьТекст(Строка(мОбъектВладелец));

			мЗаписьXML.ЗаписатьКонецЭлемента(); // "Owner"

			ЗаписатьXML(мЗаписьXML, "00000000-0000-0000-0000-000000000000", "Parent");

			ЗаписатьXML(мЗаписьXML, ТабличнаяЧасть.Синоним, "Синоним");

			ЗаписатьXML(мЗаписьXML, "ТабличнаяЧасть", "Вид");

			ЗаписатьXML(мЗаписьXML, "", "ТипыСтрокой");

			ЗаписатьXML(мЗаписьXML, "", "Типы");

		

		мЗаписьXML.ЗаписатьКонецЭлемента(); // "CatalogObject.Свойства"

		

		Для каждого Свойство из ТабличнаяЧасть.Реквизиты Цикл

			

			ВыгрузитьСвойство(Свойство, "Реквизит", УИСвойства);

			

		КонецЦикла;

		

	КонецЦикла;

	

КонецПроцедуры // ВыгрузитьТабличныеЧасти()



Процедура ВыгрузитьЗначенияПеречисления(Объект)

	

	Попытка

		

		Значения = Объект.ЗначенияПеречисления;

		

	Исключение

		

		Возврат;

		

	КонецПопытки;

	

	Для каждого Значение из Значения Цикл

		

		мКоличествоЗначений = мКоличествоЗначений + 1;

		

		мЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Значения");

		

			УИЗначения = Новый УникальныйИдентификатор();

			

			ЗаписатьXML(мЗаписьXML, УИЗначения, "Ref");

			ЗаписатьXML(мЗаписьXML, Ложь, "DeletionMark");

			мЗаписьXML.ЗаписатьНачалоЭлемента("Owner");

				мЗаписьXML.ЗаписатьАтрибут("xsi:type", "CatalogRef.Объекты");

				мЗаписьXML.ЗаписатьТекст(Строка(мОбъектВладелец));

			мЗаписьXML.ЗаписатьКонецЭлемента(); // "Owner"

			ЗаписатьXML(мЗаписьXML, "00000000-0000-0000-0000-000000000000", "Parent");

			ЗаписатьXML(мЗаписьXML, Значение.Синоним, "Синоним");

			ЗаписатьXML(мЗаписьXML, Значение.Комментарий, "Комментарий");

			ЗаписатьXML(мЗаписьXML, Истина, "Предопределенное");

			ЗаписатьXML(мЗаписьXML, "", "Типы");

		

		мЗаписьXML.ЗаписатьКонецЭлемента(); // "CatalogObject.Значения"

		

	КонецЦикла;

	

КонецПроцедуры // ВыгрузитьЗначенияПеречисления()



Процедура ВыгрузитьПредопределенныеЗначения(Объект, ИмяОбъекта)

	

	Попытка

		

		Предопределенные = Объект.Предопределенные;

		

	Исключение

		

		Возврат;

		

	КонецПопытки;

	

	Если Найти(Объект.ПолноеИмя(), "Справочник") = 1 тогда

		ЭтоСправочник = ИСТИНА;

	Иначе

		ЭтоСправочник = ЛОЖЬ;

	КонецЕсли;

	

	ТекстЗапроса = "

	|ВЫБРАТЬ

	|	_.Ссылка,";

	

	Если Объект.ДлинаКода > 0 Тогда

		

		ТекстЗапроса = ТекстЗапроса + "

		|	_.Код,";

		

	КонецЕсли;

	

	Если Объект.ДлинаНаименования > 0 Тогда

		

		ТекстЗапроса = ТекстЗапроса + "

		|	_.Наименование,";

		

	КонецЕсли;

	

	ТекстЗапроса = ТекстЗапроса + "

	|	_.Представление

	|ИЗ

	|	" + Объект.ПолноеИмя() + " КАК _

	|

	|ГДЕ

	|	(_.Предопределенный = ИСТИНА)";

	

	Запрос = Новый Запрос(ТекстЗапроса);

	

	РезультатЗапроса = Запрос.Выполнить();

	

	Выборка = РезультатЗапроса.Выбрать();

	

	Пока Выборка.Следующий() Цикл

		

		мКоличествоЗначений = мКоличествоЗначений + 1;

		

		мЗаписьXML.ЗаписатьНачалоЭлемента("CatalogObject.Значения");

		

			УИЗначения = Новый УникальныйИдентификатор();

			

			ЗаписатьXML(мЗаписьXML, УИЗначения, "Ref");

			ЗаписатьXML(мЗаписьXML, Ложь, "DeletionMark");

			мЗаписьXML.ЗаписатьНачалоЭлемента("Owner");

				мЗаписьXML.ЗаписатьАтрибут("xsi:type", "CatalogRef.Объекты");

				мЗаписьXML.ЗаписатьТекст(Строка(мОбъектВладелец));

			мЗаписьXML.ЗаписатьКонецЭлемента(); // "Owner"

			ЗаписатьXML(мЗаписьXML, "00000000-0000-0000-0000-000000000000", "Parent");

			//ЗаписатьXML(мЗаписьXML, 0, "Code");

			

			Если ИмяОбъекта = "Справочники" Тогда

				ИмяПредопределенного = Справочники[Объект.Имя].ПолучитьИмяПредопределенного(Выборка.Ссылка);

				//ЗаписатьXML(мЗаписьXML, ИмяПредопределенного, "Description");

			ИначеЕсли ИмяОбъекта = "ПланыВидовХарактеристик" Тогда

				ИмяПредопределенного = ПланыВидовХарактеристик[Объект.Имя].ПолучитьИмяПредопределенного(Выборка.Ссылка);

				//ЗаписатьXML(мЗаписьXML, ИмяПредопределенного, "Description");

			ИначеЕсли ИмяОбъекта = "ПланыСчетов" Тогда

				ИмяПредопределенного = ПланыСчетов[Объект.Имя].ПолучитьИмяПредопределенного(Выборка.Ссылка);

				//ЗаписатьXML(мЗаписьXML, ИмяПредопределенного, "Description");

			ИначеЕсли ИмяОбъекта = "ПланыВидовРасчета" Тогда

				ИмяПредопределенного = ПланыВидовРасчета[Объект.Имя].ПолучитьИмяПредопределенного(Выборка.Ссылка);

				//ЗаписатьXML(мЗаписьXML, ИмяПредопределенного, "Description");

			Иначе

				//ЗаписатьXML(мЗаписьXML, ?(Объект.ДлинаКода > 0, Выборка.Код, Выборка.Представление), "Description");

			КонецЕсли;

			ЗаписатьXML(мЗаписьXML, Выборка.Представление, "Синоним");

			ЗаписатьXML(мЗаписьXML, ?(Объект.ДлинаНаименования > 0, Выборка.Наименование, Выборка.Представление), "Комментарий");

			ЗаписатьXML(мЗаписьXML, Истина, "Предопределенное");

			ЗаписатьXML(мЗаписьXML, "", "Типы");

		

		мЗаписьXML.ЗаписатьКонецЭлемента(); // "CatalogObject.Значения"

		

	КонецЦикла;

	

КонецПроцедуры // ВыгрузитьПредопределенныеЗначения()

  

Процедура ЗаменитьСсылкуВСтроке(ЗначениеРезультата, ТегНачала, ТегКонца, НоваяСтрокаGUID)

	

	ПозицияНачала = Найти(ЗначениеРезультата, ТегНачала);

	ПозицияОкончания = Найти(ЗначениеРезультата, ТегКонца);

	

	ДлинаНачальногоТега =СтрДлина(ТегНачала);

		

	СтарыйУникальныйНомер = Сред(ЗначениеРезультата, ПозицияНачала + ДлинаНачальногоТега, ПозицияОкончания - ПозицияНачала - ДлинаНачальногоТега);

		

	ЗначениеРезультата = СтрЗаменить(ЗначениеРезультата, ТегНачала + СтарыйУникальныйНомер + ТегКонца, ТегНачала + НоваяСтрокаGUID + ТегКонца);	

	

КонецПроцедуры



Процедура ЗаменитьСсылкуУЗаписи(ЗначениеРезультата, НазваниеТега, НоваяСтрокаGUID = "")

	

	Если ПустаяСтрока(НоваяСтрокаGUID) Тогда

		НоваяСтрокаGUID = Строка(Новый УникальныйИдентификатор);

	КонецЕсли;

	

	ТегНачала = "<" + НазваниеТега + ">";

	ТегКонца = "</"+ НазваниеТега + ">";

	ЗаменитьСсылкуВСтроке(ЗначениеРезультата, ТегНачала, ТегКонца, НоваяСтрокаGUID);

		

КонецПроцедуры



Процедура ВыгрузитьРегистраторы(Объект, Родитель = "00000000-0000-0000-0000-000000000000")

	

	ЗначениеРезультата = мСоответствиеРегистровИРегистраторов.Получить(Объект);

	

	Если ЗначениеРезультата = Неопределено 

		И мСоответствиеРегистраторовЗаполнено = Ложь Тогда

				

		мСоответствиеРегистраторовЗаполнено = Истина;

		// инициализируем

		

		МассивТипов = Новый Массив;

		

		Для каждого Документ из Метаданные.Документы Цикл

			

			ТипДанныхДокумента = Тип(СтрЗаменить(Документ.ПолноеИмя(), ".", "Ссылка."));

			

			Для Каждого ОбъектДвижения Из Документ.Движения Цикл

				

				ТекущаяСтрока = мСоответствиеРегистровИРегистраторов.Получить(ОбъектДвижения);

				

				Если ТекущаяСтрока = Неопределено Тогда

					МассивТипов = Новый Массив;

				Иначе

				   МассивТипов = ТекущаяСтрока;

			   	КонецЕсли;

			   

				МассивТипов.Добавить(ТипДанныхДокумента);

				

				мСоответствиеРегистровИРегистраторов.Вставить(ОбъектДвижения, МассивТипов);

				

			КонецЦикла;

			

		КонецЦикла;

					

		

		Для Каждого ЭлементСтруктуры Из мСоответствиеРегистровИРегистраторов Цикл

			

			Значение = ЭлементСтруктуры.Значение;

			

			МассивТипов = Значение;	

			

			РезультирующаяСтрока = "";

			

			Если МассивТипов.Количество() > 0 Тогда

				

				Свойство = Новый Структура("Имя, Синоним, Комментарий, Тип");

				

				Свойство.Имя = "Регистратор";

				Свойство.Синоним = "Регистратор";

				Свойство.Комментарий = "Регистратор";

				Свойство.Тип = Новый ОписаниеТипов(МассивТипов);

				

				ВременныйXML = Новый ЗаписьXML();

				ВременныйXML.УстановитьСтроку();

				

				ВыгрузитьСвойство(Свойство, "Свойство", Родитель, ВременныйXML);

				

				РезультирующаяСтрока = ВременныйXML.Закрыть();

				

			КонецЕсли;

			

			мСоответствиеРегистровИРегистраторов.Вставить(ЭлементСтруктуры.Ключ, РезультирующаяСтрока);

			

		КонецЦикла;

		

		ЗначениеРезультата = мСоответствиеРегистровИРегистраторов.Получить(Объект);

		

	КонецЕсли;

	

	Если НЕ ПустаяСтрока(ЗначениеРезультата) Тогда

		

		ЗаменитьСсылкуУЗаписи(ЗначениеРезультата, "Ref");

		ЗаменитьСсылкуУЗаписи(ЗначениеРезультата, "Parent", Родитель);

		НовыйВладелец = Строка(мОбъектВладелец);

		

		ЗаменитьСсылкуВСтроке(ЗначениеРезультата, "<Owner xsi:type=""CatalogRef.Объекты"">", "</Owner>", НовыйВладелец);

		

		мЗаписьXML.ЗаписатьБезОбработки(ЗначениеРезультата);

				

	КонецЕсли;	

					

КонецПроцедуры // ВыгрузитьРегистраторы()



Процедура ИнициализацияИндикатора(ИмяОбъекта)

	

	Если СостояниеИндикатораПрогресса = Неопределено ИЛИ Индикатор = Неопределено Тогда

		

		Возврат;

		

	КонецЕсли;

	

	Если ИмяОбъекта = "ПланыОбмена" Тогда

		

		Заголовок = "Выгрузка объектов ""План обмена""";

		

	ИначеЕсли ИмяОбъекта = "Константы" Тогда

		

		Заголовок = "Выгрузка объектов ""Константа""";

		

	ИначеЕсли ИмяОбъекта = "Справочники" Тогда

		

		Заголовок = "Выгрузка объектов ""Справочник""";

		

	ИначеЕсли ИмяОбъекта = "Документы" Тогда

		

		Заголовок = "Выгрузка объектов ""Документ""";

		

	ИначеЕсли ИмяОбъекта = "Перечисления" Тогда

		

		Заголовок = "Выгрузка объектов ""Перечисление""";

		

	ИначеЕсли ИмяОбъекта = "ПланыВидовХарактеристик" Тогда

		

		Заголовок = "Выгрузка объектов ""План видов характеристик""";

		

	ИначеЕсли ИмяОбъекта = "ПланыСчетов" Тогда

		

		Заголовок = "Выгрузка объектов ""План счетов""";

		

	ИначеЕсли ИмяОбъекта = "ПланыВидовРасчета" Тогда

		

		Заголовок = "Выгрузка объектов ""План видов расчета""";

		

	ИначеЕсли ИмяОбъекта = "РегистрыСведений" Тогда

		

		Заголовок = "Выгрузка объектов ""Регистр сведений""";

		

	ИначеЕсли ИмяОбъекта = "РегистрыНакопления" Тогда

		

		Заголовок = "Выгрузка объектов ""Регистр накопления""";

		

	ИначеЕсли ИмяОбъекта = "РегистрыБухгалтерии" Тогда

		

		Заголовок = "Выгрузка объектов ""Регистр бухгалтерии""";

		

	ИначеЕсли ИмяОбъекта = "РегистрыРасчета" Тогда

		

		Заголовок = "Выгрузка объектов ""Регистр расчета""";

		

	ИначеЕсли ИмяОбъекта = "БизнесПроцессы" Тогда

		

		Заголовок = "Выгрузка объектов ""Бизнес-процесс""";

		

	ИначеЕсли ИмяОбъекта = "Задачи" Тогда

		

		Заголовок = "Выгрузка объектов ""Задача""";

		

	КонецЕсли;

	

	СостояниеИндикатораПрогресса.Заголовок = Заголовок;

	Индикатор.МаксимальноеЗначение = Метаданные[ИмяОбъекта].Количество();

	Индикатор.Значение = 0;

	

КонецПроцедуры // ИнициализацияИндикатора()



Процедура ИнкрементацияИндикатора()

	

	Если Индикатор = Неопределено Тогда

		

		Возврат;

		

	КонецЕсли;

	

	Индикатор.Значение = Индикатор.Значение + 1;

	

КонецПроцедуры // ИнкрементацияИндикатора()



Функция ПолучитьТип(Тип)

		

	Если Тип = мТипЧисло Тогда

		Возврат "Число";

    ИначеЕсли Тип = мТипБулево Тогда

		Возврат "Булево";

	ИначеЕсли Тип = мТипДата Тогда

		Возврат "Дата";	

	ИначеЕсли Тип = мТипСтрока Тогда

		Возврат "Строка";	

	ИначеЕсли Тип = мТипХранилищеЗначения Тогда

		Возврат "ХранилищеЗначения";

	ИначеЕсли Тип = мТипУникальныйИдентификатор Тогда

		Возврат "УникальныйИдентификатор";

    Иначе

	

		Результат = XMLТип(Тип).ИмяТипа;

						

		Результат = СтрЗаменить(Результат, "CatalogRef", "СправочникСсылка");

		Результат = СтрЗаменить(Результат, "DocumentRef", "ДокументСсылка");

		Результат = СтрЗаменить(Результат, "EnumRef", "ПеречислениеСсылка");

		Результат = СтрЗаменить(Результат, "ChartOfAccountsRef", "ПланСчетовСсылка");

		Результат = СтрЗаменить(Результат, "ChartOfCharacteristicTypesRef", "ПланВидовХарактеристикСсылка");

		Результат = СтрЗаменить(Результат, "ChartOfCalculationTypesRef", "ПланВидовРасчетаСсылка");

		Результат = СтрЗаменить(Результат, "ExchangePlanRef", "ПланОбменаСсылка");

		Результат = СтрЗаменить(Результат, "BusinessProcessRef", "БизнесПроцессСсылка");

		Результат = СтрЗаменить(Результат, "BusinessProcessRoutePointRef", "ТочкаМаршрутаБизнесПроцессаСсылка");

		Результат = СтрЗаменить(Результат, "TaskRef", "ЗадачаСсылка");

	

	КонецЕсли;

	

	Возврат Результат;

	

КонецФункции // ПолучитьТип()



Функция ПолучитьТипОбъектаМетаданных(Объект)

	

	Результат = Объект.ПолноеИмя();

	

	// Ссылочные типы

	Результат = СтрЗаменить(Результат, "Справочник.",             "СправочникСсылка.");

	Результат = СтрЗаменить(Результат, "Документ.",               "ДокументСсылка.");

	Результат = СтрЗаменить(Результат, "ПланСчетов.",             "ПланСчетовСсылка.");

	Результат = СтрЗаменить(Результат, "ПланВидовХарактеристик.", "ПланВидовХарактеристикСсылка.");

	Результат = СтрЗаменить(Результат, "ПланВидовРасчета.",       "ПланВидовРасчетаСсылка.");

	Результат = СтрЗаменить(Результат, "БизнесПроцесс.",          "БизнесПроцессСсылка.");

	Результат = СтрЗаменить(Результат, "Задача.",                 "ЗадачаСсылка.");

	

	// Регистры

	Результат = СтрЗаменить(Результат, "РегистрСведений.",    "РегистрСведенийЗапись.");

	Результат = СтрЗаменить(Результат, "РегистрНакопления.",  "РегистрНакопленияЗапись.");

	Результат = СтрЗаменить(Результат, "РегистрБухгалтерии.", "РегистрБухгалтерииЗапись.");

	Результат = СтрЗаменить(Результат, "РегистрРасчета.",     "РегистрРасчетаЗапись.");

	

	Возврат Результат;

	

КонецФункции // ПолучитьТипОбъектаМетаданных()



Функция ПолучитьУИИмениТипа(ИмяТипа)

	

	УИ = мСоответствиеИменТиповОбъектовУИ[ИмяТипа];

	

	Если УИ = Неопределено Тогда

		

		УИ = Новый УникальныйИдентификатор();

		мСоответствиеИменТиповОбъектовУИ.Вставить(ИмяТипа, УИ);

		

	КонецЕсли;

	

	Возврат УИ;

	

КонецФункции // ПолучитьУИИмениТипа()



Функция ПолучитьПредопределенныеТабличныеЧастиПВР(Объект)

	

	ТабличныеЧасти = Новый ТаблицаЗначений;

	ТабличныеЧасти.Колонки.Добавить("Имя");

	ТабличныеЧасти.Колонки.Добавить("Синоним");

	ТабличныеЧасти.Колонки.Добавить("Комментарий");

	ТабличныеЧасти.Колонки.Добавить("Реквизиты");

	

	// Таблица "БазовыеВидыРасчета"

	Если Объект.БазовыеВидыРасчета.Количество() > 0 Тогда

		

		МассивТиповВР = Новый Массив;

		

		//Типы определены в коллекции "БазовыеВидыРасчета"

		Для Каждого ОбъектМетаданныхПВР ИЗ Объект.БазовыеВидыРасчета Цикл

			

			МассивТиповВР.Добавить(Тип("ПланВидовРасчетаСсылка."+ОбъектМетаданныхПВР.Имя));

			

		КонецЦикла;

		

		ТабличнаяЧасть = ТабличныеЧасти.Добавить();

		ТабличнаяЧасть.Имя         = "БазовыеВидыРасчета";

		ТабличнаяЧасть.Синоним     = "Базовые виды расчета";

		ТабличнаяЧасть.Комментарий = "Предопределенный объект";

		ТабличнаяЧасть.Реквизиты   = ПолучитьРеквизитыПредопределеннойТабличнойЧастиПВР(МассивТиповВР);

		

	КонецЕсли;

	

	// Таблица "ВедущиеВидыРасчета"

	МассивТиповВР = Новый Массив;

	

	//Тип может быть любая ссылка ПВР

	Для Каждого ОбъектМетаданныхПВР ИЗ Метаданные["ПланыВидовРасчета"] Цикл

		

		МассивТиповВР.Добавить(Тип("ПланВидовРасчетаСсылка."+ОбъектМетаданныхПВР.Имя));

		

	КонецЦикла;

	

	ТабличнаяЧасть = ТабличныеЧасти.Добавить();

	ТабличнаяЧасть.Имя         = "ВедущиеВидыРасчета";

	ТабличнаяЧасть.Синоним     = "Ведущие виды расчета";

	ТабличнаяЧасть.Комментарий = "Предопределенный объект";

	ТабличнаяЧасть.Реквизиты   = ПолучитьРеквизитыПредопределеннойТабличнойЧастиПВР(МассивТиповВР);

	

	// Таблица "ВытесняющиеВидыРасчета"

	Если Объект.ИспользованиеПериодаДействия Тогда

		

		// Тип ВР - ссылка на ПВР-родитель, в котором заведен этот ВР

		МассивТиповВР = Новый Массив;

		МассивТиповВР.Добавить(Тип("ПланВидовРасчетаСсылка."+Объект.Имя));

		

		ТабличнаяЧасть = ТабличныеЧасти.Добавить();

		ТабличнаяЧасть.Имя         = "ВытесняющиеВидыРасчета";

		ТабличнаяЧасть.Синоним     = "Вытесняющие виды расчета";

		ТабличнаяЧасть.Комментарий = "Предопределенный объект";

		ТабличнаяЧасть.Реквизиты   = ПолучитьРеквизитыПредопределеннойТабличнойЧастиПВР(МассивТиповВР);

		

	КонецЕсли;

	

	Возврат ТабличныеЧасти;

КонецФункции



Функция ПолучитьРеквизитыПредопределеннойТабличнойЧастиПВР(МассивТиповВР)

	

	РеквизитыТабличнойЧасти = Новый ТаблицаЗначений;

	РеквизитыТабличнойЧасти.Колонки.Добавить("Имя");

	РеквизитыТабличнойЧасти.Колонки.Добавить("Синоним");

	РеквизитыТабличнойЧасти.Колонки.Добавить("Комментарий");

	РеквизитыТабличнойЧасти.Колонки.Добавить("Тип");

	

	Реквизит = РеквизитыТабличнойЧасти.Добавить();

	Реквизит.Имя         = "ВидРасчета";

	Реквизит.Синоним     = "Вид расчета";

	Реквизит.Комментарий = "";

	Реквизит.Тип         = Новый ОписаниеТипов(МассивТиповВР);

	

	Возврат РеквизитыТабличнойЧасти;

КонецФункции



Процедура ЗаполнитьТаблицуОбщихРеквизитов()

	

	ЕстьОбщиеРеквизиты = Ложь;

	

	Если Метаданные.ОбщиеРеквизиты.Количество() <> 0 Тогда

		

		Для Каждого ОбщийРеквизит Из Метаданные.ОбщиеРеквизиты Цикл

			

			Если ОбщийРеквизит.ИспользованиеРазделенияДанных = Неопределено Тогда

				

				Автоиспользование = (ОбщийРеквизит.Автоиспользование = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать);

				

				Если Не ЕстьОбщиеРеквизиты Тогда

					

					ИнициализироватьТаблицуОбщихРеквизитов();

					ЕстьОбщиеРеквизиты = Истина;

					

				КонецЕсли;

				

				Для Каждого Элемент Из ОбщийРеквизит.Состав Цикл

					

					Если Элемент.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать

						Или (Элемент.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Авто И Автоиспользование) Тогда

						

						НоваяСтрока = ТаблицаОбщихРеквизитов.Найти(Элемент.Метаданные.ПолноеИмя(), "Метаданные");

						

						Если НоваяСтрока = Неопределено Тогда

							

							НоваяСтрока = ТаблицаОбщихРеквизитов.Добавить();

							НоваяСтрока.Метаданные = Элемент.Метаданные.ПолноеИмя();

							НоваяСтрока.МассивОбщихРеквизитов = Новый Массив;

							

						КонецЕсли;

						

						НоваяСтрока.МассивОбщихРеквизитов.Добавить(ОбщийРеквизит);

						

					КонецЕсли;

					

				КонецЦикла;

				

			КонецЕсли;

			

		КонецЦикла;

		

	КонецЕсли;

	

КонецПроцедуры



Процедура ИнициализироватьТаблицуОбщихРеквизитов()

	

	ТаблицаОбщихРеквизитов = Новый ТаблицаЗначений;

	ТаблицаОбщихРеквизитов.Колонки.Добавить("Метаданные");

	ТаблицаОбщихРеквизитов.Колонки.Добавить("МассивОбщихРеквизитов");

	

	ТаблицаОбщихРеквизитов.Индексы.Добавить("Метаданные");

	

КонецПроцедуры



// Возвращает текущее значение версии обработки

//

// Параметры:

//  Нет.

// 

// Возвращаемое значение:

//  Текущее значение версии обработки

//

Функция ВерсияОбъекта() Экспорт

	Если Не ЗначениеЗаполнено(ВерсияВнешнейОбработки) Тогда

		ВерсияВнешнейОбработки = "3.1";

	КонецЕсли;

	

	Возврат ВерсияВнешнейОбработки;

	

КонецФункции



#Область СлужебныеПроцедурыИФункции



///////////////////////////////////////////////////////////////////////////

// ФУНКЦИИ РАБОТЫ С ВРЕМЕННЫМ ХРАНИЛИЩЕМ



// Параметры:

//   Объект - Произвольный - передаваемый объект обработки:

//     * Параметры - ТаблицаЗначений

//     * Запросы - ТаблицаЗначений

//   ИдентификаторТекущегоЗапроса - GUID текущего запроса.

//   ИдентификаторТекущегоПараметра - GUID текущего параметра.

//

// Возвращаемое значение:

//   Строка - адрес хранилища, где: 

//     * Параметры - ТаблицаЗначений

//     * Запросы - ТаблицаЗначений

//     * ИмяФайла - Строка

//     * ИдентификаторТекущегоЗапроса - Строка

//     * ИдентификаторТекущегоПараметра - Строка

//

Функция ПоместитьЗапросыВоВременноеХранилище(Объект, ИдентификаторТекущегоЗапроса, ИдентификаторТекущегоПараметра) Экспорт

	

	ПараметрыПередачи = Новый Структура;

	ПараметрыПередачи.Вставить("Запросы", Объект.Запросы.Выгрузить());

	ПараметрыПередачи.Вставить("Параметры", Объект.Параметры.Выгрузить());

	ПараметрыПередачи.Вставить("ИмяФайла", Объект.ИмяФайла);

	ПараметрыПередачи.Вставить("ИдентификаторТекущегоЗапроса", ИдентификаторТекущегоЗапроса);

	ПараметрыПередачи.Вставить("ИдентификаторТекущегоПараметра", ИдентификаторТекущегоПараметра);

	

	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыПередачи);

	Возврат АдресХранилища;

	

КонецФункции



// Помещает во внутренне хранилище настройки обработки.

// 

// Параметры:

//   Объект - передаваемый Объект обработки.

//

Функция ПоместитьНастройкиВоВременноеХранилище(Объект) Экспорт

	

	ПараметрыПередачи = Новый Структура;

	ПараметрыПередачи.Вставить("ИспользоватьАвтосохранение", Объект.ИспользоватьАвтосохранение);

	ПараметрыПередачи.Вставить("ПериодАвтосохранения", Объект.ПериодАвтосохранения);

	ПараметрыПередачи.Вставить("ВыводитьВРезультатахЗапросаЗначенияСсылок", Объект.ВыводитьВРезультатахЗапросаЗначенияСсылок);

	ПараметрыПередачи.Вставить("ЧередованиеЦветовВРезультатеЗапроса", Объект.ЧередованиеЦветовВРезультатеЗапроса);

	ПараметрыПередачи.Вставить("ТипОбхода", Объект.ТипОбхода);

	

	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыПередачи);

	Возврат АдресХранилища;

	

КонецФункции



///////////////////////////////////////////////////////////////////////////

// ФУНКЦИИ РАБОТЫ С XML-ФАЙЛАМИ



// Записывает Запросы(текст и параметры запроса) в файл XML.

//

// Параметры:

//  ИмяФайла - Строка - имя файла XML.

//  Объект - Произвольный - передаваемый объект обработки, где:

//   * Параметры - ТаблицаЗначений

//   * Запросы - ТаблицаЗначений:

//     ** Имя - Строка

//     ** Идентификатор - Число

//

Функция ЗаписатьЗапросыВФайлXML(знач Объект) Экспорт

	

	

	ФайлXML = Новый ЗаписьXML;

	ИмяФайла = ПолучитьИмяВременногоФайла("q1c");

	ФайлXML.ОткрытьФайл(ИмяФайла);

	ФайлXML.ЗаписатьОбъявлениеXML();

	ФайлXML.ЗаписатьНачалоЭлемента("querylist");

	// Цикл запросов.

	Для каждого ТекЗапрос Из Объект.Запросы Цикл

		ФайлXML.ЗаписатьНачалоЭлемента("query");

		ФайлXML.ЗаписатьАтрибут("name", ТекЗапрос.Имя);

			ФайлXML.ЗаписатьНачалоЭлемента("text");

			ТекстЗапроса = ТекЗапрос.Текст;

			

			Для Счетчик = 1 По СтрЧислоСтрок(ТекстЗапроса) Цикл

				ПереносСтр	= Символы.ВК + Символы.ПС;

				ТекСтрока 	= СтрПолучитьСтроку(ТекстЗапроса, Счетчик);

				ФайлXML.ЗаписатьТекст(ТекСтрока);

				ФайлXML.ЗаписатьБезОбработки(ПереносСтр);

			КонецЦикла;

			ФайлXML.ЗаписатьКонецЭлемента();

			ИдентификаторЗапроса = ТекЗапрос.Идентификатор;

			

			Если ЗначениеЗаполнено(ТекЗапрос.АдресХранилищаПланаЗапроса) Тогда

				СтруктураПланаЗапроса = ПолучитьИзВременногоХранилища(ТекЗапрос.АдресХранилищаПланаЗапроса);

				Если СтруктураПланаЗапроса <> Неопределено Тогда

					Если СтруктураПланаЗапроса.ПланЗапросаАктуален Тогда

						СКЛЗапрос = СтруктураПланаЗапроса.СКЛЗапрос;

						ПланВыполненияЗапроса = СтруктураПланаЗапроса.ПланВыполненияЗапроса;

						ТипСУБД = СтруктураПланаЗапроса.ТипСУБД;

					Иначе

						СКЛЗапрос = "";

						ПланВыполненияЗапроса = "";

						ТипСУБД = "";

					КонецЕсли;

				Иначе

					СКЛЗапрос = "";

					ПланВыполненияЗапроса = "";

					ТипСУБД = "";

				КонецЕсли;

			Иначе

				СКЛЗапрос = "";

				ПланВыполненияЗапроса = "";

				ТипСУБД = "";

			КонецЕсли;

			

			ФайлXML.ЗаписатьНачалоЭлемента("textSQL");

			Для Счетчик = 1 По СтрЧислоСтрок(СКЛЗапрос) Цикл

				ПереносСтр	= Символы.ВК + Символы.ПС;

				ТекСтрока 	= СтрПолучитьСтроку(СКЛЗапрос, Счетчик);

				ФайлXML.ЗаписатьТекст(ТекСтрока);

				ФайлXML.ЗаписатьБезОбработки(ПереносСтр);

			КонецЦикла;

			ФайлXML.ЗаписатьКонецЭлемента();

			

			ФайлXML.ЗаписатьНачалоЭлемента("planSQL");

			Для Счетчик = 1 По СтрЧислоСтрок(ПланВыполненияЗапроса) Цикл

				ПереносСтр	= Символы.ВК + Символы.ПС;

				ТекСтрока 	= СтрПолучитьСтроку(ПланВыполненияЗапроса, Счетчик);

				ФайлXML.ЗаписатьТекст(ТекСтрока);

				ФайлXML.ЗаписатьБезОбработки(ПереносСтр);

			КонецЦикла;

			ФайлXML.ЗаписатьКонецЭлемента();

			

			ФайлXML.ЗаписатьНачалоЭлемента("typeSQL");

			Для Счетчик = 1 По СтрЧислоСтрок(ТипСУБД) Цикл

				ПереносСтр	= Символы.ВК + Символы.ПС;

				ТекСтрока 	= СтрПолучитьСтроку(ТипСУБД, Счетчик);

				ФайлXML.ЗаписатьТекст(ТекСтрока);

				ФайлXML.ЗаписатьБезОбработки(ПереносСтр);

			КонецЦикла;

			ФайлXML.ЗаписатьКонецЭлемента();

			

			// Запись параметров в XML-файл.

			Если Объект.Параметры.Количество() > 0 Тогда

				ФайлXML.ЗаписатьНачалоЭлемента("parameters");

				Для каждого ТекПараметр Из Объект.Параметры Цикл

					Если ТекПараметр.ИдентификаторЗапроса = ИдентификаторЗапроса Тогда

						ИмяПараметра		= ТекПараметр.Имя;

						ТипПараметра		= ТекПараметр.Тип;

						Значение			= ТекПараметр.Значение;

						Если ПустаяСтрока(Значение) Тогда

							ЗначениеПараметра = "";

						Иначе

							ЗначениеПараметра = ЗначениеИзСтрокиВнутр(ТекПараметр.Значение);

						КонецЕсли;

						

						ФайлXML.ЗаписатьНачалоЭлемента("parameter");

						ФайлXML.ЗаписатьАтрибут("name", ИмяПараметра);

						Если ТипПараметра = "СписокЗначений" Тогда 

							ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);

							ЗаписатьСписокЗначенийВXML(ФайлXML, ЗначениеПараметра);

						ИначеЕсли ТипПараметра = "ТаблицаЗначений" Тогда

							ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);

							

							Колонки = ЗначениеПараметра.Колонки.Количество();

							Строки = ЗначениеПараметра.Количество();

							

							ФайлXML.ЗаписатьАтрибут("colcount", XMLСтрока(Колонки));

							ФайлXML.ЗаписатьАтрибут("rowcount", XMLСтрока(Строки));

							

							ЗаписатьТаблицуЗначенийВXML(ФайлXML, ЗначениеПараметра);

						ИначеЕсли ТипПараметра = "МоментВремени" Тогда

							ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);

							ЗаписатьМоментВремениВXML(ФайлXML, ЗначениеПараметра);

						ИначеЕсли ТипПараметра = "Граница" Тогда

							ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);

							ЗаписатьГраницуВXML(ФайлXML, ЗначениеПараметра);

						Иначе

							ИмяТипа = ИмяТипаИзЗначения(ЗначениеПараметра);

							ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);

							ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(ЗначениеПараметра));

						КонецЕсли;

						ФайлXML.ЗаписатьКонецЭлемента();

					КонецЕсли;

				КонецЦикла;

				ФайлXML.ЗаписатьКонецЭлемента();

			КонецЕсли;

			

		ФайлXML.ЗаписатьКонецЭлемента();

	КонецЦикла;

	ФайлXML.ЗаписатьКонецЭлемента();

	ФайлXML.Закрыть();

	

	ВозвращаемоеЗначение = Новый ДвоичныеДанные(ИмяФайла);

	

	УдалитьФайлы(ИмяФайла);

	

	Возврат ВозвращаемоеЗначение;

	

КонецФункции



// Записывает строки списка значений в Файл XML.

//

// Параметры:

//  ФайлXML - ЗаписьXML

//  Значение - СписокЗначений

//

Процедура ЗаписатьСписокЗначенийВXML(ФайлXML, Значение)

	

	Если ТипЗнч(Значение) <> Тип("СписокЗначений") Тогда

		Возврат;

	КонецЕсли;

	

	Для каждого СтрСписка Из Значение Цикл

		ЗначениеЭлементаСписка	= СтрСписка.Значение;

		// Определение имени типа.

		ИмяТипа = ИмяТипаИзЗначения(ЗначениеЭлементаСписка); 

		

		ФайлXML.ЗаписатьНачалоЭлемента("item");

			ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);

			ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(ЗначениеЭлементаСписка));

		ФайлXML.ЗаписатьКонецЭлемента();

	КонецЦикла;

	

КонецПроцедуры



// Параметры:

//   ФайлXML - ЗаписьXML

//   Значение - ТаблицаЗначений

//

Процедура ЗаписатьТаблицуЗначенийВXML(ФайлXML, Значение)

	

	Если ТипЗнч(Значение) <> Тип("ТаблицаЗначений") Тогда

		Возврат;

	КонецЕсли;

	

	КолКолонок 	= Значение.Колонки.Количество();

	КолСтрок	= Значение.Количество();

	

	Для СтрокаИндекс = 0 По КолСтрок - 1 Цикл

		Для КолонкаИндекс = 0 По КолКолонок - 1 Цикл

			ЗначениеЭлементаСписка	= Значение.Получить(СтрокаИндекс).Получить(КолонкаИндекс);

			ИмяКолонки = Значение.Колонки.Получить(КолонкаИндекс).Имя;

			// Определение имени типа.

			ИмяТипа = ИмяТипаИзЗначения(ЗначениеЭлементаСписка);

			Если ИмяТипа = "Строка" Тогда 

				Длина = Значение.Колонки.Получить(КолонкаИндекс).ТипЗначения.КвалификаторыСтроки.Длина;

			Иначе 

				Длина = 0;

			КонецЕсли;

			

			ФайлXML.ЗаписатьНачалоЭлемента("item");

			ФайлXML.ЗаписатьАтрибут("nameCol", ИмяКолонки);

			ФайлXML.ЗаписатьАтрибут("row", XMLСтрока(СтрокаИндекс));

			ФайлXML.ЗаписатьАтрибут("col", XMLСтрока(КолонкаИндекс));

			ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);

			ФайлXML.ЗаписатьАтрибут("length", XMLСтрока(Длина));

			ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(ЗначениеЭлементаСписка));

			ФайлXML.ЗаписатьКонецЭлемента();

		КонецЦикла;

	КонецЦикла;

	

КонецПроцедуры



// Записывает момент времени в Файл XML.

//

// Параметры:

//  ФайлXML - ЗаписьXML

//  Значение - момент времени.

//

Процедура ЗаписатьМоментВремениВXML(ФайлXML, Значение)

	

	Если ТипЗнч(Значение) <> Тип("МоментВремени") Тогда

		Возврат;

	КонецЕсли;

	

	// Определение имени типа.

	ИмяТипа = ИмяТипаИзЗначения(Значение.Ссылка);

	

	ФайлXML.ЗаписатьНачалоЭлемента("item");

		Если Значение.Ссылка <> Неопределено Тогда 

			ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);

			ФайлXML.ЗаписатьАтрибут("valueRef", XMLСтрока(Значение.Ссылка));

		КонецЕсли;

		ФайлXML.ЗаписатьАтрибут("valueDate", XMLСтрока(Значение.Дата));

	ФайлXML.ЗаписатьКонецЭлемента();

	

КонецПроцедуры



// Записывает границу.

//

Процедура ЗаписатьГраницуВXML(ФайлXML, Граница)

	

	Если ТипЗнч(Граница) <> Тип("Граница") Тогда

		Возврат;

	КонецЕсли;

	

	ФайлXML.ЗаписатьНачалоЭлемента("divide");

		// Определение имени типа.

		ИмяТипа 			= ИмяТипаИзЗначения(Граница.Значение); 

		ТипЗначенияГраницы 	= ТипЗнч(Граница.Значение);

		

		// Запись в строку вида границы.

		ИмяВидаГраницы = Строка(Граница.ВидГраницы);

		

		ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);

		ФайлXML.ЗаписатьАтрибут("valueDiv", ИмяВидаГраницы);

		

		Если ТипЗначенияГраницы <> Тип("МоментВремени") Тогда

			ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(Граница.Значение));

		Иначе

			ЗаписатьМоментВремениВXML(ФайлXML, Граница.Значение);

		КонецЕсли;

	ФайлXML.ЗаписатьКонецЭлемента();

	

КонецПроцедуры



// Параметры:

//   ДвоичныеДанные - ДвоичныеДанные

// Возвращаемое значение:

//   ОбработкаОбъект.КонсольЗапросов

//

Функция ПрочитатьЗапросыИзФайлаXML(ДвоичныеДанные) Экспорт

	

	ИмяФайла = ПолучитьИмяВременногоФайла("q1c");

	ДвоичныеДанные.Записать(ИмяФайла);

	ФайлXML = Новый ЧтениеXML;

	ФайлXML.ОткрытьФайл(ИмяФайла);

	ФайлXML.Прочитать();

	// Чтение всех запросов.

	Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ФайлXML.Имя = "querylist" Тогда

		Пока ФайлXML.Прочитать() Цикл 

			// Чтение запроса.

			Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ФайлXML.Имя = "query" Тогда

				Пока ФайлXML.ПрочитатьАтрибут() Цикл 

					Если ФайлXML.Имя = "name" Тогда

						// Добавление запроса в таблицу.

						текЭлементЗапроса 				= Запросы.Добавить();

						текЭлементЗапроса.Идентификатор	= Новый УникальныйИдентификатор;

						текЭлементЗапроса.Имя 			= ФайлXML.Значение;

					КонецЕсли;

				КонецЦикла;

				

				СтруктураПланаЗапроса = Новый Структура;

				СтруктураПланаЗапроса.Вставить("СКЛЗапрос","");

				СтруктураПланаЗапроса.Вставить("ПланВыполненияЗапроса","");

				СтруктураПланаЗапроса.Вставить("ТипСУБД","");

				СтруктураПланаЗапроса.Вставить("ПланЗапросаАктуален",Истина);

				

				Пока ФайлXML.Прочитать() Цикл 

					Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ФайлXML.Имя = "text" Тогда

						ФайлXML.Прочитать();

						текЭлементЗапроса.Текст = ФайлXML.Значение;

					// Чтение параметров.

					КонецЕсли;

					Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ФайлXML.Имя = "parameters" Тогда

						Пока ФайлXML.Прочитать() Цикл

							// Чтение отдельного параметра.

							Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ФайлXML.Имя = "parameter" Тогда

								Пока ФайлXML.ПрочитатьАтрибут() Цикл 

									// Чтение имени атрибута.									

									Если ФайлXML.Имя = "name" Тогда

										текПараметрЗапроса 						= Параметры.Добавить();

										текПараметрЗапроса.Идентификатор  		= Новый УникальныйИдентификатор;

										текПараметрЗапроса.Имя					= ФайлXML.Значение;

										текПараметрЗапроса.ИдентификаторЗапроса	= текЭлементЗапроса.Идентификатор;

									КонецЕсли;

									

									// Чтение типа параметра.

									Если ФайлXML.Имя = "type" Тогда

										ТипЭлемента 			= Тип(ФайлXML.Значение);

										текПараметрЗапроса.Тип	= Строка(ФайлXML.Значение);

									КонецЕсли;

									

									// Чтение значения параметра.

									Если ФайлXML.Имя = "value" Тогда

										Значение					= XMLЗначение(ТипЭлемента, ФайлXML.Значение);

										текПараметрЗапроса.Значение = ЗначениеВСтрокуВнутр(Значение);

									КонецЕсли;

									

									// Чтение количества колонок Таблицы Значений.

									Если ФайлXML.Имя = "colcount" Тогда

										КоличествоКолонок 	= Число(ФайлXML.Значение);

									КонецЕсли;

									

									// Чтение количества строк Таблицы Значений.

									Если ФайлXML.Имя = "rowcount" Тогда

										КоличествоСтрок 	= Число(ФайлXML.Значение);

									КонецЕсли;

								КонецЦикла;

								

								// Чтение отдельных типов.

								// Для отдельных типов предусмотрено индивидуальное чтение параметров.

								// Под отдельными типами понимаются: Список значений, Таблица значений, 

								// Момент Времени, Граница.

								//

								// Список отдельных типов может увеличиваться.

								Если текПараметрЗапроса.Тип = "СписокЗначений" Тогда

									ПрочитатьСписокЗначенийИзXML(ФайлXML, текПараметрЗапроса);

								КонецЕсли; 

								Если текПараметрЗапроса.Тип = "ТаблицаЗначений" Тогда

									ПрочитатьТаблицуЗначенийИзXML(ФайлXML, текПараметрЗапроса, КоличествоСтрок, КоличествоКолонок);

								КонецЕсли;

								Если текПараметрЗапроса.Тип = "МоментВремени" Тогда

									ПрочитатьМоментВремениИзXML(ФайлXML, текПараметрЗапроса);

								КонецЕсли;

								Если текПараметрЗапроса.Тип = "Граница" Тогда

									ПрочитатьГраницуИзXML(ФайлXML, текПараметрЗапроса);

								КонецЕсли;

							КонецЕсли;

							Если ПроверкаКонцаТэгов(ФайлXML) Тогда

								Прервать;

							КонецЕсли;

						КонецЦикла;

					КонецЕсли;

					

					Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ФайлXML.Имя = "textSQL" Тогда

						ФайлXML.Прочитать();

						СтруктураПланаЗапроса.СКЛЗапрос = СокрЛП(ФайлXML.Значение);

					КонецЕсли;

					

					Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ФайлXML.Имя = "planSQL" Тогда

						ФайлXML.Прочитать();

						СтруктураПланаЗапроса.ПланВыполненияЗапроса = СокрЛП(ФайлXML.Значение);

					КонецЕсли;

					

					Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ФайлXML.Имя = "typeSQL" Тогда

						ФайлXML.Прочитать();

						СтруктураПланаЗапроса.ТипСУБД = СокрЛП(ФайлXML.Значение);

					КонецЕсли;

					

					Если ПроверкаКонцаТэгов(ФайлXML) Тогда

						Прервать;

					КонецЕсли;

				КонецЦикла; // Обход по тэгам "query".

			КонецЕсли; // Если "query".

			Если ФайлXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ФайлXML.Имя = "query" Тогда

				Если СтруктураПланаЗапроса.СКЛЗапрос <> "" И СтруктураПланаЗапроса.ПланВыполненияЗапроса <> "" И СтруктураПланаЗапроса.ТипСУБД <> "" Тогда

					текЭлементЗапроса.АдресХранилищаПланаЗапроса = ПоместитьВоВременноеХранилище(СтруктураПланаЗапроса, Новый УникальныйИдентификатор());

				Иначе

					текЭлементЗапроса.АдресХранилищаПланаЗапроса = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());

				КонецЕсли;

			КонецЕсли;

		КонецЦикла;// Обход по запросам.

	КонецЕсли;// Если "querylist".

	ФайлXML.Закрыть();

	УдалитьФайлы(ИмяФайла);

	Возврат ЭтотОбъект;

	

КонецФункции



// Читает Список значений.

//

// Параметры:

//  ФайлXML - чтение XML.

//  ПараметрЗапроса - текущий параметр.

//

Процедура ПрочитатьСписокЗначенийИзXML(ФайлXML, ПараметрЗапроса)

	

	СписокЗН = Новый СписокЗначений;

	Пока ФайлXML.Прочитать() Цикл

		Если ФайлXML.Имя = "item" И ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

			Пока ФайлXML.ПрочитатьАтрибут() Цикл

				Если ФайлXML.Имя = "type" Тогда

					ТипЭлемента = Тип(ФайлXML.Значение);

				КонецЕсли;

				Если ФайлXML.Имя = "value" Тогда

					// Чтение значения.

					Значение				= XMLЗначение(ТипЭлемента, ФайлXML.Значение);

					ЗначениеЭлементаСписка 	= Значение;

				КонецЕсли;	

			КонецЦикла;	

			СписокЗН.Добавить(ЗначениеЭлементаСписка);

		ИначеЕсли ФайлXML.Имя <> "item" Тогда

			Прервать;

		КонецЕсли;

	КонецЦикла;

	

	ПараметрЗапроса.Значение = ЗначениеВСтрокуВнутр(СписокЗН);

	

КонецПроцедуры



// Параметры:

//   ФайлXML - ЧтениеXML

//   ПараметрЗапроса - ТаблицаЗначений

//   КоличествоСтрок - Число

//   КоличествоКолонок - Число

//

Процедура ПрочитатьТаблицуЗначенийИзXML(ФайлXML, ПараметрЗапроса, КоличествоСтрок, КоличествоКолонок)

	

	ТаблицаЗначений = Новый ТаблицаЗначений;

	МассивКолонок = Новый Массив;

	

	Пока ФайлXML.Прочитать() Цикл 

		Если ФайлXML.Имя = "item" И ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

			Пока ФайлXML.ПрочитатьАтрибут() Цикл

				Если ФайлXML.Имя = "col" Тогда

					ИндексКолонки 	= Число(ФайлXML.Значение);

				КонецЕсли;

				Если ФайлXML.Имя = "row" Тогда

					ИндексСтроки 	= Число(ФайлXML.Значение);

				КонецЕсли;

				Если ФайлXML.Имя = "type" Тогда

					ТипЭлемента = Тип(ФайлXML.Значение);

					МассивТипов = Новый Массив;

					МассивТипов.Добавить(ТипЭлемента);

				КонецЕсли;

				Если ФайлXML.Имя = "nameCol" Тогда

					ИмяКолонки	 = ФайлXML.Значение;

				КонецЕсли;

				Если ФайлXML.Имя = "length" Тогда

					Длина		 = ФайлXML.Значение;

				КонецЕсли;

				Если ФайлXML.Имя = "value" Тогда

					Значение		= XMLЗначение(ТипЭлемента, ФайлXML.Значение);

					ЗначениеЯчейки 	= Значение;

				КонецЕсли;

			КонецЦикла;

			

			ПараметрыСтроки = Новый КвалификаторыСтроки(Длина);

			Если МассивКолонок.Количество() - 1 < ИндексКолонки Тогда

				ОписаниеТипов = Новый ОписаниеТипов();

				ОписаниеТипов = Новый ОписаниеТипов(ОписаниеТипов, МассивТипов,,, ПараметрыСтроки);

				

				СписокЗначенийЯчеекКолонки  = Новый СписокЗначений;

				СписокЗначенийЯчеекКолонки.Вставить(ИндексСтроки,ЗначениеЯчейки);

				

				СтруктураКолонки = КолонкиВXMLФайле(ИмяКолонки, ОписаниеТипов, СписокЗначенийЯчеекКолонки);

				МассивКолонок.Вставить(ИндексКолонки, СтруктураКолонки);

				

			Иначе

				ОписаниеТипов = МассивКолонок.Получить(ИндексКолонки).ОписаниеТипов;

				ОписаниеТипов = Новый ОписаниеТипов(ОписаниеТипов, МассивТипов,,, ПараметрыСтроки);

				СписокЗначенийЯчеекКолонки  = МассивКолонок.Получить(ИндексКолонки).СписокЗначенийЯчеекКолонки;

				СписокЗначенийЯчеекКолонки.Вставить(ИндексСтроки,ЗначениеЯчейки);

				

				МассивКолонок.Удалить(ИндексКолонки);

				СтруктураКолонки = КолонкиВXMLФайле(ИмяКолонки, ОписаниеТипов, СписокЗначенийЯчеекКолонки);

				

				МассивКолонок.Вставить(ИндексКолонки, СтруктураКолонки);

			КонецЕсли;	

		ИначеЕсли ФайлXML.Имя <> "item" Тогда

			Прервать;

		КонецЕсли;

	КонецЦикла;

	

	КолКолонок = МассивКолонок.Количество();

	Для ИндексКолонок = 0 По КолКолонок - 1 Цикл

		ОписаниеКолонок =  МассивКолонок.Получить(ИндексКолонок); // см. КолонкиВXMLФайле

		ИмяКолонки 		= ОписаниеКолонок.Имя;

		ТипКолонки 		= МассивКолонок.Получить(ИндексКолонок).ОписаниеТипов;

		ТаблицаЗначений.Колонки.Вставить(ИндексКолонок, ИмяКолонки, ТипКолонки, ИмяКолонки);

		

		СписокЗначений 	= МассивКолонок.Получить(ИндексКолонок).СписокЗначенийЯчеекКолонки;

		КолСтрок = СписокЗначений.Количество();

		Для ИндексСтрок = 0 По КолСтрок - 1 Цикл

			ЗначениеЯчейки = СписокЗначений.Получить(ИндексСтрок).Значение;

			Если ИндексСтрок <= ТаблицаЗначений.Количество() - 1 Тогда 

				ТаблицаЗначений.Получить(ИндексСтрок).Установить(ИндексКолонок, ЗначениеЯчейки);

			Иначе

				ТаблицаЗначений.Вставить(ИндексСтрок).Установить(ИндексКолонок, ЗначениеЯчейки);

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	

	ПараметрЗапроса.Значение = ЗначениеВСтрокуВнутр(ТаблицаЗначений);

	

КонецПроцедуры



// Параметры:

//  ИмяКолонки - Строка

//  ОписаниеТипов - Структура:

//    * СписокЗначенийЯчеекКолонки - СписокЗначений

//    * ОписаниеТипов - ОписаниеТипов

//  СписокЗначенийЯчеекКолонки - ОписаниеТипов

// Возвращаемое значение:

//  Структура:

//   * Имя - Строка

//   * ОписаниеТипов - ОписаниеТипов

//   * СписокЗначенийЯчеекКолонки - СписокЗначений

// 

Функция КолонкиВXMLФайле(Знач ИмяКолонки, Знач ОписаниеТипов, Знач СписокЗначенийЯчеекКолонки)

	

	СтруктураКолонки = Новый Структура;

	СтруктураКолонки.Вставить("Имя", ИмяКолонки);

	СтруктураКолонки.Вставить("ОписаниеТипов", ОписаниеТипов);

	СтруктураКолонки.Вставить("СписокЗначенийЯчеекКолонки", СписокЗначенийЯчеекКолонки);

	

	Возврат СтруктураКолонки;

	

КонецФункции





// Читает Момент времени.

//

// Параметры:

//   ФайлXML - чтение XML.

//   ПараметрЗапроса - текущий параметр.

//

Процедура ПрочитатьМоментВремениИзXML(ФайлXML, ПараметрЗапроса)

	

	Пока ФайлXML.Прочитать() Цикл 

		Если ФайлXML.Имя = "item" И ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 

			Пока ФайлXML.ПрочитатьАтрибут() Цикл

				Если ФайлXML.Имя = "type" Тогда

					ТипЭлемента = Тип(ФайлXML.Значение);

				КонецЕсли;

				Если ФайлXML.Имя = "valueRef" Тогда

					ЗначениеСсылки	= XMLЗначение(ТипЭлемента, ФайлXML.Значение);

				КонецЕсли;

				Если ФайлXML.Имя = "valueDate" Тогда

					ЗначениеДаты	= XMLЗначение(Тип("Дата"), ФайлXML.Значение);

				КонецЕсли;

			КонецЦикла;

			МВ = Новый МоментВремени(ЗначениеДаты, ЗначениеСсылки);

		ИначеЕсли ФайлXML.Имя <> "item" Тогда

			Прервать;

		КонецЕсли;

	КонецЦикла;

	

	ПараметрЗапроса.Значение	= ЗначениеВСтрокуВнутр(МВ);

	

КонецПроцедуры



// Читает Границу.

//

// Параметры:

//  ФайлXML - чтение XML.

//  ПараметрЗапроса - текущий параметр.

//

Процедура ПрочитатьГраницуИзXML(ФайлXML, ПараметрЗапроса)

	

	Пока ФайлXML.Прочитать() Цикл

		Если ФайлXML.Имя = "divide" И ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

			Пока ФайлXML.ПрочитатьАтрибут() Цикл

				Если ФайлXML.Имя = "type" Тогда

					ТипЭлемента = Тип(ФайлXML.Значение);

				КонецЕсли;

				Если ФайлXML.Имя = "value" Тогда

					Значение	= XMLЗначение(ТипЭлемента, ФайлXML.Значение);

				КонецЕсли;

				Если ФайлXML.Имя = "valueDiv" Тогда

					Вид	= XMLЗначение(Тип("Строка"), ФайлXML.Значение);

					Вид	= ОпределениеВидаГраницы(Вид);

				КонецЕсли;

			КонецЦикла;	

			Если ТипЭлемента = Тип("МоментВремени") Тогда

				ПрочитатьМоментВремениИзXML(ФайлXML, ПараметрЗапроса);

				Значение = ЗначениеИзСтрокиВнутр(ПараметрЗапроса.Значение);

			КонецЕсли;

			

			Граница = Новый Граница(Значение, Вид);

		ИначеЕсли ФайлXML.Имя <> "divide" Тогда 

			Прервать;

		КонецЕсли;

	КонецЦикла;

	

	ПараметрЗапроса.Значение = ЗначениеВСтрокуВнутр(Граница);

	

КонецПроцедуры



// Определяет условие конца тэга "query" или "parameters".

//

// Параметры:

//  ФайлXML - ЧтениеXML

//

Функция ПроверкаКонцаТэгов(ФайлXML)

	

	Если (ФайлXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ФайлXML.Имя = "query")

		Или (ФайлXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ФайлXML.Имя = "parameters") Тогда

		Возврат Истина;

	Иначе

		Возврат Ложь;

	КонецЕсли;

	

КонецФункции



///////////////////////////////////////////////////////////////////////////

// ФУНКЦИИ РАБОТЫ С ЗАПРОСОМ



// Считывает параметры из текста запроса.

//

// Параметры:

//  ТекстЗапроса - Строка

//  ИдентификаторЗапроса - Строка - уникальный идентификатор запроса.

//

// Возвращаемое значение:

//  Массив из см. ДобавлениеНовогоПараметра

//

Функция СчитатьПараметрыЗапроса(ТекстЗапроса, ИдентификаторЗапроса) Экспорт

	

	МассивСтруктуры = Новый Массив;

	

	Запрос = Новый Запрос;

	Запрос.Текст = ТекстЗапроса;

	

	// Заполняем параметрами таблицу параметров.

	ПарЗап = Запрос.НайтиПараметры();

	

	Для каждого СтрПараметры Из ПарЗап Цикл

		РезультатСтруктура = ДобавлениеНовогоПараметра(СтрПараметры, ИдентификаторЗапроса);

		МассивСтруктуры.Добавить(РезультатСтруктура);

	КонецЦикла;

	

	Возврат МассивСтруктуры;

	

КонецФункции



// Добавляет новый параметр в структуру параметров.

//

// Параметры:

//  ТекущийПрочитанныйПараметр - ОписаниеПараметраЗапроса - текущий параметр, прочитанный из текста запроса.

//  ИдентификаторЗапроса - Строка - GUID запроса

//

// Возвращаемое значение:

//  Структура:

//   * ИдентификаторЗапроса - Строка

//   * Имя - Строка

//   * Тип - Строка

//   * Значение - Строка

//

Функция ДобавлениеНовогоПараметра(ТекущийПрочитанныйПараметр, ИдентификаторЗапроса)

	

	ЭлементПараметр = Новый Структура("ИдентификаторЗапроса, Имя, Тип, Значение",

		ИдентификаторЗапроса, ТекущийПрочитанныйПараметр.Имя);

	

	// Смотрим на первый тип из списка, если есть.

	ДоступныеТипы = ТекущийПрочитанныйПараметр.ТипЗначения.Типы();

	Если ДоступныеТипы.Количество()=0 Тогда

		// Считаем строкой

		ЭлементПараметр.Тип = "Строка";

		ЭлементПараметр.Значение = ЗначениеВСтрокуВнутр("");

		Возврат ЭлементПараметр;

	КонецЕсли;

	

	// Формируем описание типа из первого доступного типа.

	Массив = Новый Массив;

	Массив.Добавить( ДоступныеТипы.Получить(0) );

	НовоеОписаниеТипов = Новый ОписаниеТипов(Массив);

	

	Значение = НовоеОписаниеТипов.ПривестиЗначение(Неопределено);

	

	СписокДобавленныхТипов = Новый СписокЗначений;

	СформироватьСписокТипов(СписокДобавленныхТипов);

	

	Флаг = Ложь;

	СтроковоеПредставлениеТипа = Строка(ТипЗнч(Значение));

	Для каждого ЭлементСписка Из СписокДобавленныхТипов Цикл

		Если ЭлементСписка.Представление = СтроковоеПредставлениеТипа Тогда

			Флаг = Истина;

			Прервать;

		КонецЕсли;

	КонецЦикла;

	

	ЭлементПараметр.Тип = ?(Флаг, СтроковоеПредставлениеТипа, XMLТип(ТипЗнч(Значение)).ИмяТипа);

	ЭлементПараметр.Значение = ЗначениеВСтрокуВнутр(Значение);

	

	Возврат ЭлементПараметр;

	

КонецФункции



// Загружает параметры в запрос.

// Если строковое представление значения - пустая строка, тогда значение параметра является Неопределено.

//

// Параметры:

//  Запрос - передаваемый запрос.

//  ПараметрыЗапроса - передаваемые параметры для запроса.

//

Процедура ЗагрузкаПараметровВЗапрос(Запрос, ПараметрыЗапроса)

	

	Для каждого ЭлементПараметр Из ПараметрыЗапроса Цикл

		СтрокаЗначение = ЭлементПараметр.Значение;

		Если ПустаяСтрока(СтрокаЗначение) Тогда

			Значение = Неопределено;

		Иначе

			Значение = ЗначениеИзСтрокиВнутр(СтрокаЗначение);

		КонецЕсли;

		Запрос.УстановитьПараметр(ЭлементПараметр.Имя, Значение);

	КонецЦикла;

	

КонецПроцедуры



// Выполняет запрос.

//

// Параметры:

//  ТекстЗапроса - Строка.

//  ПараметрыЗапроса - Массив - параметры запроса.

//  ТДРезультатаЗапроса - ТабличныйДокумент - результат запроса.

//  ПараметрыВыводаЗапроса - Структура:

//    * ВыводитьВременныеТаблицы - Булево.

//    * ВыводитьИдентификатор - Булево - выводить GUID для ссылок или нет.

//    * ПорядокОбхода - Строка - порядок обхода результата запроса.

//    * ИспользованиеЧередования - Булево - использовать чередование или нет в результирующем табличном документе.

//  ОтчетПоВыполнениюЗапроса - Структура:

//    * ВремяВыполнения - Число - время выполнения запроса.

//    * КоличествоСтрок - Число - количество строк в результате запроса.

//    * ТекстСообщения - Строка - текст сообщения об ошибке.

//  МеткаЗапроса - Строка - метка запроса для поиска его в технологическом журнале.

//

Функция ВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса, ТДРезультатаЗапроса, ПараметрыВыводаЗапроса, ОтчетПоВыполнениюЗапроса, МеткаЗапроса) Экспорт

	

	Если ЗначениеЗаполнено(МеткаЗапроса) Тогда

		ЗаписатьМеткуЗапроса(ТекстЗапроса, МеткаЗапроса, "begin");

	КонецЕсли;

		

	Если ЗначениеЗаполнено(МеткаЗапроса) Тогда

		ЗаписатьМеткуЗапроса(ТекстЗапроса, МеткаЗапроса, "end");

	КонецЕсли;

	

	// Массив текстов запросов.

	МассивТекстов = ПостроитьМассивТекстовЗапросов(ТекстЗапроса);

	

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса ,"\;", ";"); // Экранирование точки с запятой.

	Запрос = Новый Запрос(ТекстЗапроса);

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();

	

	// Загрузка параметров.

	ЗагрузкаПараметровВЗапрос(Запрос, ПараметрыЗапроса);

	

	// Проверка на правильность запросов.

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();

	МассивЗапросов = Запрос.ВыполнитьПакет();

	Конец  = ТекущаяУниверсальнаяДатаВМиллисекундах() ;

	ОтчетПоВыполнениюЗапроса.ВремяВыполнения = (Конец - Начало) / 1000;

	

	МассивДанныхПоЗапросу = Новый Структура;

	МассивДанныхПоЗапросу.Вставить("Запрос", Запрос);

	МассивДанныхПоЗапросу.Вставить("МассивТекстов", МассивТекстов);

	МассивДанныхПоЗапросу.Вставить("МассивЗапросов", МассивЗапросов);

	МассивДанныхПоЗапросу.Вставить("МеткаЗапроса", МеткаЗапроса);

	

	Успешно = ВывестиРезультатЗапросов(ТДРезультатаЗапроса, МассивДанныхПоЗапросу, ПараметрыЗапроса, ПараметрыВыводаЗапроса, ОтчетПоВыполнениюЗапроса);

	Если Не Успешно Тогда

		Если ВозможноОшибкаИзЗаТочкиСЗапятой(ТекстЗапроса) Тогда 

			ОтчетПоВыполнениюЗапроса.ТекстСообщения = НСтр("ru = 'Результат запроса не был выведен. Возможно не экранирована точка с запятой. Для экранирования точки с запятой используется обратный слеш -""\;""(см. справку)'");

		Иначе

			ОтчетПоВыполнениюЗапроса.ТекстСообщения = НСтр("ru = 'Запрос не был выполнен, т.к. текст запроса некорректный'");

		КонецЕсли;

	КонецЕсли;

	

	Возврат МассивЗапросов;

	

КонецФункции



Процедура ЗаписатьМеткуЗапроса(ТекстЗапроса, Метка, Статус)

	

	Если Статус = "begin" Тогда

		ТекстМетки = СтрЗаменить("ВЫБРАТЬ ""[Маркер]"" КАК МЕТКА ПОМЕСТИТЬ Marker_begin", "[Маркер]", 

			"Marker_" + Метка+ "_"+ Статус);

		ТекстЗапроса = ТекстМетки + Символы.ПС + ";" + Символы.ПС + ТекстЗапроса + Символы.ПС + ";" + Символы.ПС;

	Иначе

		ТекстМетки = СтрЗаменить("ВЫБРАТЬ ""[Маркер]"" КАК МЕТКА ПОМЕСТИТЬ Marker_end", "[Маркер]", 

			"Marker_" + Метка+ "_"+ Статус);

		ТекстЗапроса =  Символы.ПС + ТекстЗапроса + ТекстМетки + Символы.ПС + ";" + Символы.ПС;

	КонецЕсли;

	

КонецПроцедуры



// Возвращает массив текстов запросов.

//

// Параметры:

//  ТекстЗапроса - Строка.

//

Функция ПостроитьМассивТекстовЗапросов(знач ТекстЗапроса)

	

	МассивТекстов = Новый Массив;

	Пока Не ПустаяСтрока(ТекстЗапроса) Цикл

		ТочкаСЗапятой = ";";

		ПозицияТочкиСЗапятой = СтрНайти(ТекстЗапроса, ТочкаСЗапятой);

		Если Сред(ТекстЗапроса, ПозицияТочкиСЗапятой - 1, 1) = "\" Тогда

			ПозицияТочкиСЗапятой = 0;

		КонецЕсли;

		Если ПозицияТочкиСЗапятой = 0 Тогда

			ТекстОчередногоЗапроса 	= ТекстЗапроса;

			ПозицияТочкиСЗапятой	= СтрДлина(ТекстЗапроса);

		Иначе

			ТекстОчередногоЗапроса = Лев(ТекстЗапроса, ПозицияТочкиСЗапятой - 1);

		КонецЕсли;

		Если Не ПустаяСтрока(ТекстОчередногоЗапроса) Тогда 

			МассивТекстов.Добавить(СокрЛП(ТекстОчередногоЗапроса));

		КонецЕсли;

		ТекстЗапроса = Сред(ТекстЗапроса, ПозицияТочкиСЗапятой + 1);

	КонецЦикла;

	

	Возврат МассивТекстов;

	

КонецФункции



// Возвращает есть ли в запросе иерархия.

//

// Параметры:

//  ТекстЗапроса - Строка

//

Функция НаличиеИерархииВЗапросе(ТекстЗапроса)

	

	Итоги	= "ИТОГИ";

	Позиция	= СтрНайти(ВРег(ТекстЗапроса), Итоги);

	

	Возврат ?(Позиция = 0, Ложь, Истина);

	

КонецФункции



// Возвращает имя временной таблицы.

//

// Параметры:

//  ТекстЗапроса - Строка

//  Буфер - Строка - переменная хранения строки вида 'ПОМЕСТИТЬ %ИмяВременнойТаблицы%'.

//  Позиция - Число - позиция после слова 'ПОМЕСТИТЬ' в тексте запроса.

//

Функция ПолучитьИмяВременнойТаблицы(ТекстЗапроса, Буфер, Позиция)

	

	ИмяТаблицы		= "";

	ДлиннаТекста 	= СтрДлина(ТекстЗапроса);

	

	// Добавление пустых символов к буферу.

	Для Индекс = Позиция По ДлиннаТекста Цикл

		Символ = Сред(ТекстЗапроса, Индекс, 1);

		Если ПустаяСтрока(Символ) Тогда

			Буфер = Буфер + Символ;

		Иначе

			Прервать;

		КонецЕсли;

	КонецЦикла;

	

	// Добавление имени временной таблицы.

	Для ИндексВременнойТаблицы = Индекс По ДлиннаТекста Цикл

		Символ = Сред(ТекстЗапроса, ИндексВременнойТаблицы, 1);

		Если Не ПустаяСтрока(Символ) Тогда

			Буфер 		= Буфер + Символ;

			ИмяТаблицы  = ИмяТаблицы + Символ; 

		Иначе

			Прервать;

		КонецЕсли;

	КонецЦикла;

	

	Возврат ИмяТаблицы;

	

КонецФункции



// Возвращает имя запроса из текста запроса.

//

// Параметры:

//  ТекстЗапроса - Строка.

//

Функция ПолучитьИмяЗапроса(знач ТекстЗапроса)

	

	РезультатЗначение = НСтр("ru = 'Запрос:'") + " ";

	ДлинаТекста = СтрДлина(ТекстЗапроса);

	ФлагПредлогаИЗ = Истина;

	

	Пока ФлагПредлогаИЗ Цикл 

		СловоИЗ = "ИЗ";

		ДлинаИЗ = СтрДлина(СловоИЗ);

		ПозицияИЗ = СтрНайти(ВРег(ТекстЗапроса), СловоИЗ);

		Если ПозицияИЗ = 0 Тогда

			Возврат РезультатЗначение;

		КонецЕсли;

		

		СимволДоИЗ = Сред(ТекстЗапроса, ПозицияИЗ - 1, 1);

		СимволПослеИЗ = Сред(ТекстЗапроса, ПозицияИЗ + ДлинаИЗ, 1);

		Если ПустаяСтрока(СимволДоИЗ) И ПустаяСтрока(СимволПослеИЗ) Тогда

			ФлагПредлогаИЗ = Ложь;

		Иначе

			ТекстЗапроса = Сред(ТекстЗапроса, ПозицияИЗ + ДлинаИЗ);

		КонецЕсли;

	КонецЦикла;

	

	НачальнаяПозиция = ПозицияИЗ + ДлинаИЗ;

	

	Для Индекс = НачальнаяПозиция По ДлинаТекста Цикл

		Символ = Сред(ТекстЗапроса, Индекс, 1);

		Если Не ПустаяСтрока(Символ) Тогда

			Прервать;

		КонецЕсли;

	КонецЦикла;

	

	// Формирование имени таблицы.

	Для ИндексЗапроса = Индекс По ДлинаТекста Цикл

		Символ = Сред(ТекстЗапроса, ИндексЗапроса, 1);

		Если Не ПустаяСтрока(Символ) Тогда

			РезультатЗначение = РезультатЗначение + Символ;

		Иначе

			Прервать;

		КонецЕсли;

	КонецЦикла;

	

	Возврат РезультатЗначение;

	

КонецФункции



///////////////////////////////////////////////////////////////////////////

// ФУНКЦИИ РАБОТЫ С РЕЗУЛЬТАТОМ ЗАПРОСА



Функция ВозможноОшибкаИзЗаТочкиСЗапятой(ТекстЗапроса)

	

	Позиция = 1;

	Пока Позиция >0 Цикл

		Позиция = СтрНайти(ТекстЗапроса, ";");

		Если Позиция > 0 Тогда 

			ТекстДляПоиска = Лев(ТекстЗапроса, Позиция);

			Если СтрНайти(ТекстДляПоиска, """") >0 Тогда

				Возврат Истина;

			КонецЕсли;

		КонецЕсли;

		ТекстЗапроса = Сред(ТекстЗапроса, Позиция + 1);

	КонецЦикла;

	

	Возврат Ложь;

	

КонецФункции



// Вывод результата всех запросов с временными таблицами.

// 

// Если временная таблица, то выполняется запрос из массива текстов и формируется результат.

// Если не временная таблица, то результат берется из МассиваРезультатов.

//

// Параметры:

//  ТДРезультатаЗапроса - ТабличныйДокумент - результата запроса.

//  МассивДанныхПоЗапросу - Структура - содержит данные по запроса:

//    * Запрос - Запрос - передаваемый запрос.

//    * МассивТекстов - Массив - массив текстов запросов.

//    * МассивЗапросов - Массив - массив результатов запросов.

//  ПараметрыЗапроса - Массив -  параметры запроса.

//  ПараметрыВыводаЗапроса - Структура:

//    * ВыводитьВременныеТаблицы - Булево - выводить временные таблицы или нет.

//    * ВыводитьИдентификатор - Булево - выводить GUID для ссылок или нет.

//    * ПорядокОбхода - Строка- порядок обхода результата запроса.

//    * ИспользованиеЧередования - Булево - использовать чередование или нет в результирующем табличном документе.

//  ОтчетПоВыполнениюЗапроса - Структура:

//    * ВремяВыполнения - Число - время выполнения запроса.

//    * КоличествоСтрок - Число - количество строк в результате запроса.

//    * ТекстСообщения - Строка - текст сообщения об ошибке.

//

Функция ВывестиРезультатЗапросов(ТДРезультатаЗапроса, МассивДанныхПоЗапросу, ПараметрыЗапроса, ПараметрыВыводаЗапроса, ОтчетПоВыполнениюЗапроса)

	

	МассивТекстов = МассивДанныхПоЗапросу.МассивТекстов;

	МассивЗапросов = МассивДанныхПоЗапросу.МассивЗапросов;

	МеткаЗапроса = МассивДанныхПоЗапросу.МеткаЗапроса;

	

	КоличествоТекстовЗапросов 		= МассивТекстов.Количество();

	КоличествоРезультатовЗапросов   = МассивЗапросов.Количество();

		

	Если КоличествоРезультатовЗапросов <> КоличествоТекстовЗапросов Тогда

		Возврат Ложь;

	КонецЕсли;

	

	// Накапливаемый запрос необходим для вывода временных таблиц, в том числе и удаляемых.

	НакапливаемыйЗапрос = Новый Запрос;

	ЗагрузкаПараметровВЗапрос(НакапливаемыйЗапрос, ПараметрыЗапроса);

	

	СимволРазделенияЗапросов = "";

	Для Индекс = 0 По КоличествоТекстовЗапросов - 1 Цикл

		ТекстЗапросаМассива = МассивТекстов.Получить(Индекс);

		

		Если ЗначениеЗаполнено(МеткаЗапроса) И СтрНайти(ТекстЗапросаМассива, МеткаЗапроса) > 0 Тогда

			КоличествоРезультатовЗапросов = КоличествоРезультатовЗапросов - 1;

			Продолжить;

		КонецЕсли;

		

		КоличествоСтрокОдногоЗапроса = 0;

		МассивШириныКолонок          = Новый Массив;

		Свертка                      = ОпределитьСвертку(Индекс, КоличествоРезультатовЗапросов);

		

		Поместить        = "ПОМЕСТИТЬ";

		ДлинаПоместить   = СтрДлина(Поместить);

		ПозицияПоместить = СтрНайти(ВРег(ТекстЗапросаМассива), Поместить);

		

		Если Индекс > 0 Тогда

			СимволРазделенияЗапросов = ";";

		КонецЕсли;

		

		НакапливаемыйЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

		НакопленныйТекст          = НакапливаемыйЗапрос.Текст + СимволРазделенияЗапросов + МассивТекстов.Получить(Индекс);

		НакапливаемыйЗапрос.Текст = НакопленныйТекст;

		

		// Если временная таблица и выводить временные таблицы.

		Если ПозицияПоместить <> 0 И ПараметрыВыводаЗапроса.ВыводитьВременныеТаблицы Тогда

			БуферПоместить = Сред(ТекстЗапросаМассива, ПозицияПоместить, ДлинаПоместить);

			ПозицияПослеПоместить = ПозицияПоместить + ДлинаПоместить;

			ИмяТаблицы = ПолучитьИмяВременнойТаблицы(ТекстЗапросаМассива, БуферПоместить, ПозицияПослеПоместить);

			

			// Выполнение запроса.

			ИмяЗапроса = "";

			Результат = ВыполнитьЗапросСВременнойТаблицей(НакапливаемыйЗапрос, ИмяТаблицы, ИмяЗапроса);

			

			Если Результат <> Неопределено Тогда

				ТД = ВывестиРезультатОдногоЗапроса(ИмяЗапроса, Результат, Свертка, ПараметрыВыводаЗапроса, Ложь, КоличествоСтрокОдногоЗапроса, МассивШириныКолонок);

				ТДРезультатаЗапроса.Вывести(ТД);

			КонецЕсли;

		ИначеЕсли ПозицияПоместить = 0 Тогда // Если таблица не временная, то используется готовый результат.

			Результат  = МассивЗапросов.Получить(Индекс);

			ИмяЗапроса = ПолучитьИмяЗапроса(ТекстЗапросаМассива);

			Иерархия   = НаличиеИерархииВЗапросе(ТекстЗапросаМассива);

			

			ТД = ВывестиРезультатОдногоЗапроса(ИмяЗапроса, Результат, Свертка, ПараметрыВыводаЗапроса, Иерархия, КоличествоСтрокОдногоЗапроса, МассивШириныКолонок);

			ТДРезультатаЗапроса.Вывести(ТД);

		КонецЕсли;

		ОтчетПоВыполнениюЗапроса.КоличествоСтрок = ОтчетПоВыполнениюЗапроса.КоличествоСтрок + КоличествоСтрокОдногоЗапроса;

	КонецЦикла;

	

	Возврат Истина;

	

КонецФункции



// Вывод результат запроса в табличный документ.

//

// Параметры:

//   ИмяЗапроса - Строка - имя запроса.

//   РезультатЗапроса - РезультатЗапроса.

//   Открыта - Булево - свернуть результат одного запроса в выводимом табличном документе.

//  ПараметрыВыводаЗапроса - Структура:

//    * ВыводитьВременныеТаблицы - Булево - выводить временные таблицы или нет.

//    * ВыводитьИдентификатор - Булево - выводить GUID для ссылок или нет.

//    * ПорядокОбхода - Строка - порядок обхода результата запроса.

//    * ИспользованиеЧередования - Булево - использовать чередование или нет в результирующем табличном документе.

//   Иерархия - Булево - наличие итогов в запросе.

//   КоличествоСтрок - Число - количество строк в результате данного запроса.

//   МассивШириныКолонок - Массив - максимальная ширина каждой колонки.

//

Функция ВывестиРезультатОдногоЗапроса(ИмяЗапроса, РезультатЗапроса, Открыта, ПараметрыВыводаЗапроса, Иерархия, КоличествоСтрок, МассивШириныКолонок)

	

	РезультатЗапроса = ВыгрузкаРезультата(РезультатЗапроса, ПараметрыВыводаЗапроса.ПорядокОбхода, Иерархия);

	

	ВыходнойМакет = Новый ТабличныйДокумент;

	МакетОдногоЗапроса = Новый ТабличныйДокумент;

	

	Если РезультатЗапроса = Неопределено Тогда

		Возврат ВыходнойМакет;

	КонецЕсли;

	

	МакетОдногоЗапроса.Очистить();

	ВыходнойМакет.Очистить();

	

	УровеньВерхний = 1;

	УровеньЗаголовкаИДеталей = 2;

	

	Если ТипЗнч(РезультатЗапроса) = Тип("ДеревоЗначений") Тогда

		КоличествоСтрок = РезультатЗапроса.Строки.Количество();

	Иначе

		КоличествоСтрок = РезультатЗапроса.Количество();

	КонецЕсли;

	

	// Вывод в табличный документ.

	ЗаголовкиКолонок = ВывестиЗаголовкиКолонок(РезультатЗапроса, МассивШириныКолонок);

	ПараметрыВыводаЗапроса.Вставить("МассивШириныКолонок", МассивШириныКолонок);

	ПараметрыВыводаЗапроса.Вставить("КоличествоСтрок", КоличествоСтрок);

	ПараметрыВыводаЗапроса.Вставить("КоличествоСтрокВыведено", 0);

	Детали = ВывестиДетали(РезультатЗапроса, ПараметрыВыводаЗапроса);

	

	Если ПараметрыВыводаЗапроса.ВыводитьРезультатыЗапроса >= 0

		 И (ПараметрыВыводаЗапроса.КоличествоСтрокВыведено < ПараметрыВыводаЗапроса.КоличествоСтрок) Тогда

		КоличествоСтрокВЗаголовок = Формат(ПараметрыВыводаЗапроса.КоличествоСтрокВыведено, "ЧГ=0; ЧН=0") + " из "

			+ ПараметрыВыводаЗапроса.КоличествоСтрок;

	Иначе

		КоличествоСтрокВЗаголовок = Формат(ПараметрыВыводаЗапроса.КоличествоСтрок, "ЧГ=0; ЧН=0");

	КонецЕсли;

	

	Заголовок = ВывестиЗаголовокЗапроса(ИмяЗапроса, КоличествоСтрокВЗаголовок);

	

	МакетОдногоЗапроса.НачатьАвтогруппировкуСтрок();

	

	МакетОдногоЗапроса.Вывести(Заголовок, УровеньВерхний);

	МакетОдногоЗапроса.Вывести(ЗаголовкиКолонок, УровеньЗаголовкаИДеталей,, Открыта);

	МакетОдногоЗапроса.Вывести(Детали, УровеньЗаголовкаИДеталей,, Открыта);

	

	МакетОдногоЗапроса.ЗакончитьАвтогруппировкуСтрок();

	

	УстановкаАвтоШирины(ВыходнойМакет, МассивШириныКолонок);

	ВыходнойМакет.Вывести(МакетОдногоЗапроса).СоздатьФорматСтрок();

	

	Возврат ВыходнойМакет;

	

КонецФункции



// Возвращает ТаблицуЗначений или ДеревоЗначений результата.

//

// Параметры:

//  РезультатЗапроса - РезультатЗапроса

//  ПорядокОбхода - Строка

//  Иерархия - Булево - есть ли иерархия в запросе. 

//

// Возвращаемое значение:

//  ТаблицаЗначений

//  ДеревоЗначений

//

Функция ВыгрузкаРезультата(РезультатЗапроса, ПорядокОбхода, Иерархия)

	

	Если РезультатЗапроса = Неопределено Тогда

		Возврат Неопределено;

	КонецЕсли;

	

	Если ВРег(ПорядокОбхода) = "АВТО" Тогда

		Если Иерархия Тогда

			ВыгруженноеЗначение = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

		Иначе

			ВыгруженноеЗначение = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);

		КонецЕсли;

	Иначе

		ВыгруженноеЗначение = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);

	КонецЕсли;

	

	Возврат ВыгруженноеЗначение;

	

КонецФункции



Функция ВывестиЗаголовокЗапроса(ИмяЗапроса,КоличествоСтрок)

	

	Заголовок 	= Новый ТабличныйДокумент;

	

	МакетВывода = ПолучитьМакет("РезультатВыполненияЗапроса");

	

	ОбластьЗаголовок 	= МакетВывода.ПолучитьОбласть("ЗапросИмя");

	ОбластьЗаголовок.Параметры.ИмяЗапроса  		= ИмяЗапроса;

	ОбластьЗаголовок.Параметры.КоличествоСтрок	= КоличествоСтрок;

	Заголовок.Вывести(ОбластьЗаголовок);

	

	Возврат Заголовок;

	

КонецФункции



Функция ВывестиЗаголовкиКолонок(Результат, МассивШириныКолонок)

	

	МакетВывода 				= ПолучитьМакет("РезультатВыполненияЗапроса");

	

	ВерхнийЗаголовокКолонок		= Новый ТабличныйДокумент;

	

	ЗаголовокКолонок				= Новый ТабличныйДокумент;

	ОбластьЗаголовкиКолонок 	= МакетВывода.ПолучитьОбласть("ОбластьЯчейки");

	

	Область 	  					= ОбластьЗаголовкиКолонок.Область();

	Область.Шрифт 					= Новый Шрифт(,, Ложь);

	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;

	Область.ЦветФона				= Новый Цвет(204, 192, 133);

	

	Индекс = 0;

	// Вывод заголовка таблицы.

	Для каждого Стр Из Результат.Колонки Цикл

		УстановкаМаксимальнойШириныВМассив(Индекс, Стр.Имя, МассивШириныКолонок);

		ОбластьЗаголовкиКолонок.Параметры.Значение	= Стр.Имя;

		Об = ЗаголовокКолонок.Присоединить(ОбластьЗаголовкиКолонок);

		Об.ШиринаКолонки = МассивШириныКолонок.Получить(Индекс);

		Индекс	= Индекс + 1;

	КонецЦикла;

	ВерхнийЗаголовокКолонок.Вывести(ЗаголовокКолонок);

	

	Возврат ВерхнийЗаголовокКолонок;

	

КонецФункции



Функция ВывестиДетали(Результат, ПараметрыВыводаЗапроса)

	

	Детали = Новый ТабличныйДокумент;

	Уровень = 1;

	Детали.НачатьАвтогруппировкуСтрок();

	

	Если ТипЗнч(Результат) = Тип("ДеревоЗначений") Тогда

		ИндексСтроки = 1;

		КоличествоКолонок = Результат.Колонки.Количество();

		ВывестиДеталиСИерархией(Детали, Результат, ПараметрыВыводаЗапроса, Уровень, КоличествоКолонок, ИндексСтроки);

	КонецЕсли;

	

	Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда

		КоличествоКолонок = Результат.Колонки.Количество();

		ВывестиДеталиБезИерархии(Детали, Результат, ПараметрыВыводаЗапроса, Уровень, КоличествоКолонок);

	КонецЕсли;

	

	Детали.ЗакончитьАвтогруппировкуСтрок();

	Возврат Детали;

	

КонецФункции



Процедура ВывестиДеталиБезИерархии(ОбщиеДетали, Результат, ПараметрыВыводаЗапроса, Уровень, КоличествоКолонок)

	

	МакетВывода = ПолучитьМакет("РезультатВыполненияЗапроса");

	ПараметрыВыводаЗапроса.КоличествоСтрок = Результат.Количество();

	ИндексСтроки = 1;

	

	КоличествоСтрокРезультатаЗапроса = ?(ПараметрыВыводаЗапроса.ВыводитьРезультатыЗапроса = -1,ПараметрыВыводаЗапроса.КоличествоСтрок, ПараметрыВыводаЗапроса.ВыводитьРезультатыЗапроса);

	

	Для каждого Строка Из Результат Цикл

		

		Если ИндексСтроки > КоличествоСтрокРезультатаЗапроса Тогда

			Прервать;

		КонецЕсли;

		

		Детали = Новый ТабличныйДокумент;

		ОбластьДетали = МакетВывода.ПолучитьОбласть("ОбластьЯчейки");

		

		Область = ОбластьДетали.ТекущаяОбласть;

		Область.Шрифт = Новый Шрифт(,, Ложь);

		Область.ЦветФона = ОпределитьЦветФонаПоИндексу(ИндексСтроки, ПараметрыВыводаЗапроса.ИспользованиеЧередования);

		

		Для Индекс = 0 По КоличествоКолонок - 1 Цикл

			Значение = Строка.Получить(Индекс);

			

			Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда

				Значение = ПреобразоватьТаблицуЗначенийВСтроке(Значение);

			КонецЕсли;

			

			ЗначениеДляПараметра = Значение;

			Если ЭтоСсылка(ТипЗнч(Значение)) И ПараметрыВыводаЗапроса.ВыводитьИдентификатор Тогда

				Попытка

					ЗначениеДляПараметра = Значение.УникальныйИдентификатор();

				Исключение

					ЗначениеДляПараметра = Значение;

				КонецПопытки;

			КонецЕсли;

			ОбластьДетали.Параметры.Значение = ЗначениеДляПараметра;

			ОбластьДетали.Параметры.Расшифровка = Значение;

			УстановкаМаксимальнойШириныВМассив(Индекс, ЗначениеДляПараметра, ПараметрыВыводаЗапроса.МассивШириныКолонок);

			Детали.Присоединить(ОбластьДетали);

		КонецЦикла;

		ИндексСтроки = ИндексСтроки + 1;

		ПараметрыВыводаЗапроса.КоличествоСтрокВыведено = ПараметрыВыводаЗапроса.КоличествоСтрокВыведено + 1;

		ОбщиеДетали.Вывести(Детали, Уровень);

	КонецЦикла;

	

КонецПроцедуры



Процедура ВывестиДеталиСИерархией(ОбщиеДетали, Результат, ПараметрыВыводаЗапроса , Уровень, КоличествоКолонок, ИндексСтроки, ТолькоПодсчетКоличестваСтрок = Ложь)

	

	

	МакетВывода = ПолучитьМакет("РезультатВыполненияЗапроса");

	Открыта = Истина;

	Подчиненные = Результат.Строки;

	ПараметрыВыводаЗапроса.КоличествоСтрок = ПараметрыВыводаЗапроса.КоличествоСтрок + Подчиненные.Количество();

	

	Если ТолькоПодсчетКоличестваСтрок Тогда

		Для Каждого Подчиненный Из Подчиненные Цикл

			ВывестиДеталиСИерархией(ОбщиеДетали, Подчиненный, ПараметрыВыводаЗапроса, Уровень + 1, КоличествоКолонок, ИндексСтроки, Истина);

		КонецЦикла;

		Возврат;

	КонецЕсли;

	

	ИндексСтрокиПоУровню = 1;

	КоличествоСтрокРезультатаЗапроса = ?(ПараметрыВыводаЗапроса.ВыводитьРезультатыЗапроса = -1, Подчиненные.Количество(), ПараметрыВыводаЗапроса.ВыводитьРезультатыЗапроса);

	

	Для Каждого Подчиненный Из Подчиненные Цикл

		

		Если ИндексСтрокиПоУровню > КоличествоСтрокРезультатаЗапроса Тогда

			ВывестиДеталиСИерархией(ОбщиеДетали, Подчиненный, ПараметрыВыводаЗапроса, Уровень + 1, КоличествоКолонок, ИндексСтроки, Истина);

			Продолжить;

		КонецЕсли;

		

		Детали = Новый ТабличныйДокумент;

		ОбластьДетали = МакетВывода.ПолучитьОбласть("ОбластьЯчейки");

		

		Область = ОбластьДетали.ТекущаяОбласть;

		Область.Шрифт = Новый Шрифт(,, Ложь);

		Область.ЦветФона = ОпределитьЦветФонаПоИндексу(ИндексСтроки, ПараметрыВыводаЗапроса.ИспользованиеЧередования);

		

		Для Индекс = 0 По КоличествоКолонок - 1 Цикл

			Значение = Подчиненный.Получить(Индекс);

			

			Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда

				Значение = ПреобразоватьТаблицуЗначенийВСтроке(Значение);

			КонецЕсли;

			

			ЗначениеДляПараметра = Значение;

			// Определение количество отступа по уровню.

			Пробел = ОпределениеОтступаПоУровню(Уровень, Индекс, Открыта);

			

			Если ЭтоСсылка(ТипЗнч(Значение)) И ПараметрыВыводаЗапроса.ВыводитьИдентификатор Тогда

				Попытка

					ЗначениеДляПараметра = Значение.УникальныйИдентификатор();

				Исключение

					ЗначениеДляПараметра = Значение;

				КонецПопытки;

			КонецЕсли;

			ЗначениеДляПараметра = "" + Пробел + ЗначениеДляПараметра;

			ОбластьДетали.Параметры.Значение = ЗначениеДляПараметра;

			ОбластьДетали.Параметры.Расшифровка = Значение;

			

			УстановкаМаксимальнойШириныВМассив(Индекс, ЗначениеДляПараметра, ПараметрыВыводаЗапроса.МассивШириныКолонок);

			

			Детали.Присоединить(ОбластьДетали);

			

		КонецЦикла;

		

		ОбщиеДетали.Вывести(Детали, Уровень,, Открыта);

		ИндексСтроки = ИндексСтроки + 1;

		ИндексСтрокиПоУровню = ИндексСтрокиПоУровню + 1;

		ПараметрыВыводаЗапроса.КоличествоСтрокВыведено = ПараметрыВыводаЗапроса.КоличествоСтрокВыведено + 1;

		

		ВывестиДеталиСИерархией(ОбщиеДетали, Подчиненный, ПараметрыВыводаЗапроса, Уровень + 1, КоличествоКолонок, ИндексСтроки);

		

	КонецЦикла;

	

КонецПроцедуры



// Определяет сворачивать или нет результат одного запроса.

//

// Параметры:

//  ПозицияТекущегоЗапроса - Число - порядок запроса в пакете.

//  КоличествоВсехЗапросов - Число - количество всех запросов в пакете.

//

Функция ОпределитьСвертку(знач ПозицияТекущегоЗапроса, КоличествоВсехЗапросов)

	

	ПозицияТекущегоЗапроса = ПозицияТекущегоЗапроса + 1;

	

	Если КоличествоВсехЗапросов = 1 Тогда

		РезультатЗначение = Истина;

	Иначе

		Если ПозицияТекущегоЗапроса = КоличествоВсехЗапросов Тогда

			РезультатЗначение = Истина;

		Иначе

			РезультатЗначение = Ложь;

		КонецЕсли;

	КонецЕсли;

	

	Возврат РезультатЗначение;

	

КонецФункции



// Выводит строку с автошириной колонок.

//

// Параметры: 

//  РезультатЗапроса - ТабличныйДокумент.

//  МассивМаксШирины - Массив из Число - ширина колонок для отдельного запроса.

//

Процедура УстановкаАвтоШирины(РезультатЗапроса, МассивМаксШирины)

	

	ВерхняяГраница = МассивМаксШирины.ВГраница();

	Если ВерхняяГраница = -1 Тогда

		Возврат;

	КонецЕсли;

	

	Для Индекс = 0 По ВерхняяГраница Цикл 

		ВременныйТабличныйДокумент = Новый ТабличныйДокумент;

		Стр = ВременныйТабличныйДокумент.ПолучитьОбласть(1, Индекс + 1, 1, Индекс + 1);

		РезультатЗапроса.Присоединить(Стр).ШиринаКолонки = МассивМаксШирины.Получить(Индекс);

	КонецЦикла;

	

КонецПроцедуры



///////////////////////////////////////////////////////////////////////////

// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ



// Формирует список возможных типов конфигурации.

//

// Параметры:

//  СписокДобавленныхТипов - СписокЗначений - список типов, добавленных "вручную".

//

// Возвращаемое значение:

//  СписокЗначений

//

Функция СформироватьСписокТипов(СписокДобавленныхТипов = Неопределено) Экспорт

	

	МассивТипов = ДоступныеТипыДанных.Типы();

	

	НеПримитивныеТипы = Новый СписокЗначений;

	НеПримитивныеТипы.ЗагрузитьЗначения(МассивТипов);

	НеПримитивныеТипы.СортироватьПоЗначению(НаправлениеСортировки.Возр);

	

	СписокТипов = Новый СписокЗначений;

	СписокТипов.Добавить("Строка", НСтр("ru = 'Строка'"));

	СписокТипов.Добавить("Число", НСтр("ru = 'Число'"));

	СписокТипов.Добавить("Дата", НСтр("ru = 'Дата'"));

	СписокТипов.Добавить("Булево", НСтр("ru = 'Булево'"));

	СписокТипов.Добавить("Граница", НСтр("ru = 'Граница'"));

	СписокТипов.Добавить("МоментВремени", НСтр("ru = 'Момент времени'"));

	СписокТипов.Добавить("СписокЗначений", НСтр("ru = 'Список значений'"));

	СписокТипов.Добавить("ТаблицаЗначений", НСтр("ru = 'Таблица значений'"));

	

	СписокДобавленныхТипов = Новый СписокЗначений;

	СписокДобавленныхТипов = СписокТипов.Скопировать();

	

	Для каждого Стр Из НеПримитивныеТипы Цикл

		ЗначениеТипа 		= XMLТип(Стр.Значение).ИмяТипа;

		ПредставлениеТипа 	= Строка(Стр.Значение);

		СписокТипов.Добавить(ЗначениеТипа, ПредставлениеТипа);

	КонецЦикла;

	

	Возврат СписокТипов;

	

КонецФункции



// Определяет отступ по уровню.

//

// Параметры:

//  Уровень - Число - переданный уровень в дереве.

//  НомерКолонки - Число - номер колонки, отступ устанавливается только для первой колонки.

//  Открыта - Булево - открыта группа или нет.

//

Функция ОпределениеОтступаПоУровню(Уровень, НомерКолонки, Открыта)

	

	Пробел = "";

	Если НомерКолонки = 0 Тогда

		Если Уровень > 1 Тогда

			Для Индекс = 1 По Уровень Цикл

				Пробел = Пробел + Символы.Таб;

			КонецЦикла;

			Открыта = Ложь;

		Иначе

			Открыта = Истина;

		КонецЕсли;

	КонецЕсли;

	Возврат Пробел;

	

КонецФункции



// Возвращает строковое представление типа по значению.

//

// Параметры:

//  Значение - Произвольный - передаваемое значение.

//

// Возвращаемое значение:

//  Строка

//

Функция ИмяТипаИзЗначения(Значение) Экспорт

	

	Если ТипЗнч(Значение) = Тип("Строка") Тогда

		ИмяТипа = "Строка";

	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда

		ИмяТипа = "Число";

	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда

		ИмяТипа = "Булево";

	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда

		ИмяТипа = "Дата";

	ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда

		ИмяТипа = "МоментВремени";

	ИначеЕсли ТипЗнч(Значение) = Тип("Неопределено") Тогда

		ИмяТипа = "Строка";

	ИначеЕсли ТипЗнч(Значение) = Тип("ФиксированныйМассив") Тогда

		ИмяТипа = "ФиксированныйМассив";

	ИначеЕсли ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда

		ИмяТипа = "ТаблицаЗначений";

	Иначе

		ИмяТипа = xmlТип(ТипЗнч(Значение)).ИмяТипа;

	КонецЕсли;

	

	Возврат ИмяТипа;

	

КонецФункции



// Возвращает вид границы из ее строкового представления.

//

// Параметры:

//  Вид - Строка - строковое представление вида границы.

//

// Возвращаемое значение:

//  ВидГраницы 

//

Функция ОпределениеВидаГраницы(Вид) Экспорт

	

	Если ВРег(Вид) = "ИСКЛЮЧАЯ" Тогда

		Результат = ВидГраницы.Исключая;

	Иначе

		Результат = ВидГраницы.Включая;

	КонецЕсли;

	

	Возврат Результат;

	

КонецФункции



// Возвращает представление значения.

//

// Параметры:

//  Значение - Произвольный - передаваемое значение.

//

// Возвращаемое значение:

//  Строка

//

Функция ФормированиеПредставленияЗначения(Значение) Экспорт

	

	Результат = "";

	

	Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда

		ИтоговаяСтрока = НСтр("ru = 'Таблица: строк = %КоличествоСтрок%, колонок = %КоличествоКолонок%'");

		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%КоличествоСтрок%", Строка(Значение.Количество()));

		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%КоличествоКолонок%", Строка(Значение.Колонки.Количество()));

		Результат = ИтоговаяСтрока;

	ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда

		Результат = Строка(Значение.Дата) + "; " + Строка(Значение.Ссылка);

	ИначеЕсли ТипЗнч(Значение) = Тип("Граница") Тогда 

		Результат = Строка(Значение.Значение) + "; " + Строка(Значение.ВидГраницы);

	КонецЕсли;

	

	Возврат Результат;

	

КонецФункции



// Фильтрует список типов для данного контекста.

//

// Параметры:

//  СписокТипов - СписокЗначений - передаваемые типы.

//  Контекст - Строка

//

Процедура ФильтрацияСпискаТипов(СписокТипов, Контекст) Экспорт

	

	Если НРег(Контекст) = "граница" Тогда

		Элемент = СписокТипов.НайтиПоЗначению("СписокЗначений");

		СписокТипов.Удалить(Элемент);

		Элемент = СписокТипов.НайтиПоЗначению("ТаблицаЗначений");

		СписокТипов.Удалить(Элемент);

		Элемент = СписокТипов.НайтиПоЗначению("Граница");

		СписокТипов.Удалить(Элемент);

	КонецЕсли;

	

	Элемент = СписокТипов.НайтиПоЗначению("TypeDescription"); // Тип "Описание типов" удаляется всегда.

	СписокТипов.Удалить(Элемент);

	

КонецПроцедуры



// Устанавливает максимальную ширину ячейки для каждой колонки.

//

Процедура УстановкаМаксимальнойШириныВМассив(Индекс, знач Элем, МассивШириныКолонок)

	

	МаксимальнаяШиринаЯчейки = 100;

	

	Элем = СокрП(Элем);

	Элем = СтрДлина(Элем);

	Если Индекс > МассивШириныКолонок.ВГраница() Тогда

		Если Элем < МаксимальнаяШиринаЯчейки Тогда 

			МассивШириныКолонок.Вставить(Индекс, Элем + 1);

		Иначе

			МассивШириныКолонок.Вставить(Индекс, МаксимальнаяШиринаЯчейки);

		КонецЕсли;

	Иначе

		Макс = МассивШириныКолонок.Получить(Индекс);

		Если Элем > Макс Тогда

			Если Элем < МаксимальнаяШиринаЯчейки Тогда

				МассивШириныКолонок.Установить(Индекс, Элем + 1);

			Иначе

				МассивШириныКолонок.Установить(Индекс, МаксимальнаяШиринаЯчейки);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	

КонецПроцедуры



// Проверяет, является ли тип ссылкой.

//

// Параметры:

//  Тип - Тип - передаваемый тип.

//

// Возвращаемое значение:

//  Булево

//

Функция ЭтоСсылка(Тип) Экспорт

	

	Возврат Справочники.ТипВсеСсылки().СодержитТип(Тип)

		ИЛИ Документы.ТипВсеСсылки().СодержитТип(Тип)

		ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(Тип)

		ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип)

		ИЛИ ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип)

		ИЛИ ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип)

		ИЛИ БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип)

		ИЛИ БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип)

		ИЛИ Задачи.ТипВсеСсылки().СодержитТип(Тип)

		ИЛИ ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип);

	

КонецФункции



// Возвращает результат выполнения временной таблицы по имени.

//

// Параметры:

//  ЗапросДляВыполнения - Запрос.

//  ИмяВременнойТаблицы - Строка

//  ИмяЗапроса - Строка

//

Функция ВыполнитьЗапросСВременнойТаблицей(знач ЗапросДляВыполнения, ИмяВременнойТаблицы, ИмяЗапроса)

	

	ЗапросДляВыполнения.Текст = ЗапросДляВыполнения.Текст + " ; " 

		+ СтрЗаменить("ВЫБРАТЬ * ИЗ &ИмяВременнойТаблицы", "&ИмяВременнойТаблицы", ИмяВременнойТаблицы);



	Попытка

		Результат = ЗапросДляВыполнения.Выполнить();

		ИмяЗапроса = НСтр("ru = 'Временная таблица:'") + " " + ИмяВременнойТаблицы;

	Исключение

		Результат = Неопределено;

	КонецПопытки;

	

	Возврат Результат;

	

КонецФункции



// Возвращает цвет фона табличного документа по индексу строки и по использованию.

//

// Параметры:

//  Индекс - Число - индекс строки.

//  Использование - Булево - использовать или нет чередование.

//

// Возвращаемое значение:

//   Цвет

//

Функция ОпределитьЦветФонаПоИндексу(Индекс, Использование)

	

	ЦветЧередования	= Новый Цвет(245, 242, 221);

	

	Если Не Использование Тогда

		Возврат WebЦвета.Белый;

	КонецЕсли;

	

	Остаток = Индекс % 2;

	Если Остаток = 0 Тогда

		Цвет = ЦветЧередования;

	Иначе

		Цвет = WebЦвета.Белый;

	КонецЕсли;

	

	Возврат Цвет;

	

КонецФункции



Функция ПреобразоватьТаблицуЗначенийВСтроке(ТаблицаЗначений)

	

	ПредставлениеТаблицыЗначений = "";

	Для каждого СтрокаТаблицыЗначений Из ТаблицаЗначений Цикл

		Разделитель = "";

		Для каждого ЯчейкаТаблицыЗначений Из СтрокаТаблицыЗначений Цикл

			ПредставлениеТаблицыЗначений = ПредставлениеТаблицыЗначений + Разделитель + Строка(ЯчейкаТаблицыЗначений);

			Разделитель = ";";

		КонецЦикла;

		ПредставлениеТаблицыЗначений = ПредставлениеТаблицыЗначений + Символы.ПС;

	КонецЦикла;

	

	Возврат ПредставлениеТаблицыЗначений;

	

КонецФункции



// Определяет режим эксплуатации информационной базы файловый (Истина) или серверный (Ложь).

// При проверке используется СтрокаСоединенияИнформационнойБазы, которую можно указать явно.

//

// Параметры:

//  СтрокаСоединенияИнформационнойБазы - Строка - параметр используется, если

//                 нужно проверить строку соединения не текущей информационной базы.

//

// Возвращаемое значение:

//  Булево - Истина, если файловая.

//

Функция ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "")

	

	Если ПустаяСтрока(СтрокаСоединенияИнформационнойБазы) Тогда

		СтрокаСоединенияИнформационнойБазы = СтрокаСоединенияИнформационнойБазы();

	КонецЕсли;

	Возврат СтрНайти(ВРег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;

	

КонецФункции



Функция ВерсияПлатформы()



	СистемнаяИнформация = Новый СистемнаяИнформация;

	ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;

	Возврат ВерсияПлатформы;



КонецФункции



Функция ВерсияПриложенияЧисло(Знач ВерсияПриложенияСтрока)

	

	Результат = 0;

	

	ПозицияНачало = 1;

	ПозицияОкончание = 0;

	Для НомерСекции = 1 По 4 Цикл

	

		ПозицияОкончание = СтрНайти(ВерсияПриложенияСтрока,".",НаправлениеПоиска.СНачала, ПозицияНачало);

		Если ПозицияОкончание = 0 Тогда

			СтрокаСекции = СокрЛП(Сред(ВерсияПриложенияСтрока, ПозицияНачало));

		Иначе

			СтрокаСекции = СокрЛП(Сред(ВерсияПриложенияСтрока, ПозицияНачало, ПозицияОкончание - ПозицияНачало));

		КонецЕсли;

		

		Попытка

		

			Если НомерСекции = 1 Тогда

				Результат = Результат + Число(СтрокаСекции) * 1000000000;

			ИначеЕсли НомерСекции = 2 Тогда

				Результат = Результат + Число(СтрокаСекции) * 10000000;

			ИначеЕсли НомерСекции = 3 Тогда

				Результат = Результат + Число(СтрокаСекции) * 10000;

			ИначеЕсли НомерСекции = 4 Тогда

				Результат = Результат + Число(СтрокаСекции);

			КонецЕсли;

		

		Исключение

			Возврат Неопределено

		КонецПопытки;

		

		Если ПозицияОкончание = 0 ИЛИ ПозицияОкончание = СтрДлина(ВерсияПриложенияСтрока) Тогда

			Прервать;

		КонецЕсли;

		

		ПозицияНачало = ПозицияОкончание + 1;

		ПозицияОкончание = 0;

	

	КонецЦикла;

	

	Возврат Результат;

	

КонецФункции



Функция КаталогФайловойИБ()

	

	Путь = ВРЕГ(СтрокаСоединенияИнформационнойБазы());

	ПозицияПоиска = СтрНайти(Путь, "FILE");

	Если ПозицияПоиска = 0 Тогда

		Возврат "";

	КонецЕсли;

	Путь = СтрЗаменить(Путь, """", "");

	Путь = СтрЗаменить(Путь, ";", "");

	Путь = Сред(Путь, ПозицияПоиска + 5);

	ПозицияПоиска = СтрНайти(Путь, "\",НаправлениеПоиска.СКонца);

	Путь = Сред(Путь, ПозицияПоиска + 1);

	Возврат Путь;

	

КонецФункции



// Возвращаемое значение:

//   Структура:

//     * КаталогСЛогФайлами - Неопределено

//     * ТекущееСостояниеТЖ - Структура:

//        * Включен - Булево

//        * КаталогСЛогФайлами - Строка

//     * ФильтрыСобытияТЖ - Неопределено

//     * ЗаменитьФильтры - Булево

//

Функция ПараметрыОбработкиКонфигурационногоФайла()

	

	ТекущееСостояниеТЖ = Новый Структура;

	ТекущееСостояниеТЖ.Вставить("Включен", Ложь);

	ТекущееСостояниеТЖ.Вставить("КаталогСЛогФайлами", "");



	ПараметрыОбработки = Новый Структура;

	ПараметрыОбработки.Вставить("ЗаменитьФильтры", Ложь);

	ПараметрыОбработки.Вставить("ФильтрыСобытияТЖ", Неопределено);

	ПараметрыОбработки.Вставить("ТекущееСостояниеТЖ", ТекущееСостояниеТЖ);

	ПараметрыОбработки.Вставить("КаталогСЛогФайлами", Неопределено);

	Возврат ПараметрыОбработки;



КонецФункции



#Область РаботаСТехнологическимЖурналом



// Включает технологический журнал.

//

Процедура ВключениеТехнологическогоЖурнала(ПараметрыТехнологическогоЖурнала, РезультатВключения) Экспорт

	

	ИнформационнаяБазаФайловая = ИнформационнаяБазаФайловая();

	ВерсияПлатформы = ВерсияПлатформы();

	КаталогКонфигурацииПриложения = ПутьККонфигурационномуФайлу();

	

	Если КаталогКонфигурацииПриложения <> Неопределено Тогда

	

		ПараметрыФайлаКонфигурации = Новый Структура;

		ПараметрыФайлаКонфигурации.Вставить("КаталогКонфигурацииПриложения", КаталогКонфигурацииПриложения);

		ПараметрыФайлаКонфигурации.Вставить("КаталогСЛогФайлами", Неопределено);

		ПараметрыФайлаКонфигурации.Вставить("ФайлКонфигурации", Неопределено);

		ПараметрыФайлаКонфигурации.Вставить("Поток", Неопределено);

		

		СтруктураФайлаКонфигурации = Новый Структура;

		

		ПрочитатьКонфигурациюИзФайла(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации);

		ИзменитьКонфигурациюВключениеТЖ(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации);

		ЗаписатьКонфигурациюВФайл(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации, РезультатВключения, Истина);

		

		ЗаполнитьЗначенияСвойств(ПараметрыТехнологическогоЖурнала, ПараметрыФайлаКонфигурации, "КаталогСЛогФайлами");

		ПараметрыТехнологическогоЖурнала.ИдентификаторПроцессаОС = Формат(ИдентификаторПроцессаОС(), "ЧРД=; ЧРГ=; ЧГ=0");

	

	КонецЕсли;

	

КонецПроцедуры



Функция ПутьККонфигурационномуФайлу()

	

	СистемнаяИнформация = Новый СистемнаяИнформация();

	Если НЕ ((СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86) Или (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64)) Тогда

		Возврат Неопределено;

	КонецЕсли;

	

	КаталогаОбщихКонфигурационныхФайлов = КаталогПрограммы() + "conf";

	ФайлУказатель = Новый Файл(КаталогаОбщихКонфигурационныхФайлов + ПолучитьРазделительПутиСервера() + "conf.cfg");

	Если ФайлУказатель.Существует() Тогда

		ФайлКонфигурации = Новый ЧтениеТекста(ФайлУказатель.ПолноеИмя);

		Строка = ФайлКонфигурации.ПрочитатьСтроку();

		Пока Строка <> Неопределено Цикл

			Позиция = СтрНайти(Строка, "ConfLocation=");

			Если Позиция > 0 Тогда 

				КаталогКонфигурацииПриложения = СокрЛП(Сред(Строка, Позиция + 13));

				Прервать;

			КонецЕсли;

			Строка = ФайлКонфигурации.ПрочитатьСтроку();

		КонецЦикла;

	КонецЕсли;

	

	Возврат КаталогКонфигурацииПриложения;

	

КонецФункции



// Выключает технологический журнал.

//

Процедура ВыключениеТехнологическогоЖурнала(ПараметрыВыключенияТЖ, ИзменятьФайлКонфигурации = Истина) Экспорт

	

	ИнформационнаяБазаФайловая = ИнформационнаяБазаФайловая();

	ВерсияПлатформы = ВерсияПлатформы();

	КаталогКонфигурацииПриложения = ПутьККонфигурационномуФайлу();

	

	ПараметрыФайлаКонфигурации = Новый Структура;

	ПараметрыФайлаКонфигурации.Вставить("КаталогКонфигурацииПриложения", КаталогКонфигурацииПриложения);

	ПараметрыФайлаКонфигурации.Вставить("КаталогСЛогФайлами", ПараметрыВыключенияТЖ.КаталогСЛогФайлами);

	ПараметрыФайлаКонфигурации.Вставить("ФайлКонфигурации", Неопределено);

	ПараметрыФайлаКонфигурации.Вставить("Поток", Неопределено);

	

	СтруктураФайлаКонфигурации = Новый Структура;

	

	ПрочитатьКонфигурациюИзФайла(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации);

	Если ИзменятьФайлКонфигурации Тогда

		ИзменитьКонфигурациюВыключениеТЖ(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации);

	КонецЕсли; 

	РезультатВыключения = Новый Структура();

	ЗаписатьКонфигурациюВФайл(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации, РезультатВыключения, ИзменятьФайлКонфигурации);

	

	ЗаполнитьЗначенияСвойств(ПараметрыВыключенияТЖ, СтруктураФайлаКонфигурации, 

		"РеестрВключенныхКаталогов, РеестрУдаленныхКаталогов");

	

КонецПроцедуры



Процедура ПрочитатьКонфигурациюИзФайла(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации)

	

	СтруктураФайлаКонфигурации.Вставить("БлокиКонфигурации", Новый Массив);

	СтруктураФайлаКонфигурации.Вставить("КоличествоБлоковКонсоли", 0);

	СтруктураФайлаКонфигурации.Вставить("ЕстьPlanSql", Ложь);

	СтруктураФайлаКонфигурации.Вставить("ШаблоныТеговКонсоли", ШаблоныТеговКонсоли());

	

	Если ПараметрыФайлаКонфигурации.КаталогКонфигурацииПриложения <> Неопределено Тогда

		

		ПараметрыФайлаКонфигурации.ФайлКонфигурации = Новый Файл(ПараметрыФайлаКонфигурации.КаталогКонфигурацииПриложения

			+ ПолучитьРазделительПути() + "logcfg.xml");

		

		Если ПараметрыФайлаКонфигурации.ФайлКонфигурации.Существует() Тогда

			

			ПараметрыФайлаКонфигурации.Поток = Новый ЧтениеТекста(ПараметрыФайлаКонфигурации.ФайлКонфигурации.ПолноеИмя);

			

			ПараметрыТекста = Новый Структура;

			ПараметрыТекста.Вставить("ТекстФайлаКонфигурации", ПараметрыФайлаКонфигурации.Поток);

			ПараметрыТекста.Вставить("СтрокаТега", "");

			ПараметрыТекста.Вставить("НачальнаяСтрокаБлока", "");

			ПараметрыТекста.Вставить("ТекстБлока", "");

			ПараметрыТекста.Вставить("ТекущаяСтрока", "");

			

			Пока Истина Цикл

				Если ПрочитатьТекстДоТега(ПараметрыТекста, СтруктураФайлаКонфигурации.ШаблоныТеговКонсоли.ОткрывающийНачало) Тогда

					ДобавитьБлокВСтруктуруКонфигурации(СтруктураФайлаКонфигурации, ПараметрыТекста, Ложь);

					ПараметрыТекста.СтрокаТега = ПараметрыТекста.ТекущаяСтрока;

					

					Если ПрочитатьТекстДоТега(ПараметрыТекста, СтруктураФайлаКонфигурации.ШаблоныТеговКонсоли.Закрывающий, Истина) Тогда

						ДобавитьБлокВСтруктуруКонфигурации(СтруктураФайлаКонфигурации, ПараметрыТекста, Истина);

					Иначе

						ДобавитьБлокВСтруктуруКонфигурации(СтруктураФайлаКонфигурации, ПараметрыТекста, Ложь);

						Прервать;

					КонецЕсли;

				Иначе

					// В конфигурационном файле нет ни одного блока консоли

					ДобавитьБлокВСтруктуруКонфигурации(СтруктураФайлаКонфигурации, ПараметрыТекста, Ложь);

					Прервать;

				КонецЕсли;

			КонецЦикла;

			

			ПараметрыФайлаКонфигурации.Поток.Закрыть();

			

		КонецЕсли;

		

	КонецЕсли;

	

	Для каждого БлокКонфигурации Из СтруктураФайлаКонфигурации.БлокиКонфигурации Цикл

		

		// Получение реестра каталогов ТЖ для каждого блока конфигурации

		Попытка

			

			ЧтениеXML = Новый ЧтениеXML;

			ЧтениеXML.УстановитьСтроку(БлокКонфигурации.Текст);

			ЧтениеXML.Прочитать();

			ПостроительDOM = Новый ПостроительDOM;

			УзелЛог = ПостроительDOM.Прочитать(ЧтениеXML);

			ЧтениеXML.Закрыть();

			

		Исключение

			

			ТекстОшибки = СтрЗаменить(НСтр("ru = 'Не удалось прочитать конфигурационный файл logcfg.xml по причине: %1'"),

				"%1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

			

			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);

			Возврат;

			

		КонецПопытки;

		

		СобратьКаталогиТЖПоУзламКонфигурации(УзелЛог, УзелЛог, БлокКонфигурации.РеестрКаталоговТЖ);

		

		// Наличие тега включения плана запроса

		Если НЕ СтруктураФайлаКонфигурации.ЕстьPlanSql Тогда

			Если СтрНайти(БлокКонфигурации.Текст, "<plansql/>") > 0 Тогда

				СтруктураФайлаКонфигурации.ЕстьPlanSql = Истина;

			КонецЕсли;

		КонецЕсли;

		

	КонецЦикла;

	

КонецПроцедуры



Процедура ДобавитьБлокВСтруктуруКонфигурации(СтруктураФайлаКонфигурации, ПараметрыТекста, ЭтоБлокКонсоли)

	

	БлокКонфигурации = Новый Структура;

	БлокКонфигурации.Вставить("ЭтоБлокКонсоли", ЭтоБлокКонсоли);

	БлокКонфигурации.Вставить("Удалить", Ложь);

	БлокКонфигурации.Вставить("Текст", ПараметрыТекста.ТекстБлока);

	БлокКонфигурации.Вставить("ИдентификаторИБ");

	БлокКонфигурации.Вставить("ДатаВремя");

	БлокКонфигурации.Вставить("РеестрКаталоговТЖ", Новый Массив);

	

	Если ПустаяСтрока(ПараметрыТекста.ТекстБлока) Тогда

		Возврат;

	КонецЕсли;

	

	Если ЭтоБлокКонсоли Тогда

		

		// Расшифровка тега

		

		ШаблоныТеговКонсоли = СтруктураФайлаКонфигурации.ШаблоныТеговКонсоли;

		

		СтрокаТега = СокрЛП(ПараметрыТекста.СтрокаТега);

		СтрокаТега = СокрЛП(Сред(СтрокаТега, СтрДлина(ШаблоныТеговКонсоли.ОткрывающийНачало) + 1));

		ПозицияРазделителя = СтрНайти(СтрокаТега, "SRVR");

		Если ПозицияРазделителя = 0 Тогда

			ПозицияРазделителя = СтрНайти(СтрокаТега, "FILE");

		КонецЕсли;

		Если ПозицияРазделителя > 1 Тогда

			СтрокаТегаДатаВремя = СокрЛП(Лев(СтрокаТега, ПозицияРазделителя - 1));

			Попытка

				БлокКонфигурации.Вставить("ДатаВремя", Дата(СтрокаТегаДатаВремя));

			Исключение

				БлокКонфигурации.Вставить("ДатаВремя");

			КонецПопытки;

			

			СтрокаТега = СокрЛП(Сред(СтрокаТега, ПозицияРазделителя));

			ПозицияРазделителя = СтрНайти(СтрокаТега, ШаблоныТеговКонсоли.ОткрывающийОкончание);

			Если ПозицияРазделителя > 1 Тогда

				БлокКонфигурации.Вставить("ИдентификаторИБ", СокрЛП(Лев(СтрокаТега, ПозицияРазделителя-1)));

			КонецЕсли;

		Иначе

			СтрокаТегаДатаВремя = СтрокаТега;

		КонецЕсли;

		

		// Получение каталога ТЖ

		СтрокаКаталогаXML = Новый ЧтениеXML;

		СтрокаКаталогаXML.УстановитьСтроку(ПараметрыТекста.НачальнаяСтрокаБлока);

		СтрокаКаталогаXML.Прочитать();

		БлокКонфигурации.Вставить("КаталогТЖ", СтрокаКаталогаXML.ПолучитьАтрибут("location"));

		

		СтруктураФайлаКонфигурации.БлокиКонфигурации.Добавить(БлокКонфигурации);

		СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли = СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли + 1;

		

	Иначе

		

		// Все части конфигурационного файла, не являющиеся блоками консоли, объединяем в один блок

		ЕстьБлокНеКонсоли = Ложь;

		Для каждого ИмеющийсяБлок Из СтруктураФайлаКонфигурации.БлокиКонфигурации Цикл

			Если НЕ ИмеющийсяБлок.ЭтоБлокКонсоли Тогда

				ЕстьБлокНеКонсоли = Истина;

				Прервать;

			КонецЕсли;

		КонецЦикла;

		

		Если ЕстьБлокНеКонсоли Тогда

			ИмеющийсяБлок.Текст = ИмеющийсяБлок.Текст + ?(ИмеющийсяБлок.Текст = "", "", Символы.ПС) + ПараметрыТекста.ТекстБлока;

		Иначе

			СтруктураФайлаКонфигурации.БлокиКонфигурации.Добавить(БлокКонфигурации);

		КонецЕсли;

		

	КонецЕсли;

	

КонецПроцедуры



// Параметры:

//   КонфигурацияТехЖурнала - ДокументDOM

//                          - ДокументHTML

//   ТекущийУзел - УзелHTML

//               - ДокументDOM

//               - ДокументHTML

//               - УзелDOM

//   КаталогиТЖ - Массив

//

Процедура СобратьКаталогиТЖПоУзламКонфигурации(КонфигурацияТехЖурнала, ТекущийУзел, КаталогиТЖ)



	Для Каждого Узел Из ТекущийУзел.ДочерниеУзлы Цикл

		

		Если Узел.ИмяУзла = "#document" Или Узел.ИмяУзла = "config" Тогда

			СобратьКаталогиТЖПоУзламКонфигурации(КонфигурацияТехЖурнала, Узел, КаталогиТЖ);

		КонецЕсли;

		

		Если Узел.ИмяУзла = "log" Тогда

			

			КаталогТЖ = Узел.ПолучитьАтрибут("location");

			Если КаталогТЖ <> Неопределено Тогда

				КаталогиТЖ.Добавить(СокрЛП(КаталогТЖ));

			КонецЕсли;

			

		КонецЕсли;

		

	КонецЦикла;

	

КонецПроцедуры



Функция ПрочитатьТекстДоТега(ПараметрыТекста, ШаблонТега, ВключатьТеги = Ложь)



	ДлинаШаблона = СтрДлина(ШаблонТега);

	ПараметрыТекста.ТекстБлока = "";

	Если ВключатьТеги Тогда

		ПараметрыТекста.ТекстБлока = ПараметрыТекста.ТекущаяСтрока;

	КонецЕсли; 

	ПараметрыТекста.НачальнаяСтрокаБлока = "";

	ЭтоПерваяСтрокаБлока = Истина;

	ПараметрыТекста.ТекущаяСтрока = ПараметрыТекста.ТекстФайлаКонфигурации.ПрочитатьСтроку();

	

	Пока ПараметрыТекста.ТекущаяСтрока <> Неопределено Цикл

		

		Если СтрНайти(НРег(ПараметрыТекста.ТекущаяСтрока), "</config>") > 0 Тогда

			ПараметрыТекста.ТекстБлока = ПараметрыТекста.ТекстБлока

				+ ?(ПараметрыТекста.ТекстБлока = "", "", Символы.ПС) + ПараметрыТекста.ТекущаяСтрока;

			Возврат Ложь;

		КонецЕсли;

		

		Если ЭтоПерваяСтрокаБлока Тогда

			ПараметрыТекста.НачальнаяСтрокаБлока = ПараметрыТекста.ТекущаяСтрока;

			ЭтоПерваяСтрокаБлока = Ложь;

		КонецЕсли;

		

		Если Лев(СокрЛП(ПараметрыТекста.ТекущаяСтрока), ДлинаШаблона) = ШаблонТега Тогда

			Если ВключатьТеги Тогда

				ПараметрыТекста.ТекстБлока = ПараметрыТекста.ТекстБлока

					+ ?(ПараметрыТекста.ТекстБлока = "", "", Символы.ПС) + ПараметрыТекста.ТекущаяСтрока;

			КонецЕсли;

			Прервать;

		КонецЕсли;

		

		ПараметрыТекста.ТекстБлока = ПараметрыТекста.ТекстБлока

			+ ?(ПараметрыТекста.ТекстБлока = "", "", Символы.ПС) + ПараметрыТекста.ТекущаяСтрока;

			

		ПараметрыТекста.ТекущаяСтрока = ПараметрыТекста.ТекстФайлаКонфигурации.ПрочитатьСтроку();

		

	КонецЦикла;

	

	Если ПараметрыТекста.ТекущаяСтрока = Неопределено Тогда

		Возврат Ложь;

	КонецЕсли;

	

	Возврат Истина;



КонецФункции



Процедура ЗаписатьКонфигурациюВФайл(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации, РезультатВключения, Записывать)

	

	СтруктураФайлаКонфигурации.Вставить("РеестрВключенныхКаталогов", Новый Массив);

	СтруктураФайлаКонфигурации.Вставить("РеестрУдаленныхКаталогов", Новый Массив);

	

	Если Записывать Тогда

	

		ЕстьPlanSql = Ложь;

		Для каждого БлокКонфигурации Из СтруктураФайлаКонфигурации.БлокиКонфигурации Цикл

			Если БлокКонфигурации.Удалить Тогда

				Продолжить;

			КонецЕсли;

			Если СтрНайти(БлокКонфигурации.Текст, "<plansql/>") > 0 Тогда

				ЕстьPlanSql = Истина;

				Прервать;

			КонецЕсли;

		КонецЦикла;

		

		ТекстФайлаКонфигурации = "";

		ТекстБлокаНеКонсоли = "";

		

		ТекстФайлаКонфигурации = "";

		Для каждого БлокКонфигурации Из СтруктураФайлаКонфигурации.БлокиКонфигурации Цикл

			

			Если БлокКонфигурации.ЭтоБлокКонсоли

				 И БлокКонфигурации.Удалить Тогда

				Для каждого КаталогТЖ Из БлокКонфигурации.РеестрКаталоговТЖ Цикл

					СтруктураФайлаКонфигурации.РеестрУдаленныхКаталогов.Добавить(ВРег(КаталогТЖ));

				КонецЦикла;

			ИначеЕсли БлокКонфигурации.ЭтоБлокКонсоли Тогда

				СтруктураФайлаКонфигурации.РеестрВключенныхКаталогов.Добавить(ВРег(БлокКонфигурации.КаталогТЖ));

				ТекстФайлаКонфигурации = ТекстФайлаКонфигурации + ?(ТекстФайлаКонфигурации = "", "", Символы.ПС)

				 + БлокКонфигурации.Текст;

			Иначе

				Для каждого КаталогТЖ Из БлокКонфигурации.РеестрКаталоговТЖ Цикл

					СтруктураФайлаКонфигурации.РеестрВключенныхКаталогов.Добавить(ВРег(КаталогТЖ));

				КонецЦикла;

				ТекстБлокаНеКонсоли = БлокКонфигурации.Текст;

			КонецЕсли;

			

			Если НЕ БлокКонфигурации.Удалить

				 И НЕ ЕстьPlanSql

				 И СтрНайти(БлокКонфигурации.Текст, "<plansql/>") > 0 Тогда

				ЕстьPlanSql = Истина;

			КонецЕсли;

			

		КонецЦикла;

		

		Если НЕ ЕстьPlanSql

			 И СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли > 0 Тогда

			БлокPlanSql = СтруктураФайлаКонфигурации.ШаблоныТеговКонсоли.ОткрывающийНачало + " -->" + Символы.ПС

				+ "<plansql/>" + Символы.ПС

				+ СтруктураФайлаКонфигурации.ШаблоныТеговКонсоли.Закрывающий + " -->";

			ТекстФайлаКонфигурации = ТекстФайлаКонфигурации + ?(ТекстФайлаКонфигурации = "", "", Символы.ПС) + БлокPlanSql;

		КонецЕсли;

		

		Если НЕ ПустаяСтрока(ТекстФайлаКонфигурации) Тогда

			ТекстФайлаКонфигурации = СтрЗаменить(ТекстБлокаНеКонсоли, "</config>", ТекстФайлаКонфигурации + Символы.ПС + "</config>");

		Иначе

			ТекстФайлаКонфигурации = ТекстБлокаНеКонсоли;

		КонецЕсли;

		

		Попытка

			

			ПараметрыФайлаКонфигурации.Поток = Новый ЗаписьТекста(ПараметрыФайлаКонфигурации.ФайлКонфигурации.ПолноеИмя);

			ПараметрыФайлаКонфигурации.Поток.ЗаписатьСтроку(ТекстФайлаКонфигурации);

			ПараметрыФайлаКонфигурации.Поток.Закрыть();

			

		Исключение

			РезультатВключения.Вставить("Результат", Ложь);

			РезультатВключения.Вставить("Причина", НСтр("ru = 'Ошибка записи конфигурационного файла в каталоге'") + " "

				+ ПараметрыФайлаКонфигурации.КаталогКонфигурацииПриложения + Символы.ПС + НСтр("ru = 'Проверьте права доступа.'"));

		КонецПопытки;

		

	Иначе

		

		Для каждого БлокКонфигурации Из СтруктураФайлаКонфигурации.БлокиКонфигурации Цикл

			Если БлокКонфигурации.ЭтоБлокКонсоли Тогда

				СтруктураФайлаКонфигурации.РеестрВключенныхКаталогов.Добавить(ВРег(БлокКонфигурации.КаталогТЖ));

			Иначе

				Для каждого КаталогТЖ Из БлокКонфигурации.РеестрКаталоговТЖ Цикл

					СтруктураФайлаКонфигурации.РеестрВключенныхКаталогов.Добавить(ВРег(КаталогТЖ));

				КонецЦикла;

			КонецЕсли;

		КонецЦикла;

	

	КонецЕсли;

	

КонецПроцедуры



Функция ШаблоныТеговКонсоли(ИдентификаторИБ = "")

	

	Результат = Новый Структура;

	Результат.Вставить("ОткрывающийНачало", "<!-- ConsoleQueriesBegin");

	Результат.Вставить("ОткрывающийОкончание", "-->");

	Результат.Вставить("Закрывающий", "<!-- ConsoleQueriesEnd");

	

	Возврат Результат;

	

КонецФункции



Процедура ИзменитьКонфигурациюВключениеТЖ(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации)



	ФильтрТекущегоСеанса = ФильтрТекущегоСеанса();

	

	Если ПараметрыФайлаКонфигурации.КаталогКонфигурацииПриложения <> Неопределено 

		 И ПараметрыФайлаКонфигурации.ФайлКонфигурации.Существует() Тогда

		// Изменение существующего файла конфигурации

		

		БлокКонфигурацииТекущегоСеанса = Неопределено;

		Для каждого БлокКонфигурации Из СтруктураФайлаКонфигурации.БлокиКонфигурации Цикл

		

			Если НЕ БлокКонфигурации.ЭтоБлокКонсоли Тогда

				Продолжить;

			КонецЕсли;

			

			Если БлокКонфигурации.ИдентификаторИБ = ФильтрТекущегоСеанса.ИдентификаторИБ Тогда

				БлокКонфигурацииТекущегоСеанса = БлокКонфигурации;

			КонецЕсли;

		

		КонецЦикла;

		

		Если БлокКонфигурацииТекущегоСеанса = Неопределено Тогда

			

			БлокКонфигурацииТекущегоСеанса = БлокКонфигурацииСеанса(ФильтрТекущегоСеанса, СтруктураФайлаКонфигурации.ШаблоныТеговКонсоли);

			СтруктураФайлаКонфигурации.БлокиКонфигурации.Добавить(БлокКонфигурацииТекущегоСеанса);

			СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли = СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли + 1;

			

		Иначе

			// Изменяем найденный блок конфигурации

			ТекстБлокаКонфигурации = БлокКонфигурацииТекущегоСеанса.Текст;

			

			ЧтениеXML = Новый ЧтениеXML;

			ТекстБлокаКонфигурации = СтрЗаменить(ТекстБлокаКонфигурации,"<property name=""all""/>","");

			ТекстБлокаКонфигурации = СтрЗаменить(ТекстБлокаКонфигурации,"<property name=""sql""/>","");

			ТекстБлокаКонфигурации = СтрЗаменить(ТекстБлокаКонфигурации,"<property name=""plansqltext""/>","");

			ТекстБлокаКонфигурации = СтрЗаменить(ТекстБлокаКонфигурации,"<plansql/>","");

			ЧтениеXML.УстановитьСтроку(ТекстБлокаКонфигурации);

			

			ПостроительDOM = Новый ПостроительDOM;

			УзелЛог = ПостроительDOM.Прочитать(ЧтениеXML);

			ЧтениеXML.Закрыть();

			

			ПараметрыОбработкиКонфигурации = ПараметрыОбработкиКонфигурационногоФайла();

			ПараметрыОбработкиКонфигурации.ЗаменитьФильтры = Истина;

			

			ОбойтиУзлыКонфигурацииТехЖурнала(УзелЛог, УзелЛог, ФильтрТекущегоСеанса, ПараметрыОбработкиКонфигурации);

			

			ЗаписьDOM = Новый ЗаписьDOM;

			ЗаписьXML = Новый ЗаписьXML;

			ЗаписьXML.УстановитьСтроку();

			ЗаписьDOM.Записать(УзелЛог, ЗаписьXML);

			БлокКонфигурацииТекущегоСеанса.Текст = ЗаписьXML.Закрыть();

			Тэг = ТэгТекущегоСеанса(СтруктураФайлаКонфигурации.ШаблоныТеговКонсоли, ФильтрТекущегоСеанса);

			БлокКонфигурацииТекущегоСеанса.Текст = СтрЗаменить(БлокКонфигурацииТекущегоСеанса.Текст, "<?xml version=""1.0""?>", Тэг);

			

		КонецЕсли;

		

		ПараметрыФайлаКонфигурации.Вставить("КаталогСЛогФайлами", БлокКонфигурацииТекущегоСеанса.КаталогТЖ);

		

	Иначе

		СоздатьНовуюКонфигурацию(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации, ФильтрТекущегоСеанса);

	КонецЕсли;

	

КонецПроцедуры



Функция ТэгТекущегоСеанса(ШаблоныТегов, ФильтрТекущегоСеанса)

	

	Возврат ШаблоныТегов.ОткрывающийНачало + " " + Формат(ФильтрТекущегоСеанса.ДатаВремя, "dd.MM.yyyy hh:mm:ss") + " "

		+ ФильтрТекущегоСеанса.ИдентификаторИБ + " " + ШаблоныТегов.ОткрывающийОкончание;

	

КонецФункции



Функция БлокКонфигурацииСеанса(ФильтрТекущегоСеанса, ШаблоныТегов)



	МассивСобытий = МассивСобытийКонсолиЗапросов(ИнформационнаяБазаФайловая);

	

	Текст = ТэгТекущегоСеанса(ШаблоныТегов, ФильтрТекущегоСеанса) + Символы.ПС;

	КаталогСЛогФайлами = ПолучитьИмяВременногоФайла("1c_logs");

	Текст = Текст + "<log history=""2"" location=""" + КаталогСЛогФайлами + """>" + Символы.ПС;

	Для каждого ЗначениеСобытия Из МассивСобытий Цикл

		

		Если ИнформационнаяБазаФайловая Тогда

			Если ВерсияПриложенияЧисло(ВерсияПлатформы) >= ВерсияПриложенияЧисло("8.3.14") Тогда

				Если ЗначениеСобытия = "SDBL" Тогда

					ТекстФильтров = "  <eq property=""DBMS"" value=""DBV8DBEng""/>" + Символы.ПС

						+ "  <eq property=""DataBase"" value=""" + ФильтрТекущегоСеанса.DataBase + """/>" + Символы.ПС;

				ИначеЕсли ЗначениеСобытия = "DBV8DBEng" Тогда

					ТекстФильтров = "  <eq property=""DataBase"" value=""" + ФильтрТекущегоСеанса.DataBase + """/>" + Символы.ПС;

				ИначеЕсли ЗначениеСобытия = "EXCP" Тогда

					ТекстФильтров = "  <eq property=""DataBase"" value=""" + ФильтрТекущегоСеанса.DataBase + """/>" + Символы.ПС;

				КонецЕсли;

			Иначе

				ТекстФильтров = "";

			КонецЕсли;

		Иначе

			ТекстФильтров = "  <eq property=""p:processName"" value=""" + ФильтрТекущегоСеанса.processname + """/>" + Символы.ПС

				+ "  <eq property=""usr"" value=""" + ФильтрТекущегоСеанса.usr + """/>" + Символы.ПС

				+ "  <eq property=""sessionid"" value=""" + ФильтрТекущегоСеанса.sessionid + """/>" + Символы.ПС;

		КонецЕсли;

		

		Текст = Текст  + "<event>" + Символы.ПС + "  <eq property=""name"" value=""" + ЗначениеСобытия + """/>" + Символы.ПС

			+ ТекстФильтров + "</event>" + Символы.ПС;

	КонецЦикла;

	

	Текст = Текст + "<property name=""all""/>" + Символы.ПС + "  <property name=""sql""/>" + Символы.ПС

		+ "  <property name=""plansqltext""/>" + Символы.ПС + "</log>" + Символы.ПС;

	Текст = Текст + ШаблоныТегов.Закрывающий + " " + ШаблоныТегов.ОткрывающийОкончание;

	

	Результат = Новый Структура;

	Результат.Вставить("ЭтоБлокКонсоли", Истина);

	Результат.Вставить("Удалить", Ложь);

	Результат.Вставить("ИдентификаторИБ", ФильтрТекущегоСеанса.ИдентификаторИБ);

	Результат.Вставить("ДатаВремя", ФильтрТекущегоСеанса.ДатаВремя);

	Результат.Вставить("КаталогТЖ", КаталогСЛогФайлами);

	Результат.Вставить("Текст", Текст);

	Результат.Вставить("Текст", Текст);

	Результат.Вставить("РеестрКаталоговТЖ", Новый Массив);

	

	Возврат Результат;

	

КонецФункции



Процедура СоздатьНовуюКонфигурацию(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации, ФильтрТекущегоСеанса)

	

	СтруктураФайлаКонфигурации.БлокиКонфигурации.Очистить();

	СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли = 0;

	

	// Начальный блок конфигурации

	ТекстБлокаКонфигурации = "<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС+ "<config xmlns=""http://v8.1c.ru/v8/tech-log"">"

		+ Символы.ПС + "<dump create=""false"" type=""0"" prntscrn=""false""/>" + Символы.ПС + "</config>";

	

	БлокКонфигурации = Новый Структура;

	БлокКонфигурации.Вставить("ЭтоБлокКонсоли", Ложь);

	БлокКонфигурации.Вставить("Удалить", Ложь);

	БлокКонфигурации.Вставить("ИдентификаторИБ", Неопределено);

	БлокКонфигурации.Вставить("ДатаВремя", Неопределено);

	БлокКонфигурации.Вставить("КаталогТЖ", Неопределено);

	БлокКонфигурации.Вставить("Текст", ТекстБлокаКонфигурации);

	БлокКонфигурации.Вставить("РеестрКаталоговТЖ", Новый Массив);

	

	СтруктураФайлаКонфигурации.БлокиКонфигурации.Добавить(БлокКонфигурации);

	

	// Блок текущего сеанса

	БлокКонфигурации = БлокКонфигурацииСеанса(ФильтрТекущегоСеанса, СтруктураФайлаКонфигурации.ШаблоныТеговКонсоли);

	СтруктураФайлаКонфигурации.БлокиКонфигурации.Добавить(БлокКонфигурации);

	СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли = СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли + 1;

	ПараметрыФайлаКонфигурации.Вставить("КаталогСЛогФайлами", БлокКонфигурации.КаталогТЖ);

	

КонецПроцедуры



Процедура ИзменитьКонфигурациюВыключениеТЖ(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации)

	

	ВремяЖизниБлокаМакс = 7200;

	

	ФильтрТекущегоСеанса = ФильтрТекущегоСеанса();

	

	Если ПараметрыФайлаКонфигурации.КаталогКонфигурацииПриложения <> Неопределено

		 И ПараметрыФайлаКонфигурации.ФайлКонфигурации.Существует() Тогда

		

		БлокКонфигурацииТекущегоСеанса = Неопределено;

		Для каждого БлокКонфигурации Из СтруктураФайлаКонфигурации.БлокиКонфигурации Цикл

		

			Если НЕ БлокКонфигурации.ЭтоБлокКонсоли Тогда

				Продолжить;

			КонецЕсли;

			

			БлокПросрочен = Истина;

			Если ТипЗнч(БлокКонфигурации.ДатаВремя) = Тип("Дата") Тогда

				БлокПросрочен = ФильтрТекущегоСеанса.ДатаВремя - БлокКонфигурации.ДатаВремя > ВремяЖизниБлокаМакс;

			КонецЕсли;

			

			Если БлокПросрочен Тогда

				БлокКонфигурации.Удалить = Истина;

				СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли = СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли - 1;

				Продолжить;

			КонецЕсли;

		

			Если БлокКонфигурации.ИдентификаторИБ = ФильтрТекущегоСеанса.ИдентификаторИБ Тогда

				БлокКонфигурацииТекущегоСеанса = БлокКонфигурации;

			КонецЕсли;

			

		КонецЦикла;

		

		Если БлокКонфигурацииТекущегоСеанса <> Неопределено Тогда

			

			ТекстБлокаКонфигурации = БлокКонфигурацииТекущегоСеанса.Текст;

			

			ЧтениеXML = Новый ЧтениеXML;

			ТекстБлокаКонфигурации = СтрЗаменить(ТекстБлокаКонфигурации,"<plansql/>","");

			ЧтениеXML.УстановитьСтроку(ТекстБлокаКонфигурации);

			

			ПостроительDOM = Новый ПостроительDOM;

			УзелКонсолиЗапросов = ПостроительDOM.Прочитать(ЧтениеXML);

			ЧтениеXML.Закрыть();

			

			УзлыКУдалению = Новый Массив;

			КоличествоEvent = 0;

			НайтиУзлыКУдалению(УзелКонсолиЗапросов,ФильтрТекущегоСеанса, УзлыКУдалению, КоличествоEvent);

			

			Если КоличествоEvent = УзлыКУдалению.Количество() Тогда

				БлокКонфигурацииТекущегоСеанса.Удалить = Истина;

				СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли = СтруктураФайлаКонфигурации.КоличествоБлоковКонсоли - 1;

			Иначе

				Для Каждого Event Из УзлыКУдалению Цикл

					Event.РодительскийУзел.УдалитьДочерний(Event);

				КонецЦикла;

				

				ЗаписьDOM = Новый ЗаписьDOM;

				ЗаписьXML = Новый ЗаписьXML;

				ЗаписьXML.УстановитьСтроку();

				ЗаписьDOM.Записать(УзелКонсолиЗапросов, ЗаписьXML);

				БлокКонфигурацииТекущегоСеанса.Текст = ЗаписьXML.Закрыть();

				Тэг = ТэгТекущегоСеанса(СтруктураФайлаКонфигурации.ШаблоныТеговКонсоли, ФильтрТекущегоСеанса);

				БлокКонфигурацииТекущегоСеанса.Текст = СтрЗаменить(БлокКонфигурацииТекущегоСеанса.Текст, "<?xml version=""1.0""?>", Тэг);

			КонецЕсли;

			

		КонецЕсли;

		

	КонецЕсли;

	

КонецПроцедуры



// Находит в файле технологического журнала запрос и план выполнения запроса.

//

Процедура ПрочитатьТехнологическийЖурнал(ПутьКФайлу, ИДМетки, ПрочитанныеДанные) Экспорт

	

	МассивСтрок = Новый Массив;

	ДобавлятьВМассив = Ложь;

	

	ВременныйФайл = ПолучитьИмяВременногоФайла(".log");

	КопироватьФайл(ПутьКФайлу, ВременныйФайл);

	

	Файл = Новый ЧтениеТекста();

	Файл.Открыть(ВременныйФайл);

	Строка = Файл.ПрочитатьСтроку();

	ВременнаяСтрока = "";

	Пока Строка <> Неопределено Цикл

		Если ДобавлятьВМассив Тогда 

			Если ДобавлятьВМассив И СтрНайти(Строка, ИДМетки + "_end") = 0 Тогда

				Если Сред(Строка, 3, 1) = ":" И Сред(Строка, 6, 1) = "." Тогда

					Если ЗначениеЗаполнено(ВременнаяСтрока) 

						И СтрНайти(ВременнаяСтрока, "Sql=") > 0

						И СтрНайти(ВременнаяСтрока, "planSQLText=") > 0 

						И СтрНайти(ВременнаяСтрока, "Marker_" + ИДМетки) = 0 Тогда

						МассивСтрок.Добавить(ВременнаяСтрока);	

					КонецЕсли;

					ВременнаяСтрока = Строка;

				Иначе

					ВременнаяСтрока = ВременнаяСтрока + Символы.ПС + Строка;

				КонецЕсли;

				Иначе

					Прервать;

			КонецЕсли;

		КонецЕсли;

		

		Если СтрНайти(Строка, ИДМетки + "_begin") > 0 Тогда

			ДобавлятьВМассив = Истина;

		КонецЕсли;

		Строка = Файл.ПрочитатьСтроку();

	КонецЦикла;

	Файл.Закрыть();

	

	СКЛТекстИзТехЖурнала = "";

	ПланВыполненияЗапроса = "";

	

	Если МассивСтрок.Количество() > 1 Тогда

		Разделитель = Символы.ПС +  Символы.ПС;

	Иначе

		Разделитель = "";

	КонецЕсли;

	

	Для каждого Строка Из МассивСтрок Цикл

		ПозицияНачало = СтрНайти(Строка, ",");

		СтрокаСдвиг = Сред(Строка, ПозицияНачало + 1);

		ПозицияКонец = СтрНайти(СтрокаСдвиг, ",");

		ТипСУБД = ВРег(Лев(СтрокаСдвиг, ПозицияКонец -1));

		Позиция = СтрНайти(СтрокаСдвиг, "Sql=");

		Если Сред(СтрокаСдвиг, Позиция + 4, 1) = """" ИЛИ Сред(СтрокаСдвиг, Позиция + 4, 1) = "'" Тогда

			СтрокаСдвиг = Сред(СтрокаСдвиг, Позиция + 5);

		Иначе

			СтрокаСдвиг = Сред(СтрокаСдвиг, Позиция + 4);

		КонецЕсли;

		

		Если ТипСУБД = "DBMSSQL" Тогда 

			Позиция = СтрНайти(СтрокаСдвиг, ",Rows");

			СКЛТекстТекущийЗапрос = Лев(СтрокаСдвиг, Позиция-2);

			Позиция = СтрНайти(СтрокаСдвиг, "planSQLText=");

			СтрокаСдвиг = Сред(СтрокаСдвиг, Позиция + 13);

			Позиция = СтрНайти(СтрокаСдвиг, "'");

			ПланВыполненияЗапросаТекущийЗапрос = Лев(СтрокаСдвиг, Позиция-1);

		ИначеЕсли ТипСУБД = "DBPOSTGRS" Тогда 

			Позиция = СтрНайти(СтрокаСдвиг, ",planSQLText=");

			СКЛТекстТекущийЗапрос = Лев(СтрокаСдвиг, Позиция-1);

			СтрокаСдвиг = Сред(СтрокаСдвиг, Позиция + 13);

			Позиция = СтрНайти(СтрокаСдвиг, ",Result");

			ПланВыполненияЗапросаТекущийЗапрос = Лев(СтрокаСдвиг, Позиция-1);

		Иначе

			Позиция = СтрНайти(СтрокаСдвиг, "',");	

			СКЛТекстТекущийЗапрос = Лев(СтрокаСдвиг, Позиция-2);

			Позиция = СтрНайти(СтрокаСдвиг, "planSQLText=");

			СтрокаСдвиг = Сред(СтрокаСдвиг, Позиция + 13);

			Позиция = СтрНайти(СтрокаСдвиг, "'");

			ПланВыполненияЗапросаТекущийЗапрос = Лев(СтрокаСдвиг, Позиция-1);

		КонецЕсли;

		

		ПланВыполненияЗапроса = ПланВыполненияЗапроса + ПланВыполненияЗапросаТекущийЗапрос + Разделитель;

		СКЛТекстИзТехЖурнала = СКЛТекстИзТехЖурнала + СКЛТекстТекущийЗапрос +Разделитель;

		

	КонецЦикла;

	

	ПрочитанныеДанные.ТипСУБД = ТипСУБД;

	ПрочитанныеДанные.СКЛЗапрос = СокрЛП(СКЛТекстИзТехЖурнала);

	ПрочитанныеДанные.ПланВыполненияЗапроса = СокрЛП(ПланВыполненияЗапроса);

	

	УдалитьФайлы(ВременныйФайл);

	

КонецПроцедуры



Функция ИдентификаторПроцессаОС()

	

	ИДТекущегоПроцесса = Неопределено;

	ОбъектСистемы = Новый COMОбъект("WScript.Shell");

	Если ИДТекущегоПроцесса = Неопределено Тогда 

		Процесс = ОбъектСистемы.Exec("rundll32.exe kernel32,Sleep");

		ИДТекущегоПроцесса = ПолучитьCOMОбъект("winmgmts:{impersonationLevel=impersonate}!\\.\root\CIMV2:Win32_Process.Handle='" + Формат(Процесс.ProcessID,"ЧГ=0") + "'").ParentProcessID;

		Процесс.Terminate();

	КонецЕсли;

	

	Возврат ИДТекущегоПроцесса;

	

КонецФункции



Функция СобытиеЖурналаРегистрации() Экспорт

	

	Возврат НСтр("ru = 'Консоль запросов'", КодОсновногоЯзыка());

	

КонецФункции



Процедура ПолучитьУзелКонсолиЗапросов(ТекущийУзел, УзелКонсоли)

	

	Для Каждого Узел Из ТекущийУзел.ДочерниеУзлы Цикл

		

		Если Узел.ИмяУзла = "#document" Или Узел.ИмяУзла = "config" Тогда

			ПолучитьУзелКонсолиЗапросов(Узел, УзелКонсоли);

		КонецЕсли;

		

		Если Узел.ИмяУзла = "log" Тогда

			Если Узел.ЕстьАтрибут("repname") Тогда

				 УзелКонсоли = Узел;

			КонецЕсли;

		КонецЕсли;

		

	КонецЦикла;

	

КонецПроцедуры



Функция МассивСобытийКонсолиЗапросов(ИнформационнаяБазаФайловая = Ложь)

	

	МассивСобытий = Новый Массив;

	Если НЕ ИнформационнаяБазаФайловая Тогда

		МассивСобытий.Добавить("db2");

		МассивСобытий.Добавить("dbmssql");

		МассивСобытий.Добавить("dbpostgrs");

		МассивСобытий.Добавить("dboracle");

	КонецЕсли; 

	МассивСобытий.Добавить("SDBL");

	МассивСобытий.Добавить("DBV8DBEng");

	

	Возврат МассивСобытий;

	

КонецФункции



Процедура ОбойтиУзлыКонфигурацииТехЖурнала(КонфигурацияТехЖурнала, ТекущийУзел, ФильтрТекущегоСеанса, ПараметрыОбработки)

	

	Для Каждого Узел Из ТекущийУзел.ДочерниеУзлы Цикл

		

		Если Узел.ИмяУзла = "#document" Или Узел.ИмяУзла = "config" Тогда

			 ОбойтиУзлыКонфигурацииТехЖурнала(КонфигурацияТехЖурнала, Узел, ФильтрТекущегоСеанса, ПараметрыОбработки);

		КонецЕсли;

		

		Если Узел.ИмяУзла = "log" Тогда

			

			Если НЕ ПараметрыОбработки.КаталогСЛогФайлами = Неопределено Тогда

				Узел.УстановитьАтрибут("location", ПараметрыОбработки.КаталогСЛогФайлами);

			КонецЕсли; 

			

			ПараметрыОбработки.ФильтрыСобытияТЖ = Новый Структура;

			ПараметрыОбработки.ФильтрыСобытияТЖ.Вставить("ТекущееСобытие",Неопределено);

			ПараметрыОбработки.ФильтрыСобытияТЖ.Вставить("ТекущаяБаза",Неопределено);

			ПараметрыОбработки.ФильтрыСобытияТЖ.Вставить("ТекущийПользователь",Неопределено);

			ПараметрыОбработки.ФильтрыСобытияТЖ.Вставить("sessionid",Неопределено);

			

			ОбойтиУзлыКонфигурацииТехЖурнала(КонфигурацияТехЖурнала, Узел, ФильтрТекущегоСеанса, ПараметрыОбработки);

			

			Если ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущееСобытие = Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущийПользователь = Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.sessionid = Неопределено

				 И ПараметрыОбработки.ЗаменитьФильтры Тогда

				МассивСобытий = МассивСобытийКонсолиЗапросов(ИнформационнаяБазаФайловая);

				Для Каждого ЭлементСобытие Из МассивСобытий Цикл

					ДобавитьСобытиеКонсолиЗапросов(КонфигурацияТехЖурнала,Узел, ФильтрТекущегоСеанса, ЭлементСобытие);

				КонецЦикла;

				ПараметрыОбработки.ТекущееСостояниеТЖ = Новый Структура;

				ПараметрыОбработки.ТекущееСостояниеТЖ.Вставить("Включен", Истина);

				ПараметрыОбработки.ТекущееСостояниеТЖ.Вставить("КаталогСЛогФайлами", Узел.ПолучитьАтрибут("location"));

			ИначеЕсли ИнформационнаяБазаФайловая

				 И ВерсияПриложенияЧисло(ВерсияПлатформы) >= ВерсияПриложенияЧисло("8.3.14") 

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.sessionid = Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = ФильтрТекущегоСеанса.DataBase

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущийПользователь = Неопределено Тогда

					ПараметрыОбработки.ТекущееСостояниеТЖ = Новый Структура;

					ПараметрыОбработки.ТекущееСостояниеТЖ.Вставить("Включен", Истина);

					ПараметрыОбработки.ТекущееСостояниеТЖ.Вставить("КаталогСЛогФайлами", Узел.ПолучитьАтрибут("location"));

			ИначеЕсли ИнформационнаяБазаФайловая

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущееСобытие <> Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.sessionid = Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущийПользователь = Неопределено Тогда

					ПараметрыОбработки.ТекущееСостояниеТЖ = Новый Структура;

					ПараметрыОбработки.ТекущееСостояниеТЖ.Вставить("Включен", Истина);

					ПараметрыОбработки.ТекущееСостояниеТЖ.Вставить("КаталогСЛогФайлами", Узел.ПолучитьАтрибут("location"));

			ИначеЕсли НЕ ИнформационнаяБазаФайловая

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущееСобытие <> Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.sessionid = ФильтрТекущегоСеанса.sessionid

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = ФильтрТекущегоСеанса.processname

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущийПользователь = ФильтрТекущегоСеанса.usr Тогда

					ПараметрыОбработки.ТекущееСостояниеТЖ = Новый Структура;

					ПараметрыОбработки.ТекущееСостояниеТЖ.Вставить("Включен", Истина);

					ПараметрыОбработки.ТекущееСостояниеТЖ.Вставить("КаталогСЛогФайлами", Узел.ПолучитьАтрибут("location"));

			КонецЕсли;

			

			Если ПараметрыОбработки.ЗаменитьФильтры Тогда

				ДобавитьСвойствоКонсолиЗапросов(КонфигурацияТехЖурнала,Узел, "all");

				ДобавитьСвойствоКонсолиЗапросов(КонфигурацияТехЖурнала,Узел, "sql");

				ДобавитьСвойствоКонсолиЗапросов(КонфигурацияТехЖурнала,Узел, "plansqltext");

			КонецЕсли;

			

		КонецЕсли;

		

		Если Узел.ИмяУзла = "event" Тогда

			

			ОбойтиУзлыКонфигурацииТехЖурнала(КонфигурацияТехЖурнала, Узел, ФильтрТекущегоСеанса, ПараметрыОбработки);

			

			Если ИнформационнаяБазаФайловая

				 И ВерсияПриложенияЧисло(ВерсияПлатформы) >= ВерсияПриложенияЧисло("8.3.14") 

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущееСобытие <> Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.sessionid = Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = ФильтрТекущегоСеанса.DataBase

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущийПользователь = Неопределено Тогда

					Возврат;

			ИначеЕсли ИнформационнаяБазаФайловая

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущееСобытие <> Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.sessionid = Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущийПользователь = Неопределено Тогда

					Возврат;

			ИначеЕсли НЕ ИнформационнаяБазаФайловая

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущееСобытие <> Неопределено

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.sessionid = ФильтрТекущегоСеанса.sessionid

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = ФильтрТекущегоСеанса.processname

				 И ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущийПользователь = ФильтрТекущегоСеанса.usr Тогда

					Возврат;

			Иначе

				ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущееСобытие = Неопределено;

				ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = Неопределено;

				ПараметрыОбработки.ФильтрыСобытияТЖ.sessionid = Неопределено;

				ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущийПользователь = Неопределено;

			КонецЕсли;

			

		КонецЕсли;

		

		Если Узел.ИмяУзла = "eq" Тогда

			

			Если Узел.ПолучитьАтрибут("property") = "name" Тогда

				ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущееСобытие = Узел.ПолучитьАтрибут("value");

			КонецЕсли;

			

			Если ИнформационнаяБазаФайловая

				 И ВерсияПриложенияЧисло(ВерсияПлатформы) >= ВерсияПриложенияЧисло("8.3.14") Тогда

					Если Узел.ПолучитьАтрибут("property") = "DataBase" Тогда

						ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = Узел.ПолучитьАтрибут("value");

					КонецЕсли;

			Иначе

					Если Узел.ПолучитьАтрибут("property") = "p:processName" Тогда

						ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущаяБаза = Узел.ПолучитьАтрибут("value");

					КонецЕсли;

			КонецЕсли;

			

			Если Узел.ПолучитьАтрибут("property") = "usr" Тогда

				ПараметрыОбработки.ФильтрыСобытияТЖ.ТекущийПользователь = Узел.ПолучитьАтрибут("value");

			КонецЕсли;

			

			Если Узел.ПолучитьАтрибут("property") = "sessionid" Тогда

				ПараметрыОбработки.ФильтрыСобытияТЖ.sessionid =  Узел.ПолучитьАтрибут("value");

			КонецЕсли;

			

		КонецЕсли;

		

	КонецЦикла;

	

КонецПроцедуры



Процедура НайтиУзлыКУдалению(ТекущийУзел,ФильтрТекущегоСеанса,УзлыКУдалению, КоличествоEvent = 0, ФильтрыСобытияТЖ = Неопределено)

	

	Для Каждого Узел Из ТекущийУзел.ДочерниеУзлы Цикл

		

		Если Узел.ИмяУзла = "log" Тогда

			НайтиУзлыКУдалению(Узел,ФильтрТекущегоСеанса,УзлыКУдалению, КоличествоEvent, ФильтрыСобытияТЖ);

		КонецЕсли;

		

		Если Узел.ИмяУзла = "event" Тогда

			

			ФильтрыСобытияТЖ = Новый Структура;

			ФильтрыСобытияТЖ.Вставить("ТекущееСобытие",Неопределено);

			ФильтрыСобытияТЖ.Вставить("ТекущаяБаза",Неопределено);

			ФильтрыСобытияТЖ.Вставить("ТекущийПользователь",Неопределено);

			ФильтрыСобытияТЖ.Вставить("sessionid",Неопределено);

			

			НайтиУзлыКУдалению(Узел,ФильтрТекущегоСеанса,УзлыКУдалению, КоличествоEvent, ФильтрыСобытияТЖ);

			

			Если ИнформационнаяБазаФайловая

				 И ВерсияПриложенияЧисло(ВерсияПлатформы) >= ВерсияПриложенияЧисло("8.3.14") 

				 И ФильтрыСобытияТЖ.ТекущееСобытие <> Неопределено

				 И ФильтрыСобытияТЖ.sessionid = Неопределено

				 И ФильтрыСобытияТЖ.ТекущаяБаза = ФильтрТекущегоСеанса.DataBase

				 И ФильтрыСобытияТЖ.ТекущийПользователь = Неопределено Тогда

					УзлыКУдалению.Добавить(Узел);

			ИначеЕсли ИнформационнаяБазаФайловая

				 И ФильтрыСобытияТЖ.ТекущееСобытие <> Неопределено

				 И ФильтрыСобытияТЖ.sessionid = Неопределено

				 И ФильтрыСобытияТЖ.ТекущаяБаза = Неопределено

				 И ФильтрыСобытияТЖ.ТекущийПользователь = Неопределено Тогда

					УзлыКУдалению.Добавить(Узел);

			ИначеЕсли НЕ ИнформационнаяБазаФайловая

				 И ФильтрыСобытияТЖ.ТекущееСобытие <> Неопределено

				 И ФильтрыСобытияТЖ.sessionid = ФильтрТекущегоСеанса.sessionid

				 И ФильтрыСобытияТЖ.ТекущаяБаза = ФильтрТекущегоСеанса.processname

				 И ФильтрыСобытияТЖ.ТекущийПользователь = ФильтрТекущегоСеанса.usr Тогда

					УзлыКУдалению.Добавить(Узел);

			ИначеЕсли НЕ ИнформационнаяБазаФайловая

				 И ФильтрТекущегоСеанса.usr = ФильтрыСобытияТЖ.ТекущийПользователь

				 И СеансКонсолиЗапросовНеактивен(ФильтрТекущегоСеанса, ФильтрыСобытияТЖ) Тогда

					УзлыКУдалению.Добавить(Узел);

			КонецЕсли;

			

			КоличествоEvent = КоличествоEvent + 1;

			

		КонецЕсли;

		

		Если Узел.ИмяУзла = "eq" Тогда

			Если Узел.ПолучитьАтрибут("property") = "name" Тогда

				ФильтрыСобытияТЖ.ТекущееСобытие = Узел.ПолучитьАтрибут("value");

			КонецЕсли;

			

			Если ИнформационнаяБазаФайловая

				 И ВерсияПриложенияЧисло(ВерсияПлатформы) >= ВерсияПриложенияЧисло("8.3.14") Тогда

					Если Узел.ПолучитьАтрибут("property") = "DataBase" Тогда

						ФильтрыСобытияТЖ.ТекущаяБаза = Узел.ПолучитьАтрибут("value");

					КонецЕсли;

			Иначе

					Если Узел.ПолучитьАтрибут("property") = "p:processName" Тогда

						ФильтрыСобытияТЖ.ТекущаяБаза = Узел.ПолучитьАтрибут("value");

					КонецЕсли;

			КонецЕсли;

			

			Если Узел.ПолучитьАтрибут("property") = "usr" Тогда

				ФильтрыСобытияТЖ.ТекущийПользователь = Узел.ПолучитьАтрибут("value");

			КонецЕсли;

			

			Если Узел.ПолучитьАтрибут("property") = "sessionid" Тогда

				ФильтрыСобытияТЖ.sessionid = Узел.ПолучитьАтрибут("value");

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	

КонецПроцедуры



Процедура ДобавитьСобытиеКонсолиЗапросов(КонфигурацияТехЖурнала,УзелРодитель,ФильтрТекущегоСеанса, ЗначениеСобытия)

	

	УзелEvent = КонфигурацияТехЖурнала.СоздатьЭлемент("event");

	УзелРодитель.ДобавитьДочерний(УзелEvent);

	

	УстановитьФильтр(КонфигурацияТехЖурнала, УзелEvent, "name", ЗначениеСобытия);

	

	Если ИнформационнаяБазаФайловая

		 И ВерсияПриложенияЧисло(ВерсияПлатформы) >= ВерсияПриложенияЧисло("8.3.14") Тогда

		Если ЗначениеСобытия = "SDBL" Тогда

			УстановитьФильтр(КонфигурацияТехЖурнала, УзелEvent, "DBMS", "DBV8DBEng");

			УстановитьФильтр(КонфигурацияТехЖурнала, УзелEvent, "DataBase", ФильтрТекущегоСеанса.DataBase);

		ИначеЕсли ЗначениеСобытия = "DBV8DBEng" Тогда

			УстановитьФильтр(КонфигурацияТехЖурнала, УзелEvent, "DataBase", ФильтрТекущегоСеанса.DataBase);

		ИначеЕсли ЗначениеСобытия = "EXCP" Тогда

			УстановитьФильтр(КонфигурацияТехЖурнала, УзелEvent, "DataBase", ФильтрТекущегоСеанса.DataBase);

		КонецЕсли;

	Иначе

		УстановитьФильтр(КонфигурацияТехЖурнала, УзелEvent, "p:processName", ФильтрТекущегоСеанса.processname);

		Если ЗначениеЗаполнено(ФильтрТекущегоСеанса.usr) Тогда

			УстановитьФильтр(КонфигурацияТехЖурнала, УзелEvent, "usr", ФильтрТекущегоСеанса.usr);

		КонецЕсли; 

		УстановитьФильтр(КонфигурацияТехЖурнала, УзелEvent, "sessionid", ФильтрТекущегоСеанса.sessionid);

	КонецЕсли;

	

КонецПроцедуры



Процедура ДобавитьСвойствоКонсолиЗапросов(КонфигурацияТехЖурнала,УзелРодитель, ИмяСвойства);

	

	УзелProperty = КонфигурацияТехЖурнала.СоздатьЭлемент("property");

	УзелProperty.УстановитьАтрибут("name", ИмяСвойства);

	УзелРодитель.ДобавитьДочерний(УзелProperty);

	

КонецПроцедуры



Процедура УстановитьФильтр(КонфигурацияТехЖурнала,УзелРодитель, ИмяФильтра, ЗначениеФильтра)

	

	Если ЗначениеФильтра <> Неопределено Тогда

		УзелФильтра = КонфигурацияТехЖурнала.СоздатьЭлемент("eq");

		УзелФильтра.УстановитьАтрибут("property", ИмяФильтра);

		УзелФильтра.УстановитьАтрибут("value", ЗначениеФильтра);

		УзелРодитель.ДобавитьДочерний(УзелФильтра);

	КонецЕсли;

	

КонецПроцедуры



Функция ФильтрТекущегоСеанса()

	

	ФильтрТекущегоСеанса = Новый Структура;

	ФильтрТекущегоСеанса.Вставить("ИдентификаторИБ", ВРЕГ(СтрокаСоединенияИнформационнойБазы()));

	ФильтрТекущегоСеанса.Вставить("ДатаВремя", ТекущаяДатаСеанса());

	

	Если ИнформационнаяБазаФайловая Тогда

		ФильтрТекущегоСеанса.Вставить("processname", "");

		ФильтрТекущегоСеанса.Вставить("usr","");

		ФильтрТекущегоСеанса.Вставить("sessionid","");

		ФильтрТекущегоСеанса.Вставить("DataBase", КаталогФайловойИБ());

	Иначе

		ФильтрТекущегоСеанса.Вставить("processname", ИмяСУБД());

		ФильтрТекущегоСеанса.Вставить("usr", ИмяПользователя());

		ФильтрТекущегоСеанса.Вставить("sessionid", СтрЗаменить(Строка(НомерСеансаИнформационнойБазы()),Символы.НПП,""));

	КонецЕсли;

	

	Возврат ФильтрТекущегоСеанса;

	

КонецФункции



Функция СеансКонсолиЗапросовНеактивен(ФильтрТекущегоСеанса, ФильтрыСобытияТЖ)

	

	СеансыТекущейБазы = ПолучитьСеансыИнформационнойБазы(); // Массив из СеансИнформационнойБазы

	 

	Если ФильтрыСобытияТЖ.ТекущаяБаза <> ФильтрТекущегоСеанса.processname Тогда

		Возврат Ложь;

	КонецЕсли;

	

	Для Каждого СеансТекущейБазы Из СеансыТекущейБазы Цикл

		Если СеансТекущейБазы.Пользователь.Имя = ФильтрыСобытияТЖ.ТекущийПользователь

			 И Строка(СеансТекущейБазы.НомерСеанса) = ФильтрыСобытияТЖ.sessionid Тогда

			Возврат Ложь;

		КонецЕсли;

	КонецЦикла;

	

	Возврат Истина;

	

КонецФункции



Процедура ПолучитьПризнакВключенияЖурналаДляТекущегоСеанса(ПараметрыТехнологическогоЖурнала, РезультатВключения) Экспорт

	

	ИнформационнаяБазаФайловая = ИнформационнаяБазаФайловая();

	ВерсияПлатформы = ВерсияПлатформы();

	КаталогКонфигурацииПриложения = ПутьККонфигурационномуФайлу();

	

	ПараметрыФайлаКонфигурации = Новый Структура;

	ПараметрыФайлаКонфигурации.Вставить("КаталогКонфигурацииПриложения", КаталогКонфигурацииПриложения);

	ПараметрыФайлаКонфигурации.Вставить("ФайлКонфигурации", Неопределено);

	ПараметрыФайлаКонфигурации.Вставить("Поток", Неопределено);

	

	СтруктураФайлаКонфигурации = Новый Структура;

	

	ПрочитатьКонфигурациюИзФайла(СтруктураФайлаКонфигурации, ПараметрыФайлаКонфигурации);

	

	ФильтрТекущегоСеанса = ФильтрТекущегоСеанса();

	

	Если ПараметрыФайлаКонфигурации.КаталогКонфигурацииПриложения <> Неопределено 

		 И ПараметрыФайлаКонфигурации.ФайлКонфигурации.Существует() Тогда

		

		БлокКонфигурацииТекущегоСеанса = Неопределено;

		Для каждого БлокКонфигурации Из СтруктураФайлаКонфигурации.БлокиКонфигурации Цикл

		

			Если НЕ БлокКонфигурации.ЭтоБлокКонсоли Тогда

				Продолжить;

			КонецЕсли;

			

			Если БлокКонфигурации.ИдентификаторИБ = ФильтрТекущегоСеанса.ИдентификаторИБ Тогда

				БлокКонфигурацииТекущегоСеанса = БлокКонфигурации;

				Прервать;

			КонецЕсли;

		

		КонецЦикла;

		

		Если БлокКонфигурацииТекущегоСеанса <> Неопределено Тогда

			

			ТекстБлокаКонфигурации = БлокКонфигурацииТекущегоСеанса.Текст;

			

			ЧтениеXML = Новый ЧтениеXML;

			ТекстБлокаКонфигурации = СтрЗаменить(ТекстБлокаКонфигурации,"<property name=""all""/>","");

			ТекстБлокаКонфигурации = СтрЗаменить(ТекстБлокаКонфигурации,"<property name=""sql""/>","");

			ТекстБлокаКонфигурации = СтрЗаменить(ТекстБлокаКонфигурации,"<property name=""plansqltext""/>","");

			ТекстБлокаКонфигурации = СтрЗаменить(ТекстБлокаКонфигурации,"<plansql/>","");

			ЧтениеXML.УстановитьСтроку(ТекстБлокаКонфигурации);

			

			ПостроительDOM = Новый ПостроительDOM;

			УзелЛог = ПостроительDOM.Прочитать(ЧтениеXML);

			ЧтениеXML.Закрыть();

			

			ПараметрыОбработкиКонфигурации = ПараметрыОбработкиКонфигурационногоФайла();

			ОбойтиУзлыКонфигурацииТехЖурнала(УзелЛог, УзелЛог, ФильтрТекущегоСеанса, ПараметрыОбработкиКонфигурации);

			ТекущееСостояниеТЖ = ПараметрыОбработкиКонфигурации.ТекущееСостояниеТЖ;

			

			Если ТекущееСостояниеТЖ <> Неопределено Тогда

				ИдентификаторПроцессаОС = ИдентификаторПроцессаОС();

				РезультатВключения.Результат = ТекущееСостояниеТЖ.Включен;

				ПараметрыТехнологическогоЖурнала.КаталогСЛогФайлами =  ТекущееСостояниеТЖ.КаталогСЛогФайлами;

				ПараметрыТехнологическогоЖурнала.ИдентификаторПроцессаОС = Формат(ИдентификаторПроцессаОС, "ЧРД=; ЧРГ=; ЧГ=0");

			КонецЕсли;

			

		КонецЕсли;

		

	КонецЕсли;

	

КонецПроцедуры



#КонецОбласти



#Область Автономность



////////////////////////////////////////////////////////////////////////////////

// Процедуры и функции из базовой функциональности для обеспечения автономности.



Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт

	

	ИменаПодсистем = ИменаПодсистем();

	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;

	

КонецФункции



Функция ИменаПодсистем() Экспорт

	

	Возврат Новый ФиксированноеСоответствие(ИменаПодчиненныхПодсистем(Метаданные));

	

КонецФункции



Функция ИменаПодчиненныхПодсистем(РодительскаяПодсистема)

	

	Имена = Новый Соответствие;

	

	Для Каждого ТекущаяПодсистема Из РодительскаяПодсистема.Подсистемы Цикл

		

		Имена.Вставить(ТекущаяПодсистема.Имя, Истина);

		ИменаПодчиненных = ИменаПодчиненныхПодсистем(ТекущаяПодсистема);

		

		Для каждого ИмяПодчиненной Из ИменаПодчиненных Цикл

			Имена.Вставить(ТекущаяПодсистема.Имя + "." + ИмяПодчиненной.Ключ, Истина);

		КонецЦикла;

	КонецЦикла;

	

	Возврат Имена;

	

КонецФункции



Функция ОбщийМодуль(Имя) Экспорт

	

	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда

		Модуль = Вычислить(Имя);

	Иначе

		Модуль = Неопределено;

	КонецЕсли;

	

	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда

		ВызватьИсключение СтрЗаменить(НСтр("ru = 'Общий модуль ""%1"" не найден.'"), "%1", Имя);

	КонецЕсли;

	

	Возврат Модуль;

	

КонецФункции



Функция КодОсновногоЯзыка()

	Если ПодсистемаСуществует("СтандартныеПодсистемы.БазоваяФункциональность") Тогда

		МодульОбщегоНазначения = ОбщийМодуль("ОбщегоНазначения");

		Возврат МодульОбщегоНазначения.КодОсновногоЯзыка();

	КонецЕсли;

	Возврат Метаданные.ОсновнойЯзык.КодЯзыка;

КонецФункции



#КонецОбласти



#Область ОбработкаЗапросаИПланаВыполненияЗапроса



Функция ИмяСУБД()

	

	СтрокаПодключения = СтрокаСоединенияИнформационнойБазы();

	Позиция = СтрНайти(СтрокаПодключения, "Ref=""");

	Если Позиция > 0 Тогда

		СтрокаПодключения = Сред(СтрокаПодключения, Позиция + 5);

		Позиция = СтрНайти(СтрокаПодключения, """");

		Если Позиция > 0 Тогда

			Возврат Лев(СтрокаПодключения, Позиция - 1);

		Иначе

			Возврат СтрокаПодключения;

		КонецЕсли;

	КонецЕсли;

	

	Возврат Неопределено;

	

КонецФункции



// Преобразовывает имена объектов запроса СУБД к имена объектов метаданных конфигурации.

//

// Возвращаемое значение:

//  Структура:

//    * ТекстЗапросаВВидеМетаданных - Строка

//    * ПланВыполненияЗапросаВМетаданных - Строка 

//

Функция ПреобразоватьВМетаданные(ТекстЗапроса, ПланВыполненияЗапроса, ТипСУБД)  Экспорт

	

	ТекстЗапросаВМетаданных = ТекстЗапроса;

	ПланЗапросаВМетаданных = ПланВыполненияЗапроса;

	

	ТипСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150));

	ТипСтрокаЗначение = Новый ОписаниеТипов("Строка", , );

	ТипЧисло = Новый ОписаниеТипов("Число");

	

	СтруктураБД = ПолучитьСтруктуруХраненияБазыДанных(, Истина);

	СтруктураБД.Сортировать("ИмяТаблицыХранения УБЫВ");

	

	СоответствиеБДИндекс = Новый ТаблицаЗначений;

	СоответствиеБДИндекс.Колонки.Добавить("Ключ", ТипСтрока); 

	СоответствиеБДИндекс.Колонки.Добавить("Значение", ТипСтрокаЗначение);

	СоответствиеБДИндекс.Колонки.Добавить("КоличествоСимволов", ТипЧисло);

	СоответствиеБДИндекс.Индексы.Добавить("Ключ");

	СоответствиеБДИндекс.Индексы.Добавить("КоличествоСимволов");

	

	СоответствиеБДПоля = Новый ТаблицаЗначений;

	СоответствиеБДПоля.Колонки.Добавить("Ключ", ТипСтрока); 

	СоответствиеБДПоля.Колонки.Добавить("Значение", ТипСтрокаЗначение);

	СоответствиеБДПоля.Колонки.Добавить("КоличествоСимволов", ТипЧисло);

	СоответствиеБДПоля.Индексы.Добавить("Ключ");

	СоответствиеБДПоля.Индексы.Добавить("КоличествоСимволов");

	

	СоответствиеБД = Новый ТаблицаЗначений;

	СоответствиеБД.Колонки.Добавить("Ключ", ТипСтрока); 

	СоответствиеБД.Колонки.Добавить("Значение", ТипСтрокаЗначение);

	СоответствиеБД.Колонки.Добавить("КоличествоСимволов", ТипЧисло);

	СоответствиеБД.Индексы.Добавить("Ключ");

	СоответствиеБД.Индексы.Добавить("КоличествоСимволов");

	

	Для каждого Строка Из СтруктураБД Цикл

		НоваяСтрока = СоответствиеБД.Добавить();

		НоваяСтрока.Ключ = Строка.ИмяТаблицыХранения;

		НоваяСтрока.Значение = Строка.ИмяТаблицы;

		НоваяСтрока.КоличествоСимволов = СтрДлина(Строка.ИмяТаблицыХранения);

	КонецЦикла;

	

	СоответствиеБД.Сортировать("КоличествоСимволов Убыв, Ключ Убыв");

	

	Для каждого Строка Из СтруктураБД Цикл

		Для каждого Индекс Из Строка.Индексы Цикл

			НоваяСтрока = СоответствиеБДИндекс.Добавить();

			НоваяСтрока.Ключ = Индекс.ИмяИндексаХранения;

			СписокПоле = "";

			Разделитель = "";

			Для каждого Поле Из Индекс.Поля Цикл

				Если ЗначениеЗаполнено(Поле.ИмяПоля) Тогда

					СписокПоле = СписокПоле + Разделитель + Поле.ИмяПоля; 

				КонецЕсли;

				Разделитель = ", ";

			КонецЦикла;

			НоваяСтрока.Значение = СписокПоле;

			НоваяСтрока.КоличествоСимволов = СтрДлина(Индекс.ИмяИндексаХранения);

		КонецЦикла;

		

		Для каждого Поле Из Строка.Поля Цикл

			Если ЗначениеЗаполнено(Поле.ИмяПоля) Тогда

				НоваяСтрока = СоответствиеБДПоля.Добавить();

				НоваяСтрока.Ключ = Поле.ИмяПоляХранения;

				НоваяСтрока.Значение = Поле.ИмяПоля;

				НоваяСтрока.КоличествоСимволов = СтрДлина(Поле.ИмяПоляХранения);

			Иначе

				Позиция = СтрНайти(Поле.ИмяПоляХранения, "_IDRRef");

				Если Позиция > 1 Тогда 

					ИмяОбъекта = Лев(Поле.ИмяПоляХранения, Позиция-1);

					ИмяТаблицы =  СоответствиеБД.Найти(ИмяОбъекта, "Ключ").Значение;

					НоваяСтрока = СоответствиеБДПоля.Добавить();

					НоваяСтрока.Ключ = Поле.ИмяПоляХранения;

					НоваяСтрока.Значение = "Ссылка(" + ИмяТаблицы + ")";

					НоваяСтрока.КоличествоСимволов = СтрДлина(Поле.ИмяПоляХранения);

				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	

	СоответствиеБДПоля.Сортировать("КоличествоСимволов Убыв, Ключ УБЫВ");

	СоответствиеБДИндекс.Сортировать("КоличествоСимволов Убыв, Ключ УБЫВ");

	

	Если ТипСУБД = "DBPOSTGRS" Тогда

		ПланЗапросаВМетаданных = НРег(ПланЗапросаВМетаданных);

	ИначеЕсли ТипСУБД = "DBMSSQL" Тогда

		// Очистка запроса

		ПланЗапросаВМетаданных = СтрЗаменить(ПланЗапросаВМетаданных, "[" + ИмяСУБД() + "].[dbo].", "");

		ПланЗапросаВМетаданных = СтрЗаменить(ПланЗапросаВМетаданных, "[tempdb].[dbo].", "");

		ПланЗапросаВМетаданных = СтрЗаменить(ПланЗапросаВМетаданных, "#tt", "ВременнаяТаблица");

		ТекстЗапросаВМетаданных = СтрЗаменить(ТекстЗапросаВМетаданных, "dbo.", "");

		ТекстЗапросаВМетаданных = СтрЗаменить(ТекстЗапросаВМетаданных, "#tt", "ВременнаяТаблица");

	КонецЕсли;

	

	Для каждого Поле Из СоответствиеБДИндекс Цикл

		

		Если СтрНайти(ПланЗапросаВМетаданных, Поле.Ключ) Тогда

			Если ТипСУБД = "DBPOSTGRS" Тогда

				Ключ = НРег(Поле.Ключ);

			Иначе

				Ключ = Поле.Ключ;

			КонецЕсли;

			ПланЗапросаВМетаданных = СтрЗаменить(ПланЗапросаВМетаданных, Ключ, НСтр("ru = 'Индекс по'") + " " + Поле.Значение + "");

		КонецЕсли;

		

	КонецЦикла;

	

	Для каждого Поле Из СоответствиеБДПоля Цикл

		Если СтрНайти(ТекстЗапросаВМетаданных, Поле.Ключ) Тогда

			ТекстЗапросаВМетаданных = СтрЗаменить(ТекстЗапросаВМетаданных, Поле.Ключ, Поле.Значение);

			Если ТипСУБД = "DBPOSTGRS" Тогда 

				Ключ = НРег(Поле.Ключ);

			Иначе

				Ключ = Поле.Ключ;

			КонецЕсли;

			ПланЗапросаВМетаданных = СтрЗаменить(ПланЗапросаВМетаданных, Ключ, Поле.Значение);

		КонецЕсли;

	КонецЦикла;

	

	Для каждого Поле Из СоответствиеБД Цикл

		Если СтрНайти(ТекстЗапросаВМетаданных, Поле.Ключ) Тогда

			ТекстЗапросаВМетаданных = СтрЗаменить(ТекстЗапросаВМетаданных, Поле.Ключ, Поле.Значение);

			Если ТипСУБД = "DBPOSTGRS" Тогда 

				ПланЗапросаВМетаданных = СтрЗаменить(ПланЗапросаВМетаданных, НРег(Поле.Ключ), Поле.Значение);

			ИначеЕсли ТипСУБД = "DBMSSQL" Тогда 

				ПланЗапросаВМетаданных = СтрЗаменить(ПланЗапросаВМетаданных, "[" + Поле.Ключ + "]", Поле.Значение);	

			Иначе

				ПланЗапросаВМетаданных = СтрЗаменить(ПланЗапросаВМетаданных, Поле.Ключ, Поле.Значение);

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	

	ВВидеМетаданных = Новый Структура();

	ВВидеМетаданных.Вставить("ТекстЗапросаВВидеМетаданных", ТекстЗапросаВМетаданных);

	ВВидеМетаданных.Вставить("ПланВыполненияЗапросаВМетаданных", ПланЗапросаВМетаданных);

	

	Возврат ВВидеМетаданных;

	

КонецФункции



// Параметры:

//   ПланЗапросаТекст - Строка

//   ПланЗапросаМетаданные - Строка

//   ДеревоПланЗапроса - ДеревоЗначений

//   СуммарнаяСтоимостьОбщая - Число

// 

Процедура ДеревоПланаВыполненияЗапроса(Знач ПланЗапросаТекст, Знач ПланЗапросаМетаданные, ДеревоПланЗапроса, СуммарнаяСтоимостьОбщая) Экспорт

	

	СуммарнаяСтоимостьОбщая = 0;

	

	Позиция = 1;

	ПредыдущаяПозиция = 0;

	СтрокаДерево = ДеревоПланЗапроса;

	Пока Позиция > 0  Цикл

		МассивЯчеек = Новый Массив;

		Для Индекс = 1 По 8 Цикл

			Позиция = СтрНайти(ПланЗапросаТекст, ",");

			МассивЯчеек.Добавить(СокрЛП(Лев(ПланЗапросаТекст, Позиция-1)));

			ПланЗапросаТекст = Сред(ПланЗапросаТекст, Позиция + 1);

		КонецЦикла;

		Позиция = СтрНайти(ПланЗапросаТекст, Символы.ПС);

		Если Позиция = 0 Тогда

			Оператор = ПланЗапросаТекст;

		Иначе

			Оператор = Лев(ПланЗапросаТекст, Позиция - 1);

		КонецЕсли;

		ПланЗапросаТекст = Сред(ПланЗапросаТекст, Позиция + 1);

	

		Для Индекс = 1 По 8 Цикл

			ПозицияМетаданные = СтрНайти(ПланЗапросаМетаданные, ",");

			ПланЗапросаМетаданные = Сред(ПланЗапросаМетаданные, ПозицияМетаданные + 1);

		КонецЦикла;

		ПозицияМетаданные = СтрНайти(ПланЗапросаМетаданные, Символы.ПС);

		Если ПозицияМетаданные > 0 Тогда

			ОператорМетаданные = Лев(ПланЗапросаМетаданные, ПозицияМетаданные - 1);

			ПланЗапросаМетаданные = Сред(ПланЗапросаМетаданные, ПозицияМетаданные + 1);

		Иначе

			ОператорМетаданные = ПланЗапросаМетаданные;

		КонецЕсли;

		

		ПозицияМетаданные = СтрНайти(ОператорМетаданные, "|--") - 4;

		

		Если ПозицияМетаданные = 0 Тогда 

			СтрокаДерево = ДеревоПланЗапроса.Строки.Добавить();

		Иначе

			Если ПредыдущаяПозиция < ПозицияМетаданные Тогда 

				СтрокаДерево = СтрокаДерево.Строки.Добавить();

			ИначеЕсли ПредыдущаяПозиция > ПозицияМетаданные Тогда 

				СтрокаДерево = НайтиПозициюВВетке(СтрокаДерево, ПозицияМетаданные); // СтрокаДереваЗначений

				Если СтрокаДерево <> Неопределено Тогда 

					СтрокаДерево = СтрокаДерево.Строки.Добавить();

				Иначе

					СтрокаДерево = ДеревоПланЗапроса.Строки.Добавить();

				КонецЕсли;

			Иначе 

				СтрокиУровнемВыше = СтрокаДерево.Родитель.Строки; // КоллекцияСтрокДереваЗначений

				СтрокаДерево = СтрокиУровнемВыше.Добавить();

				

			КонецЕсли;

		КонецЕсли;

		

		Если СтрокаДерево.Родитель = Неопределено Тогда

			СуммарнаяСтоимостьОбщая = СуммарнаяСтоимостьОбщая + ПреобразоватьВЧисло(МассивЯчеек[6]);

		КонецЕсли;



		ПозицияSQL = СтрНайти(Оператор, "|--");

		СтрокаДерево.Оператор = Сред(Оператор, ПозицияSQL + 3);

		СтрокаДерево.ОператорМетаданные = Сред(ОператорМетаданные, ПозицияМетаданные + 7);

		СтрокаДерево.Отступ = ПозицияМетаданные;

		СтрокаДерево.СтрокиФакт = МассивЯчеек[0];

		СтрокаДерево.ВызовыФакт = МассивЯчеек[1];

		СтрокаДерево.СтрокиПлан = МассивЯчеек[2];

		СтрокаДерево.ЗатратыВводаВывода = МассивЯчеек[3];

		СтрокаДерево.ЗагрузкаЦП = МассивЯчеек[4];

		СтрокаДерево.СреднийРазмерСтрок = МассивЯчеек[5];

		СтрокаДерево.СтоимостьОбщая = ПреобразоватьВЧисло(МассивЯчеек[6]);

		СтрокаДерево.ВызовыПлан = МассивЯчеек[7];

		ПредыдущаяПозиция = ПозицияМетаданные;

	КонецЦикла;

	

	РассчитатьСтоимостьОператоров(ДеревоПланЗапроса.Строки);

	

КонецПроцедуры



Функция РассчитатьСтоимостьОператоров(ВеткаДерева)

	

	Сумма = 0;

	

	Для каждого строка Из ВеткаДерева Цикл

		

		АккумуляторСтоимости = 0;

		

		Если Строка.Строки.Количество() > 0 Тогда

			АккумуляторСтоимости = РассчитатьСтоимостьОператоров(строка.Строки);

		КонецЕсли;

		

		СтоимостьОператора = Строка.СтоимостьОбщая - АккумуляторСтоимости;

		Строка.Стоимость = ?(СтоимостьОператора < 0, 0, СтоимостьОператора);

		Сумма = Сумма + Строка.СтоимостьОбщая;

		

	КонецЦикла;

	

	Возврат Сумма;

	

КонецФункции



// Параметры:

//   Ветка - СтрокаДереваЗначений:

//    * Отступ - Число

//   НомерПозиции - Число

//

// Возвращаемое значение:

//   СтрокаДереваЗначений

//   Неопределено

//

Функция НайтиПозициюВВетке(Ветка, НомерПозиции)

	

	Если Ветка.Отступ > НомерПозиции Тогда

		Возврат НайтиПозициюВВетке(Ветка.Родитель, НомерПозиции);

	ИначеЕсли Ветка.Отступ = НомерПозиции Тогда

		Возврат Ветка.Родитель;

	КонецЕсли;

	

	Возврат Неопределено;

	

КонецФункции



Функция ПреобразоватьВЧисло(ЧислоСтрокой)

	

	Результат = 0;

	ЧислоСтрокой = СокрЛП(ВРег(ЧислоСтрокой));

	Если СтрДлина(ЧислоСтрокой) > 0 Тогда

		ПозицияЕ  = СтрНайти(ЧислоСтрокой, "E");

		Если ПозицияЕ = 0 Тогда 

			Результат = Число(ЧислоСтрокой);

		Иначе

			ЧислоДоЕ = Число(Лев(ЧислоСтрокой, ПозицияЕ - 1));

			ЧислоПослеЕ = Число(Сред(ЧислоСтрокой, ПозицияЕ + 1));

			Результат =  ЧислоДоЕ * Pow(10 ,ЧислоПослеЕ);

		КонецЕсли;

	КонецЕсли;

	

	Возврат Результат;

	

КонецФункции



#КонецОбласти



#КонецОбласти

         



// Модуль для работы с API загрузки файлов, управления конфигурациями и сессиями запросов

// Проект: 1C_development

// Платформа: 1C:Enterprise 8.3.23



#Область ПрограммныйИнтерфейс



// Загружает файл в API

// Параметры:

//  ПутьКФайлу - Строка - путь к файлу на сервере

//  ИмяФайла - Строка - имя файла (например, "meta.xml")

// Возвращаемое значение:

//  Структура - результат запроса: ИдентификаторФайла (Число), Успех (Булево), Ошибка (Строка)

Функция ЗагрузитьФайл(ПутьКФайлу, ИмяФайла) Экспорт

	

	// Проверка входных параметров

	Если Не ЗначениеЗаполнено(ПутьКФайлу) Или Не ЗначениеЗаполнено(ИмяФайла) Тогда

		Возврат Новый Структура("Успех, Ошибка", Ложь, "Не указан путь к файлу или имя файла");

	КонецЕсли;

	

	// Кодирование файла в Base64 

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПутьКФайлу);

	//ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);

	СтрокаBase64 = Base64Строка(ДвоичныеДанные);

	

	// Формирование JSON-данных

	Данные = Новый Структура;

	Данные.Вставить("file", СтрокаBase64);

	Данные.Вставить("filename", ИмяФайла);

	Данные.Вставить("name", ИмяФайла);

	

	// Отправка POST-запроса

	Результат = ВыполнитьHTTPЗапрос("/api/file-manager/files/", "POST", Данные);

	

	// Обработка ответа

	Если Результат.Успех Тогда

		ОтветJSON = ПрочитатьJSONИзСтроки(Результат.Ответ);

		Возврат Новый Структура("Успех, ИдентификаторФайла, Ошибка", Истина, ОтветJSON.id, "");

	Иначе

		Возврат Новый Структура("Успех, Ошибка", Ложь, Результат.Ошибка);

	КонецЕсли;

	

КонецФункции



// Создает конфигурацию в API

// Параметры:

//  ИдентификаторФайла - Число - идентификатор загруженного файла

// Возвращаемое значение:

//  Структура - результат запроса: СсылкаКонфигурации (Строка), Успех (Булево), Ошибка (Строка)

Функция СоздатьКонфигурацию(ИдентификаторФайла) Экспорт

	

	// Формирование JSON-данных

	Данные = Новый Структура;

	Данные.Вставить("uploaded_file_id", ИдентификаторФайла);

	

	// Отправка POST-запроса

	Результат = ВыполнитьHTTPЗапрос("/api/manager-1c/configs/", "POST", Данные);

	

// Обработка ответа

	Если Результат.Успех Тогда

		ОтветJSON = ПрочитатьJSONИзСтроки(Результат.Ответ);

		Возврат Новый Структура("Успех, СсылкаКонфигурации, Ошибка, Обновлено", Истина, ОтветJSON.ref, "", ОтветJSON.updated_at);

	Иначе

		Возврат Новый Структура("Успех, Ошибка", Ложь, Результат.Ошибка);

	КонецЕсли;

	

КонецФункции



// Собирает запросы отчетов для массовой отправки на backend.

// Возвращаемое значение:

//  Массив структур: name, data_composition_schema_name, data_set_name, query_text

Функция СобратьЗапросыОтчетовДляBulkLoad() Экспорт

	

	Результат = Новый Массив;

	УникальныеЗаписи = Новый Соответствие;

	СтрокиОтчетов = ПолучитьСтрокиОтчетовДляВыгрузки();

	

	Для Каждого СтрокаОтчета Из СтрокиОтчетов Цикл

		Если Не СтрокаОтчета.ЭтоЗапросныйНабор Тогда

			Продолжить;

		КонецЕсли;

		

		Ключ = СтрокаОтчета.Отчет + "|" + СтрокаОтчета.Схема + "|" + СтрокаОтчета.НаборДанных;

		Запись = Новый Структура;

		Запись.Вставить("name", СтрокаОтчета.Отчет);

		Запись.Вставить("data_composition_schema_name", СтрокаОтчета.Схема);

		Запись.Вставить("data_set_name", СтрокаОтчета.НаборДанных);

		Запись.Вставить("query_text", СтрокаОтчета.Запрос);

		УникальныеЗаписи.Вставить(Ключ, Запись);

	КонецЦикла;

	

	Для Каждого ЭлементСоответствия Из УникальныеЗаписи Цикл

		Результат.Добавить(ЭлементСоответствия.Значение);

	КонецЦикла;

	

	Возврат Результат;

	

КонецФункции



// Загружает запросы отчетов на backend через существующий массовый endpoint.

// Параметры:

//  СсылкаКонфигурации - Строка - UUID конфигурации

//  РазмерПакета - Число - размер пакета для отправки

// Возвращаемое значение:

//  Структура - Успех, Обновлено, НеНайдено, Всего, Ошибка, Ошибки

Функция МассовоЗагрузитьЗапросыОтчетов(СсылкаКонфигурации, РазмерПакета = 200) Экспорт

	

	Если Не ЗначениеЗаполнено(СсылкаКонфигурации) Тогда

		Возврат Новый Структура("Успех, Обновлено, НеНайдено, Всего, Ошибка, Ошибки", Ложь, 0, 0, 0, "Не передана ссылка конфигурации", Новый Массив);

	КонецЕсли;

	

	Если РазмерПакета <= 0 Тогда

		РазмерПакета = 200;

	КонецЕсли;

	

	ЗаписиОтчетов = СобратьЗапросыОтчетовДляBulkLoad();

	Всего = ЗаписиОтчетов.Количество();

	Обновлено = 0;

	НеНайдено = 0;

	Ошибки = Новый Массив;

	

	Если Всего = 0 Тогда

		Возврат Новый Структура("Успех, Обновлено, НеНайдено, Всего, Ошибка, Ошибки", Истина, 0, 0, 0, "", Ошибки);

	КонецЕсли;

	

	Позиция = 0;

	Пока Позиция < Всего Цикл

		Пакет = Новый Массив;

		Для Счетчик = Позиция По Мин(Позиция + РазмерПакета - 1, Всего - 1) Цикл

			Пакет.Добавить(ЗаписиОтчетов[Счетчик]);

		КонецЦикла;

		

		Данные = Новый Структура;

		Данные.Вставить("configuration_ref", Строка(СсылкаКонфигурации));

		Данные.Вставить("reports", Пакет);

		

		Ответ = ВыполнитьHTTPЗапрос("/api/manager-1c/reports/bulk-load-queries/", "POST", Данные);

		Если Не Ответ.Успех Тогда

			Возврат Новый Структура("Успех, Обновлено, НеНайдено, Всего, Ошибка, Ошибки", Ложь, Обновлено, НеНайдено, Всего, Ответ.Ошибка, Ошибки);

		КонецЕсли;

		

		ДанныеОтвета = ПрочитатьJSONИзСтроки(Ответ.Ответ);

		Если ТипЗнч(ДанныеОтвета) = Тип("Структура") Тогда

			Если ДанныеОтвета.Свойство("updated") Тогда

				Обновлено = Обновлено + Число(ДанныеОтвета.updated);

			КонецЕсли;

			Если ДанныеОтвета.Свойство("not_found") Тогда

				НеНайдено = НеНайдено + Число(ДанныеОтвета.not_found);

			КонецЕсли;

			Если ДанныеОтвета.Свойство("errors") И ЗначениеЗаполнено(ДанныеОтвета.errors) Тогда

				Для Каждого ОшибкаЭлемент Из ДанныеОтвета.errors Цикл

					Ошибки.Добавить(ОшибкаЭлемент);

				КонецЦикла;

			КонецЕсли;

		КонецЕсли;

		

		Позиция = Позиция + РазмерПакета;

	КонецЦикла;

	

	Возврат Новый Структура("Успех, Обновлено, НеНайдено, Всего, Ошибка, Ошибки", Истина, Обновлено, НеНайдено, Всего, "", Ошибки);

	

КонецФункции



// Проверяет конфигурацию по ссылке

// Параметры:

//  СсылкаКонфигурации - Строка - UUID конфигурации

// Возвращаемое значение:

//  Структура - результат запроса: Данные (Структура), Успех (Булево), Ошибка (Строка)

Функция ПроверитьКонфигурацию(ИдентификаторКонфигурации) Экспорт
	// 2d + 1c-buddy: manager-1c отключен, возвращаем локальную active без HTTP/502
	Данные = Новый Структура("name, title", "Локальная", "Локальная");
	Возврат Новый Структура("Успех, Данные, Ошибка, StatusId, ИмяКонфигурации, СтатусКонфигурации", Истина, Данные, "", "active", "Локальная", "Готова (Buddy)");
КонецФункции



// Получает список всех конфигураций

// Возвращаемое значение:

//  Структура - результат запроса: Данные (Массив), Успех (Булево), Ошибка (Строка)

Функция ПолучитьСписокКонфигураций() Экспорт

	

	// Отправка GET-запроса

	Результат = ВыполнитьHTTPЗапрос("/api/manager-1c/configs/", "GET");

	

	// Обработка ответа

	Если Результат.Успех Тогда

		ОтветJSON = ПрочитатьJSONИзСтроки(Результат.Ответ);

		Возврат Новый Структура("Успех, Данные, Ошибка", Истина, ОтветJSON, "");

	Иначе

		Возврат Новый Структура("Успех, Ошибка", Ложь, Результат.Ошибка);

	КонецЕсли;

	

КонецФункции



// Создает сессию в API

// Параметры:

//  СсылкаКонфигурации - Строка - UUID конфигурации

// Возвращаемое значение:

//  Структура - результат запроса: СсылкаСессии (Строка), Успех (Булево), Ошибка (Строка)

Функция СоздатьСессию(ИдентификаторКонфигурации) Экспорт
	// 2d + 1c-buddy stateless: локальная сессия
	Ссылка = Строка(Новый УникальныйИдентификатор());
	Возврат Новый Структура("Успех, СсылкаСессии, Ошибка", Истина, Ссылка, "");
КонецФункции



Функция ПроверитьСессию(ИдентификаторСессии) Экспорт
	// 2d + 1c-buddy stateless: без HTTP
	Возврат Новый Структура("Успех, Данные, Ошибка", Истина, Новый Структура("id", Строка(ИдентификаторСессии)), "");
КонецФункции



// Отправляет сообщение в сессию

// Параметры:

//  СсылкаСессии - Строка - UUID сессии

//  ТекстСообщения - Строка - текст сообщения

// Возвращаемое значение:

//  Структура - результат запроса: Успех (Булево), Ошибка (Строка)

Функция ОтправитьСообщение(СсылкаСессии, ТекстСообщения, ТекущийЗапрос) Экспорт
    МаксимальнаяДлинаСообщения = 10000;
    Если СтрДлина(Строка(ТекстСообщения)) > МаксимальнаяДлинаСообщения Тогда
        Возврат Новый Структура("Успех, Ошибка", Ложь, "Сообщение слишком длинное: максимум 10000 символов.");
    КонецЕсли;
    Если мИсторияБадди = Неопределено Тогда
        мИсторияБадди = Новый Массив;
    КонецЕсли;
    ТекстДляБадди = ТекстСообщения;
    Если ЗначениеЗаполнено(ТекущийЗапрос) Тогда
        ТекстДляБадди = ТекстДляБадди + Символы.ПС + "Запрос:" + Символы.ПС + ТекущийЗапрос;
    КонецЕсли;
    // Загружаем историю для окна LLM (stateless, но контекст нужен)
    Попытка
        Сохр = ХранилищеОбщихНастроек.Загрузить("BuddyHistory", СсылкаСессии);
        Если Сохр <> Неопределено Тогда
            мИсторияБадди = Сохр;
        КонецЕсли;
    Исключение КонецПопытки;
    // V2: compact → NEED → детали + история (2×200 OK stateless)
    КонтекстКомпакт = "";
    Попытка КонтекстКомпакт = ПолучитьКонтекстСхемыКомпакт(ТекстДляБадди); Исключение КонтекстКомпакт = ""; КонецПопытки;
    ИсторияДляLLM = Новый Массив;
    Попытка
        Для Каждого Эл Из мИсторияБадди Цикл
            // отбор только user/assistant для LLM (последние 12 обрежутся в Buddy_Спросить)
            Если Эл.role = "user" Или Эл.role = "assistant" Тогда
                ИсторияДляLLM.Добавить(Новый Структура("role, text", Эл.role, Эл.text));
            КонецЕсли;
        КонецЦикла;
    Исключение КонецПопытки;
    РезультатБадди = Buddy_Спросить(ТекстДляБадди, КонтекстКомпакт, "", ИсторияДляLLM);
    Если Не РезультатБадди.Успех Тогда
        Возврат Новый Структура("Успех, Ошибка", Ложь, РезультатБадди.Ошибка);
    КонецЕсли;
    ТекстОтвета = РезультатБадди.ТекстОтвета;
    // Проверка NEED: Документ.Имя, Регистр... — второй вызов с деталями + fallback на локальный поиск при цикле ITS
    Попытка
        Поз = Найти(ВРег(ТекстОтвета), "NEED:");
        МассивИмен = Неопределено;
        РежимFallback = Ложь;
        Если Поз > 0 Тогда
            СтрNeed = Сред(ТекстОтвета, Поз + 5);
            ПозПС = Найти(СтрNeed, Символы.ПС);
            Если ПозПС > 0 Тогда СтрNeed = Лев(СтрNeed, ПозПС - 1); КонецЕсли;
            МассивИмен = Новый Массив;
            Для Каждого Ч Из СтрРазделить(СтрNeed, ",") Цикл
                Имя = СокрЛП(СтрЗаменить(Ч, ";", ""));
                Если Найти(Имя, ".") > 0 И СтрДлина(Имя) >= 3 Тогда МассивИмен.Добавить(Имя); КонецЕсли;
            КонецЦикла;
            Если МассивИмен.Количество() = 0 Тогда МассивИмен = Неопределено; КонецЕсли;
        Иначе
            // Fallback: LLM не вернул NEED, но ушёл в цикл / галлюцинацию — ищем локально
            НизОтвета = НРег(ТекстОтвета);
            Если Найти(НизОтвета, "давайте поищем") > 0 Или Найти(НизОтвета, "its knowledge") > 0 Или Найти(НизОтвета, "session_id") > 0 Или Найти(НизОтвета, "findsimilar") > 0 Или Найти(НизОтвета, "отсутств") > 0 Или Найти(НизОтвета, "не существует") > 0 Или Найти(НизОтвета, "нет в каталоге") > 0 Тогда
                РежимFallback = Истина;
                ЗаписатьЛогAether("ОтправитьСообщение V2 fallback loop detect, ищем локально по запросу: " + Лев(ТекстДляБадди, 120));
                МассивИмен = НайтиРелевантныеОбъектыПоЗапросу(ТекстДляБадди, 8);
                Если МассивИмен.Количество() = 0 Тогда МассивИмен = Неопределено; КонецЕсли;
            КонецЕсли;
        КонецЕсли;
        Если МассивИмен <> Неопределено И МассивИмен.Количество() > 0 Тогда
            // Разворачиваем generic NEED: РБ./РН. и чистим .Модуль
            Попытка
                Развернутые = Новый Массив;
                Для Каждого Имя Из МассивИмен Цикл
                    Чист = СокрЛП(Имя);
                    Если Прав(Чист, 7) = ".Модуль" Тогда Чист = Лев(Чист, СтрДлина(Чист) - 7); КонецЕсли;
                    Если Чист = "РБ." Или Чист = "РН." Или Чист = "РС." Или Чист = "Д." Или Чист = "С." Тогда
                        // generic префикс → все объекты этого типа
                        Кат = СобратьКраткийКаталог(Истина);
                        Для Каждого Стр Из СтрРазделить(Кат, Символы.ПС) Цикл
                            Если ПустаяСтрока(СокрЛП(Стр)) Тогда Продолжить; КонецЕсли;
                            Если Лев(НРег(СокрЛП(Стр)), СтрДлина(Чист)) = НРег(Чист) Тогда
                                ПозПроб = Найти(Стр, " "); ПозСкоб = Найти(Стр, "("); Поз = 0;
                                Если ПозПроб > 0 И ПозСкоб > 0 Тогда Поз = Мин(ПозПроб, ПозСкоб); ИначеЕсли ПозПроб > 0 Тогда Поз = ПозПроб; ИначеЕсли ПозСкоб > 0 Тогда Поз = ПозСкоб; КонецЕсли;
                                Имя2 = ?(Поз > 0, СокрЛП(Лев(Стр, Поз - 1)), СокрЛП(Стр));
                                Если Найти(Имя2, ".") > 0 Тогда Развернутые.Добавить(Имя2); КонецЕсли;
                                Если Развернутые.Количество() >= 8 Тогда Прервать; КонецЕсли;
                            КонецЕсли;
                        КонецЦикла;
                    Иначе
                        Развернутые.Добавить(Чист);
                    КонецЕсли;
                КонецЦикла;
                МассивИмен = Развернутые;
            Исключение КонецПопытки;
            ЗаписатьЛогAether("ОтправитьСообщение V2 " + ?(РежимFallback, "FALLBACK", "NEED") + ": " + СтрСоединить(МассивИмен, ", "));
            Если МассивИмен.Количество() > 8 Тогда Пока МассивИмен.Количество() > 8 Цикл МассивИмен.Удалить(8); КонецЦикла; КонецЕсли;
            Если МассивИмен.Количество() = 0 Тогда
                ЗаписатьЛогAether("ОтправитьСообщение V2 generic NEED дал 0 — пропускаем второй вызов");
            Иначе
                КонтекстДетали = "";
                Попытка КонтекстДетали = ПолучитьКонтекстСхемыДетали(МассивИмен); Исключение КонтекстДетали = ""; КонецПопытки;
            ИсторияВторой = Новый Массив;
            Для Каждого Э Из ИсторияДляLLM Цикл ИсторияВторой.Добавить(Э); КонецЦикла;
            ИсторияВторой.Добавить(Новый Структура("role, text", "user", ТекстДляБадди));
            ИсторияВторой.Добавить(Новый Структура("role, text", "assistant", ТекстОтвета));
            ТекстВторой = ?(РежимFallback, "Ты ушёл в поиск ITS/цикл — игнорируй. ", "") + "Детали по " + ?(РежимFallback, "локальному поиску", "NEED") + " ниже. Сформируй итоговый ответ (запрос/исправленный запрос + пояснение) на основе деталей. Исходный вопрос: " + ТекстДляБадди;
            РезультатВторой = Buddy_Спросить(ТекстВторой, КонтекстДетали, "", ИсторияВторой);
            Если РезультатВторой.Успех Тогда
                ТекстОтвета = РезультатВторой.ТекстОтвета;
                ЗаписатьЛогAether("ОтправитьСообщение V2 второй вызов OK длина=" + СтрДлина(ТекстОтвета));
            Иначе
                ЗаписатьЛогAether("ОтправитьСообщение V2 второй вызов ошибка: " + РезультатВторой.Ошибка);
            КонецЕсли;
            КонецЕсли;
        КонецЕсли;
    Исключение
        ЗаписатьЛогAether("ОтправитьСообщение V2 NEED parse искл: " + ОписаниеОшибки());
    КонецПопытки;
    ЗаписьПольз = Новый Структура("ID, role, text, created_at, is_user, query, query_text", Строка(Новый УникальныйИдентификатор), "user", ТекстСообщения, ТекущаяДата(), Истина, "", "");
    Если ЗначениеЗаполнено(ТекущийЗапрос) Тогда
        ЗаписьПольз.query = ТекущийЗапрос;
        ЗаписьПольз.query_text = ТекущийЗапрос;
    КонецЕсли;
    мИсторияБадди.Добавить(ЗаписьПольз);
    мИсторияБадди.Добавить(Новый Структура("ID, role, text, created_at, is_user, query, query_text", Строка(Новый УникальныйИдентификатор), "assistant", ТекстОтвета, ТекущаяДата(), Ложь, "", ""));
    Попытка
        ХранилищеОбщихНастроек.Сохранить("BuddyHistory", СсылкаСессии, мИсторияБадди);
    Исключение
    КонецПопытки;
    Возврат Новый Структура("Успех, Ошибка", Истина, "");

	

КонецФункции



// Получает историю сообщений сессии

// Параметры:

//  СсылкаСессии - Строка - UUID сессии

// Возвращаемое значение:

//  Структура - результат запроса: Данные (Массив), Успех (Булево), Ошибка (Строка)

Функция ПолучитьИсториюСессии(СсылкаСессии) Экспорт
    Попытка
        Сохр = ХранилищеОбщихНастроек.Загрузить("BuddyHistory", СсылкаСессии);
        Если Сохр <> Неопределено И Сохр.Количество() > 0 Тогда
            мИсторияБадди = Сохр;
            Данные = Новый Структура("count, results", мИсторияБадди.Количество(), мИсторияБадди);
            Возврат Новый Структура("Успех, Данные, Ошибка", Истина, Данные, "");
        КонецЕсли;
    Исключение
    КонецПопытки;
    Если мИсторияБадди <> Неопределено И мИсторияБадди.Количество() > 0 Тогда
        Данные = Новый Структура("count, results", мИсторияБадди.Количество(), мИсторияБадди);
        Возврат Новый Структура("Успех, Данные, Ошибка", Истина, Данные, "");
    КонецЕсли;
    // Buddy stateless: не ходим в manager-1c (502), возвращаем пусто или кэш
    Данные = Новый Структура("count, results", 0, Новый Массив);
    Возврат Новый Структура("Успех, Данные, Ошибка", Истина, Данные, "");

	

КонецФункции  



Функция ПолучитьВсеСессии() Экспорт

	

	// Формирование пути

	Путь = "/api/manager-1c/query-console/sessions/";

	

	// Отправка GET-запроса

	Результат = ВыполнитьHTTPЗапрос(Путь, "GET");

	

	// Обработка ответа

	Если Результат.Успех Тогда

		ОтветJSON = ПрочитатьJSONИзСтроки(Результат.Ответ);

		Возврат Новый Структура("Успех, Данные, Ошибка", Истина, ОтветJSON, "");

	Иначе

		Возврат Новый Структура("Успех, Ошибка", Ложь, Результат.Ошибка);

	КонецЕсли;

	

КонецФункции



// Очищает диалог сессии

// Параметры:

//  СсылкаСессии - Строка - UUID сессии

// Возвращаемое значение:

//  Структура - результат запроса: Успех (Булево), Ошибка (Строка)

Функция ОчиститьДиалог(СсылкаСессии) Экспорт
    // Buddy stateless: чистим локальный кэш BuddyHistory, manager-1c не дергаем
    Попытка
        ХранилищеОбщихНастроек.Удалить("BuddyHistory", СсылкаСессии, Неопределено);
    Исключение
    КонецПопытки;
    мИсторияБадди = Новый Массив;
    Возврат Новый Структура("Успех, Ошибка", Истина, "");

	

КонецФункции



// Выполняет запрос для проверки синтаксиса и получения параметров.

// Параметры:

//  ТекстЗапроса - Строка - текст запроса 1С

// Возвращаемое значение:

//  Структура - результат проверки: check_error (Строка), is_error (Булево)

Функция ВыполнитьЗапросДляПроверки(ТекстЗапроса) Экспорт

	

	ЕстьОшибка = Ложь;

	ТекстОшибки = "";

	

	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда

		Возврат Новый Структура("check_error, is_error", "", Ложь);

	КонецЕсли;

	

	Попытка

		Запрос = Новый Запрос;

		Запрос.Текст = ТекстЗапроса;

		

		// Попытка получения параметров (проверка синтаксиса)

		ПараметрыИзЗапроса = Запрос.НайтиПараметры();

		

	Исключение

		ЕстьОшибка = Истина;

		ТекстОшибки = ОписаниеОшибки();

	КонецПопытки;

	

	ТекстОшибки = СтрЗаменить(ТекстОшибки, Лев(ТекстОшибки, 120), "");

	

	Возврат Новый Структура(

		"check_error, is_error",

		ТекстОшибки,

		ЕстьОшибка

	);

	

КонецФункции



// Получает первую ожидающую проверку запроса по конфигурации.

// Параметры:

//  СсылкаКонфигурации - Строка - UUID конфигурации

// Возвращаемое значение:

//  Структура - Успех (Булево), Проверка (Структура|Неопределено), Ошибка (Строка)

Функция ПолучитьОжидающуюПроверкуЗапроса(СсылкаКонфигурации) Экспорт

	

	Путь = "/api/manager-1c/query-console/checks/?status=pending&configuration__ref=" + Строка(СсылкаКонфигурации);

	Результат = ВыполнитьHTTPЗапрос(Путь, "GET");

	Если Не Результат.Успех Тогда

		Возврат Новый Структура("Успех, Проверка, Ошибка", Ложь, Неопределено, Результат.Ошибка);

	КонецЕсли;

	

	Если ПустаяСтрока(Результат.Ответ) Тогда

		Возврат Новый Структура("Успех, Проверка, Ошибка", Истина, Неопределено, "");

	КонецЕсли;

	

	ОтветJSON = ПрочитатьJSONИзСтроки(Результат.Ответ);

	

	Если ТипЗнч(ОтветJSON) = Тип("Массив") Тогда

		Если ОтветJSON.Количество() > 0 Тогда

			Возврат Новый Структура("Успех, Проверка, Ошибка", Истина, ОтветJSON[0], "");

		КонецЕсли;

		Возврат Новый Структура("Успех, Проверка, Ошибка", Истина, Неопределено, "");

	КонецЕсли;

	

	Если ТипЗнч(ОтветJSON) = Тип("Структура")

		И ОтветJSON.Свойство("results")

		И ТипЗнч(ОтветJSON.results) = Тип("Массив") Тогда

		Если ОтветJSON.results.Количество() > 0 Тогда

			Возврат Новый Структура("Успех, Проверка, Ошибка", Истина, ОтветJSON.results[0], "");

		КонецЕсли;

		Возврат Новый Структура("Успех, Проверка, Ошибка", Истина, Неопределено, "");

	КонецЕсли;

	

	Возврат Новый Структура("Успех, Проверка, Ошибка", Ложь, Неопределено, "Неожиданный формат ответа списка проверок.");

	

КонецФункции



// Завершает проверку запроса и отправляет результат в API.

// Параметры:

//  ИдентификаторПроверки - Число - ID проверки

//  ТекстОшибки - Строка - текст ошибки проверки, пустая строка если ошибок нет

// Возвращаемое значение:

//  Структура - Успех (Булево), Данные (Структура), Ошибка (Строка)

Функция ЗавершитьПроверкуЗапроса(ИдентификаторПроверки, ТекстОшибки = "") Экспорт

	

	Путь = "/api/manager-1c/query-console/checks/" + Строка(ИдентификаторПроверки) + "/";

	Данные = Новый Структура;

	Данные.Вставить("status", "completed");

	Данные.Вставить("result_error", Строка(ТекстОшибки));

	

	Результат = ВыполнитьHTTPЗапрос(Путь, "PATCH", Данные);

	Если Результат.Успех Тогда

		Если ПустаяСтрока(Результат.Ответ) Тогда

			Возврат Новый Структура("Успех, Данные, Ошибка", Истина, Новый Структура, "");

		КонецЕсли;

		

		ОтветJSON = ПрочитатьJSONИзСтроки(Результат.Ответ);

		Возврат Новый Структура("Успех, Данные, Ошибка", Истина, ОтветJSON, "");

	КонецЕсли;

	

	Возврат Новый Структура("Успех, Ошибка", Ложь, Результат.Ошибка);

	

КонецФункции



#КонецОбласти



#Область СлужебныеПроцедурыИФункции



// Выполняет HTTP-запрос к API

// Параметры:

//  Путь - Строка - относительный путь API

//  Метод - Строка - HTTP-метод (GET, POST, PATCH)

//  Данные - Структура, Неопределено - данные для отправки в теле запроса (для POST/PATCH)

// Возвращаемое значение:

//  Структура - Ответ (Строка), Успех (Булево), Ошибка (Строка)


// Логирование Aether: файл КаталогВременныхФайлов/aether_debug.log + Сообщить
Функция ЗаписатьЛогAether(Текст) Экспорт
    Сообщить("[AetherLog] " + Текст);
    ЗаписьЖурналаРегистрации("AetherLog", УровеньЖурналаРегистрации.Информация, , , Текст);
    Попытка
        ИмяФайла = КаталогВременныхФайлов() + "aether_debug.log";
        ЗТ = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8, , Истина);
        ЗТ.ДобавитьСтроку(Формат(ТекущаяДата(), "ДФ=''yyyy-MM-dd HH:mm:ss''") + " | " + Текст);
        ЗТ.Закрыть();
    Исключение
    КонецПопытки;
    Попытка
        ЗТ2 = Новый ЗаписьТекста("C:\\Temp\\aether_debug.log", КодировкаТекста.UTF8, , Истина);
        ЗТ2.ДобавитьСтроку(Формат(ТекущаяДата(), "ДФ=''yyyy-MM-dd HH:mm:ss''") + " | " + Текст);
        ЗТ2.Закрыть();
    Исключение
    КонецПопытки;
    Возврат Истина;
КонецФункции

Функция ВыполнитьHTTPЗапрос(Путь, Метод, Данные = Неопределено)

	

	Результат = Новый Структура("Успех, Ответ, Ошибка", Ложь, "", "");

	

	ПараметрыAPI = ПолучитьПараметрыAPI();
	ЗаписатьЛогAether("HTTP ENTER " + Метод + " " + Путь + " host=" + ПараметрыAPI.Хост);

	

	Если ПараметрыAPI.ИспользоватьSSL Тогда

		Соединение = Новый HTTPСоединение(ПараметрыAPI.Хост, ПараметрыAPI.Порт,,,,, Новый ЗащищенноеСоединениеOpenSSL());

	Иначе

		Соединение = Новый HTTPСоединение(ПараметрыAPI.Хост, ПараметрыAPI.Порт);

	КонецЕсли;

	

	// Формирование запроса: 1c-buddy требует LLM_PROXY_KEY в X-API-Key/Bearer/?api_key (AGENTS.md:295, onec_gateway.go:106).

	// Путь уже содержит префикс /api/1c-buddy, шлюз срезает его stripBuddyPrefix.

	ЗапросПуть = Путь;

	// Fallback query param для совместимости с openai/authGuard (только Bearer/?api_key) — дублируем ключ в URL если нет заголовка на прокси

	Если Найти(ЗапросПуть, "?") = 0 Тогда

		ЗапросПуть = ЗапросПуть + "?api_key=" + КодироватьСтроку(ЭтотОбъект.ТокенДоступа, СпособКодированияСтроки.КодировкаURL);

	Иначе

		ЗапросПуть = ЗапросПуть + "&api_key=" + КодироватьСтроку(ЭтотОбъект.ТокенДоступа, СпособКодированияСтроки.КодировкаURL);

	КонецЕсли;

	Запрос = Новый HTTPЗапрос(ЗапросПуть);

	Запрос.Заголовки.Вставить("Content-Type", "application/json");

	// Дублируем во все поддерживаемые заголовки (balancer принимает любой, openai — только Bearer)

	Запрос.Заголовки.Вставить("X-API-Key", ЭтотОбъект.ТокенДоступа);

	Запрос.Заголовки.Вставить("X-LLM-Proxy-Key", ЭтотОбъект.ТокенДоступа);

	Запрос.Заголовки.Вставить("Authorization", "Bearer " + ЭтотОбъект.ТокенДоступа);

	// Для запросов с телом добавляем JSON-данные

	Если (Метод = "POST" Или Метод = "PATCH") И Данные <> Неопределено Тогда

		Запрос.УстановитьТелоИзСтроки(СформироватьJSON(Данные));
	ЗаписатьЛогAether("HTTP body " + Метод + " " + Путь + " : " + Лев(СформироватьJSON(Данные), 800));

	КонецЕсли;

	

	// Выполнение запроса

	Попытка

		ЗаписатьЛогAether("HTTP " + Метод + " https://" + ПараметрыAPI.Хост + ":" + ПараметрыAPI.Порт + Путь + " | токен=" + Лев(ПараметрыAPI.ТокенДоступа,6) + "...");
		Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);
		ЗаписатьЛогAether("HTTP ответ " + Метод + " " + Путь + " -> " + Ответ.КодСостояния + " | тело=" + Лев(Ответ.ПолучитьТелоКакСтроку(), 800));

		

		// Обработка кодов ответа

		Если Ответ.КодСостояния = 200 Или Ответ.КодСостояния = 201 Или Ответ.КодСостояния = 204 Тогда

			Результат.Успех = Истина;

			Результат.Ответ = Ответ.ПолучитьТелоКакСтроку();

		ИначеЕсли Ответ.КодСостояния = 401 Тогда

			Результат.Ошибка = "Ошибка авторизации (401 Unauthorized)";

		ИначеЕсли Ответ.КодСостояния = 404 Тогда

			Результат.Ошибка = "Ресурс не найден (404 Not Found)";
		ИначеЕсли Ответ.КодСостояния = 502 Тогда
			Результат.Ошибка = "Сервер ИИ временно недоступен (502 Bad Gateway). Повторите позже. Апстрим code.1c.ai недоступен (AGENTS.md:324). Тело: " + Лев(Ответ.ПолучитьТелоКакСтроку(), 500);
			ЗаписатьЛогAether("502 Bad Gateway for " + Путь + " -> " + Лев(Ответ.ПолучитьТелоКакСтроку(), 300));

		Иначе

			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();

			ТекстОшибки = ИзвлечьДетальОшибкиИзJsonОтветаAPI(ТелоОтвета);

			Если ПустаяСтрока(ТекстОшибки) Тогда

				Результат.Ошибка = СтрШаблон("Ошибка API: код %1, ответ: %2", Ответ.КодСостояния, ТелоОтвета);

			Иначе

				Результат.Ошибка = ТекстОшибки;

			КонецЕсли;

		КонецЕсли;

		

	Исключение
		Результат.Ошибка = "Ошибка выполнения запроса: " + ОписаниеОшибки();

	КонецПопытки;

	

	Возврат Результат;

	

КонецФункции



// Возвращает параметры подключения к API для выбранного окружения.

Функция ПолучитьПараметрыAPI() Экспорт

	

	// Миграция на 1c-buddy: единый хост astro3d.ru, префикс /api/1c-buddy срезается шлюзом (см. AGENTS.md:288).

	// LLM_PROXY_KEY хранится в ТокенДоступа, заголовок X-API-Key + Bearer (AGENTS.md:295).

	ОкружениеAPI = "prod";

	

	Если ОкружениеAPI = "prod" Тогда

		Возврат Новый Структура("Хост, Порт, ИспользоватьSSL, ТокенДоступа", "astro3d.ru", 443, Истина, ЭтотОбъект.ТокенДоступа);

	ИначеЕсли ОкружениеAPI = "local" Тогда

		Возврат Новый Структура("Хост, Порт, ИспользоватьSSL, ТокенДоступа", "192.168.2.206", 8000, Ложь, ЭтотОбъект.ТокенДоступа); // 127.0.0.1

	КонецЕсли;

	

	Возврат Новый Структура("Хост, Порт, ИспользоватьSSL, ТокенДоступа", "astro3d.ru", 443, Истина, ЭтотОбъект.ТокенДоступа);

	

КонецФункции



// Префикс API 1c-buddy: срезается шлюзом stripBuddyPrefix (onec_gateway.go:127), алиасы /api/onec,/api/1c (AGENTS.md:288)

Функция ПолучитьПрефиксAPI() Экспорт

	Возврат "/api/1c-buddy";

КонецФункции



// Возвращает хост API текущего окружения.

Функция ПолучитьХостAPI() Экспорт

	

	ПараметрыAPI = ПолучитьПараметрыAPI();

	Возврат ПараметрыAPI.Хост;

	

КонецФункции



// Формирует JSON из структуры

// Параметры:

//  Данные - Структура - данные для сериализации

// Возвращаемое значение:

//  Строка - JSON-строка

Функция СформироватьJSON(Данные)

	

	ЗаписьJSON = Новый ЗаписьJSON;

	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, Данные);

	Возврат ЗаписьJSON.Закрыть();

	

КонецФункции



// Читает JSON-строку в структуру

// Параметры:

//  СтрокаJSON - Строка - строка в формате JSON

// Возвращаемое значение:

//  Структура, Массив - результат десериализации

Функция ПрочитатьJSONИзСтроки(СтрокаJSON)

	

	ЧтениеJSON = Новый ЧтениеJSON;

	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);

	Результат = ПрочитатьJSON(ЧтениеJSON);

	ЧтениеJSON.Закрыть();

	Возврат Результат;

	

КонецФункции



// Возвращает осмысленный текст ошибки из JSON-ответа API.

Функция ИзвлечьДетальОшибкиИзJsonОтветаAPI(ТелоJson)

	

	Если ПустаяСтрока(ТелоJson) Тогда

		Возврат "";

	КонецЕсли;

	

	Попытка

		Данные = ПрочитатьJSONИзСтроки(ТелоJson);

		Если ТипЗнч(Данные) = Тип("Строка") Тогда

			Возврат Строка(Данные);

		КонецЕсли;

		Если ТипЗнч(Данные) = Тип("Массив") Тогда

			Возврат ИзвлечьТекстОшибкиИзJSONМассива(Данные);

		КонецЕсли;

		Если ТипЗнч(Данные) = Тип("Структура") Тогда

			Если Данные.Свойство("detail") Тогда

				Возврат Строка(Данные.detail);

			КонецЕсли;

			Если Данные.Свойство("error") Тогда

				Возврат Строка(Данные.error);

			КонецЕсли;

			Если Данные.Свойство("details") Тогда

				Возврат ИзвлечьТекстОшибкиИзJSONЗначения(Данные.details);

			КонецЕсли;

			Если Данные.Свойство("non_field_errors") Тогда

				Возврат ИзвлечьТекстОшибкиИзJSONЗначения(Данные.non_field_errors);

			КонецЕсли;

			Возврат ИзвлечьТекстОшибкиИзJSONСтруктуры(Данные);

		КонецЕсли;

	Исключение

		// Не JSON или иной формат — оставляем разбор вызывающему коду

	КонецПопытки;

	

	Возврат "";

	

КонецФункции



Функция ИзвлечьТекстОшибкиИзJSONЗначения(ЗначениеОшибки)

	

	Если ТипЗнч(ЗначениеОшибки) = Тип("Строка") Тогда

		Возврат Строка(ЗначениеОшибки);

	КонецЕсли;

	Если ТипЗнч(ЗначениеОшибки) = Тип("Массив") Тогда

		Возврат ИзвлечьТекстОшибкиИзJSONМассива(ЗначениеОшибки);

	КонецЕсли;

	Если ТипЗнч(ЗначениеОшибки) = Тип("Структура") Тогда

		Возврат ИзвлечьТекстОшибкиИзJSONСтруктуры(ЗначениеОшибки);

	КонецЕсли;

	Возврат "";

	

КонецФункции



Функция ИзвлечьТекстОшибкиИзJSONМассива(ЗначенияОшибки)

	

	Части = Новый Массив;

	Для Каждого Элемент Из ЗначенияОшибки Цикл

		ТекстЧасти = ИзвлечьТекстОшибкиИзJSONЗначения(Элемент);

		Если ЗначениеЗаполнено(ТекстЧасти) Тогда

			Части.Добавить(ТекстЧасти);

		КонецЕсли;

	КонецЦикла;

	Если Части.Количество() = 0 Тогда

		Возврат "";

	КонецЕсли;

	Возврат СтрСоединить(Части, "; ");

	

КонецФункции



Функция ИзвлечьТекстОшибкиИзJSONСтруктуры(ДанныеОшибки)

	

	Части = Новый Массив;

	Для Каждого Пара Из ДанныеОшибки Цикл

		ТекстЗначения = ИзвлечьТекстОшибкиИзJSONЗначения(Пара.Значение);

		Если ЗначениеЗаполнено(ТекстЗначения) Тогда

			Части.Добавить(Строка(Пара.Ключ) + ": " + ТекстЗначения);

		КонецЕсли;

	КонецЦикла;

	Если Части.Количество() = 0 Тогда

		Возврат "";

	КонецЕсли;

	Возврат СтрСоединить(Части, "; ");

	

КонецФункции



#КонецОбласти



#Область ИнтеграцияБадди

// Миграция с Aether на astro3d.ru/api/1c-buddy (AGENTS.md:288-324)

// Транспорт v1/chat/completions (AGENTS.md:306) + MCP check_1c_code (AGENTS.md:313)



// Возвращает префикс уже с учетом ПолучитьПрефиксAPI() — для удобства

Функция Buddy_Префикс() Экспорт

	Возврат ПолучитьПрефиксAPI();

КонецФункции



// Универсальный вызов OpenAI-совместимого API 1c-buddy

// Параметры: Сообщения - Массив структур {role, content}, Stream - Булево, ConversationId - Строка (metadata.conversation_id)

// Возврат: Структура Успех, Данные, Ответ, Ошибка

Функция Buddy_ChatCompletions(Сообщения, Stream = Ложь, ConversationId = "") Экспорт

	Путь = Buddy_Префикс() + "/v1/chat/completions";

	Данные = Новый Структура;

	Данные.Вставить("model", "1c-buddy");

	Данные.Вставить("messages", Сообщения);

	Данные.Вставить("stream", Stream);

	Если ЗначениеЗаполнено(ConversationId) Тогда

		Мета = Новый Структура;

		Мета.Вставить("conversation_id", Строка(ConversationId));

		Данные.Вставить("metadata", Мета);

	КонецЕсли;

	Результат = ВыполнитьHTTPЗапрос(Путь, "POST", Данные);

	Если Результат.Успех Тогда

		Если ПустаяСтрока(Результат.Ответ) Тогда

			Возврат Новый Структура("Успех, Данные, Ошибка", Истина, Новый Структура, "");

		КонецЕсли;

		Попытка

			ОтветJSON = ПрочитатьJSONИзСтроки(Результат.Ответ);

			Возврат Новый Структура("Успех, Данные, Ответ, Ошибка", Истина, ОтветJSON, Результат.Ответ, "");

		Исключение

			Возврат Новый Структура("Успех, Данные, Ответ, Ошибка", Истина, Новый Структура, Результат.Ответ, "");

		КонецПопытки;

	КонецЕсли;

	// Детализация 500/502 для 1c-buddy (AGENTS.md:324): 500 — нет ONEC_AI_TOKEN, 502 — апстрим code.1c.ai недоступен

	Доп = "";

	Если Найти(Результат.Ошибка, "500") > 0 Тогда

		Доп = " (сервер 1c-buddy: нет ONEC_AI_TOKEN)";

	ИначеЕсли Найти(Результат.Ошибка, "502") > 0 Тогда

		Доп = " (апстрим code.1c.ai недоступен)";

	КонецЕсли;

	Возврат Новый Структура("Успех, Ошибка", Ложь, Результат.Ошибка + Доп);

КонецФункции



// Простой запрос к LLM: Сообщения -> текст ответа
// История — Массив структур {role,text} для окна last N (stateless, без conversation_id)

Функция Buddy_Спросить(ТекстЗапроса, КонтекстСхемы = "", ConversationId = "", ИсторияДляLLM = Неопределено) Экспорт

	Сообщения = Новый Массив;

	Если ЗначениеЗаполнено(КонтекстСхемы) Тогда

		Сообщения.Добавить(Новый Структура("role, content", "system", КонтекстСхемы));

	КонецЕсли;

	// Окно истории: последние 6 пар (12 сообщений), обрезка до 2000 симв каждое чтобы уложиться в 413/токены
	Если ИсторияДляLLM <> Неопределено И ИсторияДляLLM.Количество() > 0 Тогда
		Нач = Макс(0, ИсторияДляLLM.Количество() - 12);
		Для Инд = Нач По ИсторияДляLLM.Количество() - 1 Цикл
			Эл = ИсторияДляLLM[Инд];
			Попытка
				Роль = Эл.role; Текст = Эл.text;
				Если Роль = "user" Или Роль = "assistant" Тогда
					Если СтрДлина(Текст) > 2000 Тогда Текст = Лев(Текст, 2000) + " ... (обрезано)"; КонецЕсли;
					Сообщения.Добавить(Новый Структура("role, content", Роль, Текст));
				КонецЕсли;
			Исключение КонецПопытки;
		КонецЦикла;
	КонецЕсли;

	Сообщения.Добавить(Новый Структура("role, content", "user", ТекстЗапроса));

	Результат = Buddy_ChatCompletions(Сообщения, Ложь, ConversationId);

	Если Не Результат.Успех Тогда

		Возврат Новый Структура("Успех, ТекстОтвета, Ошибка", Ложь, "", Результат.Ошибка);

	КонецЕсли;

	Попытка

		ТекстОтвета = Результат.Данные.choices[0].message.content;

		Возврат Новый Структура("Успех, ТекстОтвета, Ошибка", Истина, Строка(ТекстОтвета), "");

	Исключение

		// fallback на raw Ответ

		Возврат Новый Структура("Успех, ТекстОтвета, Ошибка", Истина, Строка(Результат.Ответ), "");

	КонецПопытки;

КонецФункции



// Проверка моделей (диагностика)

Функция Buddy_ПроверитьДоступность() Экспорт

	Путь = Buddy_Префикс() + "/v1/models";

	Результат = ВыполнитьHTTPЗапрос(Путь, "GET");

	Если Результат.Успех Тогда

		Попытка

			Данные = ПрочитатьJSONИзСтроки(Результат.Ответ);

			Возврат Новый Структура("Успех, Данные, Ошибка", Истина, Данные, "");

		Исключение

			Возврат Новый Структура("Успех, Ответ, Ошибка", Истина, Результат.Ответ, "");

		КонецПопытки;

	КонецЕсли;

	Возврат Новый Структура("Успех, Ошибка", Ложь, Результат.Ошибка);

КонецФункции



// MCP: вызов check_1c_code через /mcp (AGENTS.md:311). Требует 2 шага: initialize + tools/call

// Упрощенный статический путь: шлюз проксирует tools/call напрямую без сессии, но пробуем Streamable HTTP

Функция Buddy_ПроверитьКод(Код, ТипПроверки = "syntax") Экспорт

	// ТипПроверки: syntax|review (AGENTS.md:313)

	Путь = Buddy_Префикс() + "/mcp";

	// 1. initialize

	ДанныеInit = Новый Структура;

	ДанныеInit.Вставить("jsonrpc", "2.0");

	ДанныеInit.Вставить("id", 1);

	ДанныеInit.Вставить("method", "initialize");

	Параметры = Новый Структура;

	Параметры.Вставить("protocolVersion", "2024-11-05");

	Параметры.Вставить("capabilities", Новый Структура);

	Параметры.Вставить("clientInfo", Новый Структура("name, version", "1C-QueryConsole", ВерсияОбъекта()));

	ДанныеInit.Вставить("params", Параметры);

	РезультатInit = ВыполнитьHTTPЗапрос(Путь, "POST", ДанныеInit);

	// Если initialize не нужен (шлюз проксирует без сессии), сразу пробуем tools/call

	ДанныеCall = Новый Структура;

	ДанныеCall.Вставить("jsonrpc", "2.0");

	ДанныеCall.Вставить("id", 2);

	ДанныеCall.Вставить("method", "tools/call");

	ПараметрыCall = Новый Структура;

	ПараметрыCall.Вставить("name", "check_1c_code");

	Аргументы = Новый Структура;

	Аргументы.Вставить("code", Код);

	Аргументы.Вставить("check_type", ТипПроверки);

	ПараметрыCall.Вставить("arguments", Аргументы);

	ДанныеCall.Вставить("params", ПараметрыCall);

	РезультатCall = ВыполнитьHTTPЗапрос(Путь, "POST", ДанныеCall);

	Если РезультатCall.Успех Тогда

		Попытка

			ОтветJSON = ПрочитатьJSONИзСтроки(РезультатCall.Ответ);

			Возврат Новый Структура("Успех, Данные, Ответ, Ошибка", Истина, ОтветJSON, РезультатCall.Ответ, "");

		Исключение

			Возврат Новый Структура("Успех, Ответ, Ошибка", Истина, РезультатCall.Ответ, "");

		КонецПопытки;

	КонецЕсли;

	Возврат Новый Структура("Успех, Ошибка", Ложь, РезультатCall.Ошибка);

КонецФункции



#КонецОбласти



#Область КэшМетаданных

// 2d: хранение только актуальных метаданных (вариант B) - только ХранилищеОбщихНастроек Current, без файла
// Типовая + изменения + активные расширения. Полный Реквизит:Тип всех объектов. Инвалидация по хешу при ПриОткрытии.



Функция КэшМетаданных_КлючОбъекта() Экспорт

	Возврат "AetherAI_MetadataCache";

КонецФункции



Функция КэшМетаданных_КлючНастроекCurrent() Экспорт

	Возврат "Current";

КонецФункции



Функция КэшМетаданных_КлючReports() Экспорт

	Возврат "ReportsCurrent"; // TODO: bulk отчетов, см. 2d

КонецФункции



// Сохраняет актуальные метаданные (сжатые) с перезаписью. JSON вместо XML (~10x меньше)

Функция КэшМетаданных_Сохранить(ДанныеИлиJSON, ВерсияКонфигурации = "", ХешСхемы = "") Экспорт

	Попытка
		Если ТипЗнч(ДанныеИлиJSON) = Тип("Строка") Тогда
			Сжатые = Новый ХранилищеЗначения(ДанныеИлиJSON, Новый СжатиеДанных(9));
			Формат = "json";
		Иначе
			Сжатые = Новый ХранилищеЗначения(ДанныеИлиJSON, Новый СжатиеДанных(9));
			Формат = "xml";
		КонецЕсли;
		СтруктураСохранения = Новый Структура;
		СтруктураСохранения.Вставить("ВерсияКонфигурации", Строка(ВерсияКонфигурации));
		СтруктураСохранения.Вставить("ХешСхемы", Строка(ХешСхемы));
		СтруктураСохранения.Вставить("ДатаВыгрузки", ТекущаяДата());
		СтруктураСохранения.Вставить("Формат", Формат);
		Если Формат = "json" Тогда
			СтруктураСохранения.Вставить("СжатыйJSON", Сжатые);
			СтруктураСохранения.Вставить("СжатыйXML", Неопределено);
		Иначе
			СтруктураСохранения.Вставить("СжатыйXML", Сжатые);
		КонецЕсли;
		СтруктураСохранения.Вставить("ВерсииРасширений", СобратьВерсииРасширений());
		Попытка
			СистИнфо1 = Новый СистемнаяИнформация;
			Платф1 = СистИнфо1.ВерсияПриложения;
		Исключение
			Платф1 = "";
		КонецПопытки;
		СтруктураСохранения.Вставить("ПлатформаВерсия", Платф1);
		СтруктураСохранения.Вставить("ИмяКонфигурации", Метаданные.Имя);
		СтруктураСохранения.Вставить("СинонимКонфигурации", Метаданные.Синоним);
		// Словарь v1 + компакт каталог сокр. (для быстрой отдачи без обхода Метаданные.*)
		Попытка
			СтруктураСохранения.Вставить("ВерсияСловаря", ВерсияСловаря());
			СтруктураСохранения.Вставить("КомпактКаталогСокр", СобратьКраткийКаталог(Истина));
		Исключение КонецПопытки;
		ХранилищеОбщихНастроек.Сохранить(КэшМетаданных_КлючОбъекта(), КэшМетаданных_КлючНастроекCurrent(), СтруктураСохранения);
		Возврат Новый Структура("Успех, Ошибка", Истина, "");
	Исключение
		Возврат Новый Структура("Успех, Ошибка", Ложь, ОписаниеОшибки());
	КонецПопытки;

КонецФункции



Функция КэшМетаданных_Загрузить() Экспорт

	Попытка

		СтруктураСохранения = ХранилищеОбщихНастроек.Загрузить(КэшМетаданных_КлючОбъекта(), КэшМетаданных_КлючНастроекCurrent());

		Если СтруктураСохранения = Неопределено Тогда

			Возврат Новый Структура("Успех, Данные, Ошибка", Ложь, Неопределено, "Кэш пуст");

		КонецЕсли;

		Формат = "";
		Попытка Формат = СтруктураСохранения.Формат; Исключение КонецПопытки;
		Сжатые = Неопределено;
		Если Формат = "json" Тогда
			Попытка Сжатые = СтруктураСохранения.СжатыйJSON; Исключение КонецПопытки;
		Иначе
			Попытка Сжатые = СтруктураСохранения.СжатыйXML; Исключение КонецПопытки;
			Если Сжатые = Неопределено Тогда Попытка Сжатые = СтруктураСохранения.СжатыйJSON; Исключение КонецПопытки; КонецЕсли;
		КонецЕсли;

		Если ТипЗнч(Сжатые) = Тип("ХранилищеЗначения") Тогда

			Данные = Сжатые.Получить();

		Иначе

			Данные = Сжатые;

		КонецЕсли;

		Возврат Новый Структура("Успех, Данные, Структура, Ошибка", Истина, Данные, СтруктураСохранения, "");

	Исключение

		Возврат Новый Структура("Успех, Ошибка", Ложь, ОписаниеОшибки());

	КонецПопытки;

КонецФункции



Функция КэшМетаданных_Очистить() Экспорт

	Попытка

		ХранилищеОбщихНастроек.Удалить(КэшМетаданных_КлючОбъекта(), КэшМетаданных_КлючНастроекCurrent(), Неопределено);

		Возврат Новый Структура("Успех", Истина);

	Исключение

		Возврат Новый Структура("Успех, Ошибка", Ложь, ОписаниеОшибки());

	КонецПопытки;

КонецФункции



Функция СобратьВерсииРасширений() Экспорт
	Результат = Новый Массив;
	Попытка
		Для Каждого Расширение Из РасширенияКонфигурации.Получить() Цикл
			// Только активные расширения (п.5)
			Активно = Ложь;
			Попытка
				Активно = Расширение.Активно;
			Исключение
				Попытка
					Активно = Расширение.Активность;
				Исключение
					Активно = Истина;
				КонецПопытки;
			КонецПопытки;
			Если Не Активно Тогда
				Продолжить;
			КонецЕсли;
			СтруктураРасширения = Новый Структура;
			СтруктураРасширения.Вставить("Имя", Расширение.Имя);
			СтруктураРасширения.Вставить("Версия", Расширение.Версия);
			СтруктураРасширения.Вставить("Активно", Активно);
			Результат.Добавить(СтруктураРасширения);
		КонецЦикла;
	Исключение
	КонецПопытки;
	Возврат Результат;
КонецФункции



Функция ВычислитьХешСхемы(ВерсияКонфигурации = "") Экспорт

	// Простой хеш: Версия + список расширений + версия словаря. Для полноценного — хеш сжатого XML.

	СтрокаДляХеша = Строка(ВерсияКонфигурации) + "|" + Строка(Метаданные.Версия) + "|" + ВерсияСловаря();
	Расширения = СобратьВерсииРасширений();
	// сортировка по имени для детерминизма хеша
	Попытка
		Для i = 0 По Расширения.Количество() - 2 Цикл
			Для j = i + 1 По Расширения.Количество() - 1 Цикл
				Если Расширения[i].Имя > Расширения[j].Имя Тогда
					Вр = Расширения[i]; Расширения[i] = Расширения[j]; Расширения[j] = Вр;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Исключение КонецПопытки;
	Для Каждого Эл Из Расширения Цикл
		СтрокаДляХеша = СтрокаДляХеша + "|" + Эл.Имя + ":" + Эл.Версия;
	КонецЦикла;

	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);

	Хеширование.Добавить(СтрокаДляХеша);

	Возврат СтрЗаменить(Строка(Хеширование.ХешСумма), " ", "");

КонецФункции

Функция КэшМетаданных_Актуален() Экспорт
	Попытка
		Сохр = ХранилищеОбщихНастроек.Загрузить(КэшМетаданных_КлючОбъекта(), КэшМетаданных_КлючНастроекCurrent());
		Если Сохр = Неопределено Тогда
			ЗаписатьЛогAether("КэшМетаданных_Актуален: пусто (первый запуск)");
			Возврат Ложь;
		КонецЕсли;
		Если Не Сохр.Свойство("ХешСхемы") Тогда
			ЗаписатьЛогAether("КэшМетаданных_Актуален: нет ХешСхемы");
			Возврат Ложь;
		КонецЕсли;
		ТекущийХеш = ВычислитьХешСхемы(Метаданные.Версия);
		Рез = Сохр.ХешСхемы = ТекущийХеш;
		Если Не Рез Тогда
			ЗаписатьЛогAether("КэшМетаданных_Актуален: хеш не совпал сохр=" + Сохр.ХешСхемы + " текущ=" + ТекущийХеш);
		Иначе
			ЗаписатьЛогAether("КэшМетаданных_Актуален: хеш совпал " + ТекущийХеш);
		КонецЕсли;
		Возврат Рез;
	Исключение
		ЗаписатьЛогAether("КэшМетаданных_Актуален искл: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция КэшМетаданных_Есть() Экспорт
	Попытка
		Сохр = ХранилищеОбщихНастроек.Загрузить(КэшМетаданных_КлючОбъекта(), КэшМетаданных_КлючНастроекCurrent());
		Возврат Сохр <> Неопределено;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция КэшМетаданных_ОбеспечитьАктуальность() Экспорт
	Если КэшМетаданных_Актуален() Тогда
		Возврат Новый Структура("Успех, Актуален, Ошибка", Истина, Истина, "");
	КонецЕсли;
	Попытка
		JSONСтрока = СобратьJSONСхему();
		Если ПустаяСтрока(JSONСтрока) Тогда
			Возврат Новый Структура("Успех, Ошибка", Ложь, "СобратьJSONСхему вернула пусто");
		КонецЕсли;
		Хеш = ВычислитьХешСхемы(Метаданные.Версия);
		Рез = КэшМетаданных_Сохранить(JSONСтрока, Метаданные.Версия, Хеш);
		Если Рез.Успех Тогда
			ЗаписатьЛогAether("КэшМетаданных_ОбеспечитьАктуальность JSON длина=" + СтрДлина(JSONСтрока) + " хеш=" + Хеш);
			Возврат Новый Структура("Успех, Актуален, Ошибка", Истина, Ложь, "");
		Иначе
			Возврат Новый Структура("Успех, Ошибка", Ложь, Рез.Ошибка);
		КонецЕсли;
	Исключение
		Возврат Новый Структура("Успех, Ошибка", Ложь, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

Функция ОписаниеТипаСтрокой(ОписаниеТипов) Экспорт
	Если ОписаниеТипов = Неопределено Тогда
		Возврат "Неопределено";
	КонецЕсли;
	Попытка
		Типы = ОписаниеТипов.Типы();
		Если Типы.Количество() = 0 Тогда
			Возврат "Неопределено";
		КонецЕсли;
		Части = Новый Массив;
		Для Каждого Т Из Типы Цикл
			Части.Добавить(Строка(Т));
		КонецЦикла;
		Стр = СтрСоединить(Части, ", ");
		Если ОписаниеТипов.СодержитТип(Тип("Строка")) Тогда
			Попытка
				Кв = ОписаниеТипов.КвалификаторыСтроки.Длина;
				Если Кв > 0 Тогда Стр = Стр + "(" + Кв + ")"; КонецЕсли;
			Исключение КонецПопытки;
		КонецЕсли;
		Возврат Стр;
	Исключение
		Возврат Строка(ОписаниеТипов);
	КонецПопытки;
КонецФункции

#Область JSONСхема
Функция СобратьJSONСхему() Экспорт
	// Компакт JSON вместо XML: {"v":"3.0.204.22","p":"8.3.27","ext":[...],"dict":1,"objs":[{"p":"Д.","n":"ПутевойЛист","s":"...","f":[...]}]}
	Попытка
		Объекты = Новый Массив;
		СлПреф = СловарьПрефиксов();
		Проц = Новый Массив;
		Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Документы, "Документ"));
		Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Справочники, "Справочник"));
		Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыСведений, "РегистрСведений"));
		Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыНакопления, "РегистрНакопления"));
		Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыБухгалтерии, "РегистрБухгалтерии"));
		Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.ПланыВидовХарактеристик, "ПланВидовХарактеристик"));
		Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Перечисления, "Перечисление"));
		Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.БизнесПроцессы, "БизнесПроцесс"));
		Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Задачи, "Задача"));
		Для Каждого Эл Из Проц Цикл
			Колл = Эл.Коллекция; Преф = Эл.Префикс;
			СокрПреф = ?(СлПреф.Получить(Преф) <> Неопределено, СлПреф.Получить(Преф), Преф + ".");
			Для Каждого ОбъектМД Из Колл Цикл
				Попытка
					Поля = Новый Массив;
					Попытка Для Каждого Рекв Из ОбъектМД.Реквизиты Цикл Поля.Добавить(Новый Структура("n,t", Рекв.Имя, ОписаниеТипаСокращенно(Рекв.Тип))); КонецЦикла; Исключение КонецПопытки;
					Попытка Для Каждого Изм Из ОбъектМД.Измерения Цикл Поля.Добавить(Новый Структура("n,t", Изм.Имя, ОписаниеТипаСокращенно(Изм.Тип))); КонецЦикла; Исключение КонецПопытки;
					Попытка Для Каждого Рес Из ОбъектМД.Ресурсы Цикл Поля.Добавить(Новый Структура("n,t", Рес.Имя, ОписаниеТипаСокращенно(Рес.Тип))); КонецЦикла; Исключение КонецПопытки;
					Попытка Для Каждого ТЧ Из ОбъектМД.ТабличныеЧасти Цикл
						ТЧПоля = Новый Массив; Для Каждого РК Из ТЧ.Реквизиты Цикл ТЧПоля.Добавить(Новый Структура("n,t", РК.Имя, ОписаниеТипаСокращенно(РК.Тип))); КонецЦикла;
						Поля.Добавить(Новый Структура("n,t,sub", ТЧ.Имя, "", ТЧПоля));
					КонецЦикла; Исключение КонецПопытки;
					// Движения документа -> регистры проводок (для ответа "в какие регистры")
					Движ = Новый Массив;
					Попытка Для Каждого Рег Из ОбъектМД.Движения Цикл
						Попытка Движ.Добавить(Строка(Рег.ПолноеИмя())); Исключение Попытка Движ.Добавить(Рег.Имя); Исключение КонецПопытки; КонецПопытки;
					КонецЦикла; Исключение КонецПопытки;
					Син = "";
					Попытка Син = ОбъектМД.Синоним; Исключение КонецПопытки;
					Структ = Новый Структура("p,n,s,f", СокрПреф, ОбъектМД.Имя, Син, Поля);
					Если Движ.Количество() > 0 Тогда Структ.Вставить("mov", Движ); КонецЕсли;
					Объекты.Добавить(Структ);
				Исключение КонецПопытки;
			КонецЦикла;
		КонецЦикла;
		Корень = Новый Структура;
		Попытка СистИнфо = Новый СистемнаяИнформация; Платф = СистИнфо.ВерсияПриложения; Исключение Платф = ""; КонецПопытки;
		Корень.Вставить("v", Строка(Метаданные.Версия));
		Корень.Вставить("p", Платф);
		Корень.Вставить("cfg", Метаданные.Имя);
		Корень.Вставить("dict", ВерсияСловаря());
		Корень.Вставить("ext", СобратьВерсииРасширений());
		Корень.Вставить("objs", Объекты);
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, Корень);
		Возврат Запись.Закрыть();
	Исключение
		Возврат "";
	КонецПопытки;
КонецФункции
#КонецОбласти

#Область СловарьСокращений
// Обязательно со схемой — ИИ без словаря не поймет Д./С./РС.

Функция СловарьПрефиксов() Экспорт
	Сл = Новый Соответствие;
	Сл.Вставить("Документ", "Д.");
	Сл.Вставить("Справочник", "С.");
	Сл.Вставить("РегистрСведений", "РС.");
	Сл.Вставить("РегистрНакопления", "РН.");
	Сл.Вставить("РегистрБухгалтерии", "РБ.");
	Сл.Вставить("ПланВидовХарактеристик", "ПВХ.");
	Сл.Вставить("Перечисление", "П.");
	Сл.Вставить("БизнесПроцесс", "БП.");
	Сл.Вставить("Задача", "З.");
	Возврат Сл;
КонецФункции

Функция СловарьПрефиксовТекст() Экспорт
	Возврат "Д.=Документ, С.=Справочник, РС.=РегистрСведений, РН.=РегистрНакопления, РБ.=РегистрБухгалтерии, ПВХ.=ПланВидовХарактеристик, П.=Перечисление, БП.=БизнесПроцесс, З.=Задача";
КонецФункции

Функция СловарьТипов() Экспорт
	Сл = Новый Соответствие;
	Сл.Вставить("Строка", "С");
	Сл.Вставить("Число", "Ч");
	Сл.Вставить("Дата", "Д");
	Сл.Вставить("Булево", "Б");
	Сл.Вставить("ХранилищеЗначения", "ХЗ");
	Сл.Вставить("УникальныйИдентификатор", "УИ");
	Сл.Вставить("СправочникСсылка", "Сс");
	Сл.Вставить("ДокументСсылка", "Дс");
	Сл.Вставить("ПеречислениеСсылка", "Пс");
	Сл.Вставить("ПланВидовХарактеристикСсылка", "ПВХс");
	Сл.Вставить("РегистрСведенийСсылка", "РСс");
	Сл.Вставить("БизнесПроцессСсылка", "БПс");
	Сл.Вставить("ЗадачаСсылка", "Зс");
	Возврат Сл;
КонецФункции

Функция СловарьТиповТекст() Экспорт
	Возврат "С=Строка, Ч=Число, Д=Дата, Б=Булево, ХЗ=ХранилищеЗначения, УИ=УникальныйИдентификатор, Сс=СправочникСсылка, Дс=ДокументСсылка, Пс=ПеречислениеСсылка, ПВХс=ПланВидовХарактеристикСсылка";
КонецФункции

Функция ВерсияСловаря() Экспорт
	Возврат "1";
КонецФункции

Функция ОписаниеТипаСокращенно(ОписаниеТипов) Экспорт
	Если ОписаниеТипов = Неопределено Тогда Возврат "Неопределено"; КонецЕсли;
	Попытка
		Типы = ОписаниеТипов.Типы();
		Если Типы.Количество() = 0 Тогда Возврат "Неопределено"; КонецЕсли;
		СлТ = СловарьТипов();
		Части = Новый Массив;
		Для Каждого Т Из Типы Цикл
			ИмяТипа = Строка(Т);
			// Заменяем длинные имена типов на сокращения по словарю
			Для Каждого КЗ Из СлТ Цикл
				Если Найти(ИмяТипа, КЗ.Ключ) = 1 Тогда
					ИмяТипа = СтрЗаменить(ИмяТипа, КЗ.Ключ, КЗ.Значение);
					Прервать;
				ИначеЕсли Найти(ИмяТипа, КЗ.Ключ + ".") > 0 Тогда
					ИмяТипа = СтрЗаменить(ИмяТипа, КЗ.Ключ, КЗ.Значение);
				КонецЕсли;
			КонецЦикла;
			Части.Добавить(ИмяТипа);
		КонецЦикла;
		Стр = СтрСоединить(Части, ", ");
		Если ОписаниеТипов.СодержитТип(Тип("Строка")) Тогда
			Попытка Кв = ОписаниеТипов.КвалификаторыСтроки.Длина; Если Кв > 0 Тогда Стр = Стр + "(" + Кв + ")"; КонецЕсли; Исключение КонецПопытки;
		ИначеЕсли ОписаниеТипов.СодержитТип(Тип("Число")) Тогда
			Попытка КвЧ = ОписаниеТипов.КвалификаторыЧисла; Если КвЧ.Разрядность > 0 Тогда Стр = Стр + "(" + КвЧ.Разрядность + "," + КвЧ.РазрядностьДробнойЧасти + ")"; КонецЕсли; Исключение КонецПопытки;
		КонецЕсли;
		Возврат Стр;
	Исключение
		Возврат Строка(ОписаниеТипов);
	КонецПопытки;
КонецФункции

Функция ТекстСловаряДляИИ() Экспорт
	Возврат "Словарь префиксов: " + СловарьПрефиксовТекст() + Символы.ПС + "Словарь типов: " + СловарьТиповТекст() + " (пример: С(100)=Строка 100, Ч(10.2)=Число) ";
КонецФункции
#КонецОбласти

Функция СобратьТекстовуюСхемуМетаданных() Экспорт
	СтрСхема = "";
	Попытка
		СистИнфо = Новый СистемнаяИнформация;
		СтрСхема = СтрСхема + "Платформа: " + СистИнфо.ВерсияПриложения + Символы.ПС;
	Исключение
		СтрСхема = СтрСхема + "Платформа: ?" + Символы.ПС;
	КонецПопытки;
	Попытка
		СтрСхема = СтрСхема + "Конфигурация: " + Метаданные.Имя + " (" + Метаданные.Синоним + ") версия " + Метаданные.Версия + Символы.ПС;
	Исключение КонецПопытки;
	СтрСхема = СтрСхема + "Дата: " + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd HH:mm:ss") + Символы.ПС;
	Попытка
		Расш = СобратьВерсииРасширений();
		Если Расш.Количество() > 0 Тогда
			СтрСхема = СтрСхема + "Активные расширения: ";
			Для Каждого Р Из Расш Цикл
				СтрСхема = СтрСхема + Р.Имя + ":" + Р.Версия + "; ";
			КонецЦикла;
			СтрСхема = СтрСхема + Символы.ПС;
		Иначе
			СтрСхема = СтрСхема + "Активные расширения: нет" + Символы.ПС;
		КонецЕсли;
	Исключение КонецПопытки;
	СтрСхема = СтрСхема + "--- Схема метаданных (Реквизит:Тип) ---" + Символы.ПС;
	ПроцОбработать = Новый Массив;
	// Документы первыми — иначе при усечении 12К/413 Документы не доходят до ИИ (кейс "Путевой лист трактора")
	ПроцОбработать.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Документы, "Документ"));
	ПроцОбработать.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Справочники, "Справочник"));
	ПроцОбработать.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыСведений, "РегистрСведений"));
	ПроцОбработать.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыНакопления, "РегистрНакопления"));
	ПроцОбработать.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыБухгалтерии, "РегистрБухгалтерии"));
	ПроцОбработать.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.ПланыВидовХарактеристик, "ПланВидовХарактеристик"));
	ПроцОбработать.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Перечисления, "Перечисление"));
	ПроцОбработать.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.БизнесПроцессы, "БизнесПроцесс"));
	ПроцОбработать.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Задачи, "Задача"));
	Для Каждого Эл Из ПроцОбработать Цикл
		Колл = Эл.Коллекция; Преф = Эл.Префикс;
		Для Каждого ОбъектМД Из Колл Цикл
			Попытка
				СтрСхема = СтрСхема + Преф + "." + ОбъектМД.Имя + ": ";
				Поля = Новый Массив;
				Попытка
					Для Каждого Рекв Из ОбъектМД.Реквизиты Цикл
						Поля.Добавить(Рекв.Имя + ":" + ОписаниеТипаСтрокой(Рекв.Тип));
					КонецЦикла;
				Исключение КонецПопытки;
				Попытка
					Для Каждого Изм Из ОбъектМД.Измерения Цикл
						Поля.Добавить(Изм.Имя + ":" + ОписаниеТипаСтрокой(Изм.Тип));
					КонецЦикла;
				Исключение КонецПопытки;
				Попытка
					Для Каждого Рес Из ОбъектМД.Ресурсы Цикл
						Поля.Добавить(Рес.Имя + ":" + ОписаниеТипаСтрокой(Рес.Тип));
					КонецЦикла;
				Исключение КонецПопытки;
				Попытка
					Для Каждого Рекв Из ОбъектМД.РеквизитыАдреса Цикл
						Поля.Добавить(Рекв.Имя + ":" + ОписаниеТипаСтрокой(Рекв.Тип));
					КонецЦикла;
				Исключение КонецПопытки;
				Попытка
					Для Каждого ТЧ Из ОбъектМД.ТабличныеЧасти Цикл
						ТЧПоля = Новый Массив;
						Для Каждого РК Из ТЧ.Реквизиты Цикл
							ТЧПоля.Добавить(РК.Имя + ":" + ОписаниеТипаСтрокой(РК.Тип));
						КонецЦикла;
						Поля.Добавить(ТЧ.Имя + "{" + СтрСоединить(ТЧПоля, ", ") + "}");
					КонецЦикла;
				Исключение КонецПопытки;
				Если Поля.Количество() > 0 Тогда
					СтрСхема = СтрСхема + СтрСоединить(Поля, ", ");
				Иначе
					СтрСхема = СтрСхема + "(нет реквизитов)";
				КонецЕсли;
				СтрСхема = СтрСхема + Символы.ПС;
				Если СтрДлина(СтрСхема) > 26000 Тогда
					СтрСхема = СтрСхема + "... (схема усечена до 26К, полный кэш в ХранилищеОбщихНастроек Current, лимит 413)" + Символы.ПС;
					Прервать;
				КонецЕсли;
			Исключение КонецПопытки;
		КонецЦикла;
		Если СтрДлина(СтрСхема) > 26000 Тогда Прервать; КонецЕсли;
	КонецЦикла;
	Возврат СтрСхема;
КонецФункции

Функция СобратьКраткийКаталог(Сокращенно = Истина) Экспорт
	// Сокращенно: Д./С./РС. + синоним оставляем
	Каталог = "";
	СлПреф = ?(Сокращенно, СловарьПрефиксов(), Неопределено);
	ПроцКаталог = Новый Массив;
	ПроцКаталог.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Документы, "Документ"));
	ПроцКаталог.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Справочники, "Справочник"));
	ПроцКаталог.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыСведений, "РегистрСведений"));
	ПроцКаталог.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыНакопления, "РегистрНакопления"));
	ПроцКаталог.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыБухгалтерии, "РегистрБухгалтерии"));
	ПроцКаталог.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.ПланыВидовХарактеристик, "ПланВидовХарактеристик"));
	ПроцКаталог.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Перечисления, "Перечисление"));
	ПроцКаталог.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.БизнесПроцессы, "БизнесПроцесс"));
	ПроцКаталог.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Задачи, "Задача"));
	Для Каждого Эл Из ПроцКаталог Цикл
		Колл = Эл.Коллекция; Преф = Эл.Префикс;
		СокрПреф = ?(Сокращенно И СлПреф <> Неопределено И СлПреф.Получить(Преф) <> Неопределено, СлПреф.Получить(Преф), Преф + ".");
		Для Каждого ОбъектМД Из Колл Цикл
			Попытка
				Каталог = Каталог + СокрПреф + ОбъектМД.Имя;
				Попытка Если ЗначениеЗаполнено(ОбъектМД.Синоним) Тогда Каталог = Каталог + " (" + ОбъектМД.Синоним + ")"; КонецЕсли; Исключение КонецПопытки;
				Каталог = Каталог + Символы.ПС;
			Исключение КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	Возврат Каталог;
КонецФункции

Функция ПолучитьДеталиОбъектов(МассивИмен, Сокращенно = Истина) Экспорт
	// МассивИмен: ["Документ.ПоступлениеТоваров","РегистрНакопления.ТоварыНаСкладах"] или сокращенные ["Д.ПоступлениеТоваров"]
	Если МассивИмен = Неопределено Или МассивИмен.Количество() = 0 Тогда Возврат ""; КонецЕсли;
	// Нормализуем: поддержка как полных, так и сокращенных имен
	СлПреф = СловарьПрефиксов();
	ОбратныйСл = Новый Соответствие;
	Для Каждого КЗ Из СлПреф Цикл ОбратныйСл.Вставить(НРег(КЗ.Значение), КЗ.Ключ); КонецЦикла;
	// карта сокращенное -> полное для поиска
	НормИмена = Новый Соответствие;
	Для Каждого Н Из МассивИмен Цикл
		Попытка
			Ч = СокрЛП(Н);
			ПозТоч = Найти(Ч, ".");
			Если ПозТоч > 0 Тогда
				ПрефЧасть = Лев(Ч, ПозТоч);
				ИмяЧасть = Сред(Ч, ПозТоч + 1);
				ПолныйПреф = ОбратныйСл.Получить(НРег(ПрефЧасть));
				Если ПолныйПреф <> Неопределено Тогда Ч = ПолныйПреф + "." + ИмяЧасть; КонецЕсли;
			КонецЕсли;
			НормИмена.Вставить(НРег(Ч), Истина);
			// также кладем сокращенный вариант для сравнения с СобратьКраткийКаталог
			НормИмена.Вставить(НРег(СокрЛП(Н)), Истина);
		Исключение КонецПопытки;
	КонецЦикла;
	Детали = "";
	Проц = Новый Массив;
	Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Документы, "Документ"));
	Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Справочники, "Справочник"));
	Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыСведений, "РегистрСведений"));
	Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыНакопления, "РегистрНакопления"));
	Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.РегистрыБухгалтерии, "РегистрБухгалтерии"));
	Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.ПланыВидовХарактеристик, "ПланВидовХарактеристик"));
	Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Перечисления, "Перечисление"));
	Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.БизнесПроцессы, "БизнесПроцесс"));
	Проц.Добавить(Новый Структура("Коллекция, Префикс", Метаданные.Задачи, "Задача"));
	Для Каждого Эл Из Проц Цикл
		Колл = Эл.Коллекция; Преф = Эл.Префикс;
		СокрПреф = ?(Сокращенно И СлПреф.Получить(Преф) <> Неопределено, СлПреф.Получить(Преф), Преф + ".");
		Для Каждого ОбъектМД Из Колл Цикл
			Полное = Преф + "." + ОбъектМД.Имя;
			СокрПолное = СокрПреф + ОбъектМД.Имя;
			Если Не (НормИмена.Получить(НРег(Полное)) = Истина Или НормИмена.Получить(НРег(СокрПолное)) = Истина) Тогда Продолжить; КонецЕсли;
			Попытка
				Стр = ?(Сокращенно, СокрПолное, Полное) + ": ";
				Поля = Новый Массив;
				Попытка Для Каждого Рекв Из ОбъектМД.Реквизиты Цикл Поля.Добавить(Рекв.Имя + ":" + ?(Сокращенно, ОписаниеТипаСокращенно(Рекв.Тип), ОписаниеТипаСтрокой(Рекв.Тип))); КонецЦикла; Исключение КонецПопытки;
				Попытка Для Каждого Изм Из ОбъектМД.Измерения Цикл Поля.Добавить(Изм.Имя + ":" + ?(Сокращенно, ОписаниеТипаСокращенно(Изм.Тип), ОписаниеТипаСтрокой(Изм.Тип))); КонецЦикла; Исключение КонецПопытки;
				Попытка Для Каждого Рес Из ОбъектМД.Ресурсы Цикл Поля.Добавить(Рес.Имя + ":" + ?(Сокращенно, ОписаниеТипаСокращенно(Рес.Тип), ОписаниеТипаСтрокой(Рес.Тип))); КонецЦикла; Исключение КонецПопытки;
				Попытка Для Каждого Рекв Из ОбъектМД.РеквизитыАдреса Цикл Поля.Добавить(Рекв.Имя + ":" + ?(Сокращенно, ОписаниеТипаСокращенно(Рекв.Тип), ОписаниеТипаСтрокой(Рекв.Тип))); КонецЦикла; Исключение КонецПопытки;
				Попытка Для Каждого ТЧ Из ОбъектМД.ТабличныеЧасти Цикл
					ТЧПоля = Новый Массив; Для Каждого РК Из ТЧ.Реквизиты Цикл ТЧПоля.Добавить(РК.Имя + ":" + ?(Сокращенно, ОписаниеТипаСокращенно(РК.Тип), ОписаниеТипаСтрокой(РК.Тип))); КонецЦикла;
					Поля.Добавить(ТЧ.Имя + "{" + СтрСоединить(ТЧПоля, ", ") + "}");
				КонецЦикла; Исключение КонецПопытки;
				// Движения для ответа про проводки
				Попытка
					Движ = Новый Массив;
					Для Каждого Рег Из ОбъектМД.Движения Цикл
						Попытка Движ.Добавить(Строка(Рег.ПолноеИмя())); Исключение Попытка Движ.Добавить(Рег.Имя); Исключение КонецПопытки; КонецПопытки;
					КонецЦикла;
					Если Движ.Количество() > 0 Тогда Поля.Добавить("Движения: " + СтрСоединить(Движ, ", ")); КонецЕсли;
				Исключение КонецПопытки;
				Если Поля.Количество() > 0 Тогда Стр = Стр + СтрСоединить(Поля, ", "); Иначе Стр = Стр + "(нет реквизитов)"; КонецЕсли;
				Детали = Детали + Стр + Символы.ПС;
				Если СтрДлина(Детали) > 18000 Тогда Детали = Детали + "... (детали усечены 18К)" + Символы.ПС; Прервать; КонецЕсли;
			Исключение КонецПопытки;
		КонецЦикла;
		Если СтрДлина(Детали) > 18000 Тогда Прервать; КонецЕсли;
	КонецЦикла;
	Возврат Детали;
КонецФункции

Функция ПолучитьКонтекстСхемыДляИИ(ТекстЗапроса = "") Экспорт
	// LEGACY: оставлен для совместимости, теперь вызывает компакт+query-aware, но ОтправитьСообщение использует новые ПолучитьКонтекст* напрямую
	Возврат ПолучитьКонтекстСхемыКомпакт(ТекстЗапроса);
КонецФункции

Функция ПолучитьКонтекстСхемыКомпакт(ТекстЗапроса = "") Экспорт
	Попытка СистИнфо2 = Новый СистемнаяИнформация; Платф = СистИнфо2.ВерсияПриложения; Исключение Платф = "?"; КонецПопытки;
	Заголовок = "Ты — 1С:Напарник, помощник по запросам 1С. Платформа " + Платф + ", конфигурация " + Метаданные.Имя + " (" + Метаданные.Синоним + ") версия " + Метаданные.Версия + ", текущая дата " + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd HH:mm:ss") + ".";
	СловарьТекст = ТекстСловаряДляИИ();
	Инструкция = " ВАЖНО: Отвечай ТОЛЬКО на основе КРАТКОГО КАТАЛОГА ниже. ЗАПРЕЩЕНО вызывать Search_ITS/Fetch_ITS/FindSimilar_in_Project/GetProjects/ITS — сессии проекта нет. Не пиши 'Давайте поищем' в цикле. Каталог использует СОКРАЩЕНИЯ из словаря выше. Если для ответа нужны поля/реквизиты — верни РОВНО одну строку вида NEED: Д.Имя1, РС.Имя2 (сокращенные префиксы из словаря, через запятую) и я пришлю детали вторым сообщением. Если каталог уже покрывает вопрос — отвечай сразу без NEED. Не выдумывай объекты, не говори 'не существует' если имя есть в каталоге.";
	Каталог = СобратьКраткийКаталог(Истина);
	// query-aware приоритет: релевантные строки в начало
	Если ЗначениеЗаполнено(ТекстЗапроса) И СтрДлина(Каталог) > 8000 Тогда
		Попытка
			Ключи = Новый Массив;
			НКТ = НРег(ТекстЗапроса);
			Для Каждого Слово Из СтрРазделить(НКТ, " ,.;:" + Символы.ПС + Символы.Таб) Цикл Если СтрДлина(Слово) >= 3 Тогда Ключи.Добавить(Слово); КонецЕсли; КонецЦикла;
			Если Ключи.Количество() > 0 Тогда
				Строки = СтрРазделить(Каталог, Символы.ПС);
				Приор = Новый Массив; Остальн = Новый Массив;
				Для Каждого Стр Из Строки Цикл
					Если ПустаяСтрока(СокрЛП(Стр)) Тогда Продолжить; КонецЕсли;
					Низ = НРег(Стр);
					Попал = Ложь;
					Для Каждого К Из Ключи Цикл Если Найти(Низ, К) > 0 Тогда Попал = Истина; Прервать; КонецЕсли; КонецЦикла;
					Если Попал Тогда Приор.Добавить(Стр); Иначе Остальн.Добавить(Стр); КонецЕсли;
				КонецЦикла;
				Если Приор.Количество() > 0 Тогда
					Каталог = СтрСоединить(Приор, Символы.ПС) + Символы.ПС + СтрСоединить(Остальн, Символы.ПС);
					ЗаписатьЛогAether("ПолучитьКонтекстСхемыКомпакт приоритет: " + СтрСоединить(Ключи, ",") + " попали=" + Приор.Количество());
				КонецЕсли;
			КонецЕсли;
		Исключение КонецПопытки;
	КонецЕсли;
	Результат = Заголовок + Символы.ПС + СловарьТекст + Символы.ПС + Инструкция + Символы.ПС + "--- Краткий каталог (сокр., синонимы сохранены) ---" + Символы.ПС + Каталог;
	Если СтрДлина(Результат) > 16000 Тогда Результат = Лев(Результат, 16000) + Символы.ПС + "... (каталог усечен, полный в кэше)"; КонецЕсли;
	ЗаписатьЛогAether("ПолучитьКонтекстСхемыКомпакт: длина=" + СтрДлина(Результат) + " словарь v" + ВерсияСловаря() + " запрос=" + Лев(ТекстЗапроса, 80));
	Возврат Результат;
КонецФункции

Функция НайтиРелевантныеОбъектыПоЗапросу(ТекстЗапроса, Лимит = 8) Экспорт
	Результат = Новый Массив;
	Если ПустаяСтрока(ТекстЗапроса) Тогда Возврат Результат; КонецЕсли;
	Ключи = Новый Массив;
	НК = НРег(ТекстЗапроса);
	Для Каждого Слово Из СтрРазделить(НК, " ,.;:" + Символы.ПС + Символы.Таб) Цикл
		Если СтрДлина(Слово) >= 3 Тогда Ключи.Добавить(Слово); КонецЕсли;
	КонецЦикла;
	Если Ключи.Количество() = 0 Тогда Возврат Результат; КонецЕсли;
	КаталогСтр = СобратьКраткийКаталог();
	Строки = СтрРазделить(КаталогСтр, Символы.ПС);
	Для Каждого Стр Из Строки Цикл
		Если ПустаяСтрока(СокрЛП(Стр)) Тогда Продолжить; КонецЕсли;
		Низ = НРег(Стр);
		Для Каждого К Из Ключи Цикл
			Если Найти(Низ, К) > 0 Тогда
				// вырезаем имя до пробела/скобки
				ПозПроб = Найти(Стр, " ");
				ПозСкоб = Найти(Стр, "(");
				Поз = 0;
				Если ПозПроб > 0 И ПозСкоб > 0 Тогда Поз = Мин(ПозПроб, ПозСкоб); ИначеЕсли ПозПроб > 0 Тогда Поз = ПозПроб; ИначеЕсли ПозСкоб > 0 Тогда Поз = ПозСкоб; КонецЕсли;
				Имя = ?(Поз > 0, СокрЛП(Лев(Стр, Поз - 1)), СокрЛП(Стр));
				Если Найти(Имя, ".") > 0 Тогда Результат.Добавить(Имя); КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Результат.Количество() >= Лимит Тогда Прервать; КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПолучитьКонтекстСхемыДетали(МассивИмен) Экспорт
	Попытка СистИнфо2 = Новый СистемнаяИнформация; Платф = СистИнфо2.ВерсияПриложения; Исключение Платф = "?"; КонецПопытки;
	Заголовок = "Детали по запросу NEED (Платформа " + Платф + ", " + Метаданные.Имя + " " + Метаданные.Версия + ") v" + ВерсияСловаря() + ":";
	СловарьТекст = ТекстСловаряДляИИ();
	Детали = ПолучитьДеталиОбъектов(МассивИмен, Истина);
	Если ПустаяСтрока(Детали) Тогда Детали = "(объекты не найдены: " + СтрСоединить(МассивИмен, ", ") + ")"; КонецЕсли;
	Результат = Заголовок + Символы.ПС + СловарьТекст + Символы.ПС + Детали;
	Если СтрДлина(Результат) > 18000 Тогда Результат = Лев(Результат, 18000) + Символы.ПС + "... (усечено)"; КонецЕсли;
	ЗаписатьЛогAether("ПолучитьКонтекстСхемыДетали: " + СтрСоединить(МассивИмен, ", ") + " длина=" + СтрДлина(Результат));
	Возврат Результат;
КонецФункции

#КонецОбласти



#Область ОбработкаЧата

Функция СформироватьHTMLЧата(История, ПоказыватьВремя = Истина) Экспорт



    HTML = "<!DOCTYPE html><html><head>" +

        "<meta charset='utf-8'>" +

        // Подключение библиотек для markdown и подсветки синтаксиса

        "<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/highlight.js@11.9.0/styles/github-dark.min.css'>" +

        "<style>" +

        " body { font-family: Segoe UI, sans-serif; margin: 0; background: #f5f5f5; height: 100vh; display: flex; flex-direction: column; }" +

        " .container {" +

        "   flex: 1;" +

        "   overflow-y: auto;" +

        "   padding: 16px;" +

        "   display: flex;" +

        "   flex-direction: column;" +

        " }" +

        " .message { margin: 8px 0; padding: 10px 12px; border-radius: 12px; max-width: 80%; word-wrap: break-word; font-size: 13px; line-height: 1.35; }" +

        " .user { background: #0078D4; color: white; align-self: flex-end; margin-left: auto; }" +

        " .bot { background: #E5E5EA; color: black; align-self: flex-start; }" +

        " .time { font-size: 0.8em; opacity: 0.7; margin-top: 4px; }" +



        // статус ИИ

        " .status { font-size: 0.75em; opacity: 0.8; margin-top: 4px; display: inline-flex; align-items: center; gap: 6px; color: #6b7280; }" +

        " .status-dot { " +

        "   width: 6px;" +

        "   height: 6px;" +

        "   border-radius: 999px;" +

        "   background: #10B981;" +

        "   flex-shrink: 0;" +

        "   margin-right: 2px;" + // небольшой отступ после точки

        "   animation: statusPulse 1.2s ease-in-out infinite;" + // анимация

        " }" +



        // простая «моргающая» анимация

        " @keyframes statusPulse {" +

        "   0% { opacity: 0.3; transform: scale(1); }" +

        "   50% { opacity: 1; transform: scale(1.2); }" +

        "   100% { opacity: 0.3; transform: scale(1); }" +

        " }" +



        // Стили для markdown контента

        " .markdown-content { min-width: 0; overflow-wrap: anywhere; word-break: break-word; }" +

        " .markdown-content pre { background: rgba(15, 23, 42, 0.6); border: 1px solid rgba(255,255,255,0.1); padding: 0.75rem; border-radius: 0.5rem; overflow: auto; margin: 0.5rem 0; }" +

        " .markdown-content code { font-family: ui-monospace, SFMono-Regular, Menlo, Monaco, Consolas, 'Liberation Mono', 'Courier New', monospace; font-size: 0.875rem; }" +

        " .markdown-content pre code { background: transparent; padding: 0; border: none; }" +



        "</style>" +

        "</head>" +

        "<body>" +

        "<div class='container' id='messages'>";



    // === История сообщений ===

    Для Каждого Сообщение Из История Цикл

        

        Роль = НРег(Сообщение.is_user);



        // Основной текст

        // Для сообщений от бота используем markdown, для пользователя - простой текст

        Если Роль Тогда

            // Сообщения пользователя - простой текст с экранированием

            Текст = ЭкранироватьHTML(Сообщение.text);

            Текст = СтрЗаменить(Текст, Символы.ПС, "<br>");

            ТекстHTML = Текст;

        Иначе

            // Сообщения от бота рендерятся markdown напрямую после загрузки HTML.

            ТекстДляАтрибута = ЭкранироватьДляHTMLАтрибута(Сообщение.text);

            ТекстHTML = "<div class='markdown-content' data-markdown=""" + ТекстДляАтрибута + """></div>";

        КонецЕсли;



        // Время

        ВремяТекст = "";

        Если ПоказыватьВремя

            И Сообщение.Свойство("created_at")

            И ЗначениеЗаполнено(Сообщение.created_at) Тогда



            Попытка

                ДатаВремя = ПрочитатьДатуJSON(Сообщение.created_at, ФорматДатыJSON.ISO);

                ВремяТекст = "<div class='time'>" + Формат(ДатаВремя, "ДФ='HH:mm'") + "</div>";

            Исключение

            КонецПопытки;



        КонецЕсли;



        // Статус ИИ — только если status.id = "in_progress"

        СтатусHTML = "";

        Если НЕ Роль

            И Сообщение.Свойство("status")

            И ЗначениеЗаполнено(Сообщение.status)

            И Сообщение.status.Свойство("id")

            И Сообщение.status.id = "in_progress"

            И Сообщение.Свойство("status_message")

            И ЗначениеЗаполнено(Сообщение.status_message) Тогда



            СтатусТекст = ЭкранироватьHTML(Сообщение.status_message);

            СтатусHTML = "<div class='status'><span class='status-dot'></span>" + СтатусТекст + "</div>";

        КонецЕсли;



        // Сборка сообщения

        Если Роль Тогда

            HTML = HTML + "<div class='message user'>" + ТекстHTML + ВремяТекст + "</div>";

        Иначе

            HTML = HTML + "<div class='message bot'>" + ТекстHTML + СтатусHTML + ВремяТекст + "</div>";

        КонецЕсли;



    КонецЦикла;



    // === ПРОКРУТКА ВНИЗ И ОБРАБОТКА MARKDOWN ===

    HTML = HTML +

        "</div>" +

        // Подключаем библиотеки в конце body для гарантированной загрузки

        "<script src='https://cdn.jsdelivr.net/npm/marked@4.3.0/marked.min.js'></script>" +

        "<script src='https://cdn.jsdelivr.net/npm/highlight.js@11.9.0/lib/highlight.min.js'></script>" +

        "<script>" +

        " window.renderMarkdown = function(text) {" +

        "   marked.setOptions({gfm: true, breaks: true});" +

        "   return marked.parse(String(text || ''));" +

        " };" +

        " function decodeHtmlAttribute(str) {" +

        "   const txt = document.createElement('textarea');" +

        "   txt.innerHTML = String(str || '');" +

        "   const once = txt.value;" +

        "   txt.innerHTML = once;" +

        "   return txt.value;" +

        " }" +

        " function processMarkdown() {" +

        "   const markdownElements = document.querySelectorAll('[data-markdown]');" +

        "   markdownElements.forEach(function(el) {" +

        "     const encodedText = el.getAttribute('data-markdown');" +

        "     if (encodedText) {" +

        "       const text = decodeHtmlAttribute(encodedText);" +

        "       el.innerHTML = window.renderMarkdown(text);" +

        "       el.removeAttribute('data-markdown');" +

        "     }" +

        "   });" +

        "   setTimeout(function() {" +

        "     hljs.highlightAll();" +

        "   }, 100);" +

        "   const container = document.getElementById('messages');" +

        "   if (container) {" +

        "     container.scrollTop = container.scrollHeight;" +

        "   }" +

        " }" +

        " if (document.readyState === 'loading') {" +

        "   document.addEventListener('DOMContentLoaded', function() {" +

        "     processMarkdown();" +

        "   });" +

        " } else {" +

        "   processMarkdown();" +

        " }" +

        "</script>" +

        "</body></html>";



    Возврат HTML;



КонецФункции





// Ожидает ответа бота с опросом API

// Параметры:

//  СсылкаСессии - Строка - UUID сессии

//  ТекстПользователя - Строка - отправленное сообщение (для фильтрации)

//  ТаймаутСек - Число - максимальное время ожидания (по умолчанию 30)

//  ИнтервалОпросаМС - Число - интервал между запросами (по умолчанию 1000)

// Возвращаемое значение:

//  Структура - Успех (Булево), ОтветБота (Строка), Ошибка (Строка)

Функция ОжидатьОтветБота(СсылкаСессии, ТекстСообщения, Таймаут = 30, Интервал = 1000) Экспорт
    Возврат Новый Структура("Успех, Ответ, Ошибка", Истина, "", "");
КонецФункции



// Отправляет сообщение и обновляет чат

// Параметры:

//  Форма - УправляемаяФорма - форма с чатом

//  Текст - Строка - текст сообщения

Процедура ОтправитьСообщениеИОбновитьЧат(Форма, Текст, ТекущийЗапрос) Экспорт

	

	Если Не ЗначениеЗаполнено(Текст) Тогда

		Возврат;

	КонецЕсли;

	

	// 1. Отправляем сообщение

	Результат = ОтправитьСообщение(ЭтотОбъект.UUIDСессии, Текст, ТекущийЗапрос);

	Если Не Результат.Успех Тогда

		Сообщить("Ошибка отправки: " + Результат.Ошибка);

		Возврат;

	КонецЕсли;

	

	// 2. Обновляем чат сразу (добавляем своё сообщение)

	ОбновитьЧатНаФорме(Форма);

	

	// 3. Ожидаем ответ бота

	РезультатОжидания = ОжидатьОтветБота(ЭтотОбъект.UUIDСессии, Текст, 300);

	

	// 4. Обновляем чат с ответом бота

	ОбновитьЧатНаФорме(Форма);

	

	Если Не РезультатОжидания.Успех Тогда

		// Можно показать уведомление

		Сообщить("Бот не ответил: " + РезультатОжидания.Ошибка);

	КонецЕсли;

	

КонецПроцедуры



// Обновляет отображение чата на форме

// Параметры:

//  Форма - УправляемаяФорма - форма с реквизитами: СсылкаСессии, ЧатПоле (ПолеHTML)

Процедура ОбновитьЧатНаФорме(Форма) Экспорт

	

	Если Не ЗначениеЗаполнено(ЭтотОбъект.UUIDСессии) Тогда

		Форма.ИсторияЧата = "<html><body>Сессия не создана</body></html>";

		Возврат;

	КонецЕсли;

	

	Результат = ПолучитьИсториюСессии(ЭтотОбъект.UUIDСессии);

	Если Не Результат.Успех Тогда

		Форма.ИсторияЧата = "<html><body style='color:red;'>Ошибка загрузки чата: " + Результат.Ошибка + "</body></html>";

		Возврат;

	КонецЕсли;

	

	HTMLЧата = СформироватьHTMLЧата(Результат.Данные.results, Истина);

	Форма.ИсторияЧата = HTMLЧата;

	

	// Прокрутка вниз (для ПолеHTML)

	//Форма.Элементы.ИсторияЧата.ВыполнитьJavaScript("window.scrollTo(0, document.body.scrollHeight);");

	

КонецПроцедуры



// Очищает чат на форме

// Параметры:

//  Форма - УправляемаяФорма

Процедура ОчиститьЧатНаФорме(Форма) Экспорт

	

	Результат = ОчиститьДиалог(Форма.UUIDСессии);

	

	// Независимо от результата — обновляем интерфейс

	ОбновитьЧатНаФорме(Форма);

	

	Если Результат.Успех Тогда

		Сообщить("Диалог очищен");

	Иначе

		Сообщить("Ошибка очистки: " + Результат.Ошибка);

	КонецЕсли;

	

КонецПроцедуры



#КонецОбласти



#Область СлужебныеФункции



// Экранирует HTML-теги

Функция ЭкранироватьHTML(Текст)

	Текст = СтрЗаменить(Текст, "&", "&amp;");

	Текст = СтрЗаменить(Текст, "<", "&lt;");

	Текст = СтрЗаменить(Текст, ">", "&gt;");

	Текст = СтрЗаменить(Текст, """", "&quot;");

	Возврат Текст;

КонецФункции



// Экранирует строку для безопасной вставки в HTML-атрибут.

Функция ЭкранироватьДляHTMLАтрибута(Текст)

	Результат = Текст;

	Результат = СтрЗаменить(Результат, "&", "&amp;");

	Результат = СтрЗаменить(Результат, """", "&quot;");

	Результат = СтрЗаменить(Результат, "'", "&#39;");

	Возврат Результат;

КонецФункции



#КонецОбласти







мЗначенийСвойстваИндексирование = Метаданные.СвойстваОбъектов.Индексирование.Индексировать;

мЗначенийСвойстваИндексированиеСДопУпорядочиванием = Метаданные.СвойстваОбъектов.Индексирование.ИндексироватьСДопУпорядочиванием;



мСоответствиеРегистровИРегистраторов = Неопределено;

мСоответствиеРегистраторовЗаполнено = Ложь;



мТипСтрока = Тип("Строка");

мТипЧисло = Тип("Число");

мТипДата = Тип("Дата");

мТипБулево = Тип("Булево");

мТипХранилищеЗначения = Тип("ХранилищеЗначения");

мТипУникальныйИдентификатор = Тип("УникальныйИдентификатор");



